[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Railroader.ModManager/CodePatchers/Special/_HarmonyPluginPatcher.cs:28:68
     /// <param name="plugin">The plugin instance. Must not be null.</param>
     [UsedImplicitly]
     public static void OnIsEnabledChanged(IPlugin plugin) {
-        var state = _States.GetOrAdd(plugin, _ => new PatcherState(!plugin.IsEnabled, CreateHarmonyWrapper(plugin.Mod.Definition.Identifier)))!;
+        var state = _States.GetOrAdd(plugin, _ => new PatcherState(plugin.IsEnabled, CreateHarmonyWrapper(plugin.Mod.Definition.Identifier)))!;
         if (state.IsEnabled == plugin.IsEnabled) {
             return;

[NoCoverage] Equality mutation
Railroader.ModManager/CodePatchers/Special/_HarmonyPluginPatcher.cs:29:13
     [UsedImplicitly]
     public static void OnIsEnabledChanged(IPlugin plugin) {
         var state = _States.GetOrAdd(plugin, _ => new PatcherState(!plugin.IsEnabled, CreateHarmonyWrapper(plugin.Mod.Definition.Identifier)))!;
-        if (state.IsEnabled == plugin.IsEnabled) {
+        if (state.IsEnabled != plugin.IsEnabled) {
             return;
         }

[NoCoverage] Statement mutation
Railroader.ModManager/CodePatchers/Special/_HarmonyPluginPatcher.cs:30:13
     public static void OnIsEnabledChanged(IPlugin plugin) {
         var state = _States.GetOrAdd(plugin, _ => new PatcherState(!plugin.IsEnabled, CreateHarmonyWrapper(plugin.Mod.Definition.Identifier)))!;
         if (state.IsEnabled == plugin.IsEnabled) {
-            return;
+            ;
         }
 

[NoCoverage] Negate expression
Railroader.ModManager/CodePatchers/Special/_HarmonyPluginPatcher.cs:36:13
         _States[plugin] = state with { IsEnabled = plugin.IsEnabled };
 
         var logger = ModManager.ServiceProvider.GetService<ILoggerFactory>().GetLogger();
-        if (plugin.IsEnabled) {
+        if (!(plugin.IsEnabled)) {
             logger.Information("Applying Harmony patch for mod {ModId}", plugin.Mod.Definition.Identifier);
             state.Harmony.PatchAll(plugin.GetType().Assembly);

[NoCoverage] Statement mutation
Railroader.ModManager/CodePatchers/Special/_HarmonyPluginPatcher.cs:37:13
 
         var logger = ModManager.ServiceProvider.GetService<ILoggerFactory>().GetLogger();
         if (plugin.IsEnabled) {
-            logger.Information("Applying Harmony patch for mod {ModId}", plugin.Mod.Definition.Identifier);
+            ;
             state.Harmony.PatchAll(plugin.GetType().Assembly);
         } else {

[NoCoverage] Statement mutation
Railroader.ModManager/CodePatchers/Special/_HarmonyPluginPatcher.cs:38:13
         var logger = ModManager.ServiceProvider.GetService<ILoggerFactory>().GetLogger();
         if (plugin.IsEnabled) {
             logger.Information("Applying Harmony patch for mod {ModId}", plugin.Mod.Definition.Identifier);
-            state.Harmony.PatchAll(plugin.GetType().Assembly);
+            ;
         } else {
             logger.Information("Removing Harmony patch for mod {ModId}", plugin.Mod.Definition.Identifier);

[NoCoverage] Statement mutation
Railroader.ModManager/CodePatchers/Special/_HarmonyPluginPatcher.cs:40:13
             logger.Information("Applying Harmony patch for mod {ModId}", plugin.Mod.Definition.Identifier);
             state.Harmony.PatchAll(plugin.GetType().Assembly);
         } else {
-            logger.Information("Removing Harmony patch for mod {ModId}", plugin.Mod.Definition.Identifier);
+            ;
             state.Harmony.UnpatchAll(plugin.Mod.Definition.Identifier);
         }

[NoCoverage] Statement mutation
Railroader.ModManager/CodePatchers/Special/_HarmonyPluginPatcher.cs:41:13
             state.Harmony.PatchAll(plugin.GetType().Assembly);
         } else {
             logger.Information("Removing Harmony patch for mod {ModId}", plugin.Mod.Definition.Identifier);
-            state.Harmony.UnpatchAll(plugin.Mod.Definition.Identifier);
+            ;
         }
     }
