[NoCoverage] Null coalescing mutation (remove left)
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:30:63
         _Logger = loggerFactory.GetLogger();
         _TargetMethod = targetMethod;
 
-        var injectedMethod = typeof(TPluginPatcher).GetMethod(injectorMethod ?? targetMethod, BindingFlags.Public | BindingFlags.Static);
+        var injectedMethod = typeof(TPluginPatcher).GetMethod(targetMethod, BindingFlags.Public | BindingFlags.Static);
         if (injectedMethod == null || injectedMethod.ReturnType != typeof(void) || !injectedMethod.DeclaringType!.IsPublic) {
             throw new ArgumentException("Injected method must be public static void method on public class.", nameof(injectedMethod));

[NoCoverage] Bitwise mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:30:95
         _Logger = loggerFactory.GetLogger();
         _TargetMethod = targetMethod;
 
-        var injectedMethod = typeof(TPluginPatcher).GetMethod(injectorMethod ?? targetMethod, BindingFlags.Public | BindingFlags.Static);
+        var injectedMethod = typeof(TPluginPatcher).GetMethod(injectorMethod ?? targetMethod, BindingFlags.Public & BindingFlags.Static);
         if (injectedMethod == null || injectedMethod.ReturnType != typeof(void) || !injectedMethod.DeclaringType!.IsPublic) {
             throw new ArgumentException("Injected method must be public static void method on public class.", nameof(injectedMethod));

[NoCoverage] Negate expression
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:31:13
         _TargetMethod = targetMethod;
 
         var injectedMethod = typeof(TPluginPatcher).GetMethod(injectorMethod ?? targetMethod, BindingFlags.Public | BindingFlags.Static);
-        if (injectedMethod == null || injectedMethod.ReturnType != typeof(void) || !injectedMethod.DeclaringType!.IsPublic) {
+        if (!(injectedMethod == null || injectedMethod.ReturnType != typeof(void) || !injectedMethod.DeclaringType!.IsPublic)) {
             throw new ArgumentException("Injected method must be public static void method on public class.", nameof(injectedMethod));
         }

[NoCoverage] Equality mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:31:13
         _TargetMethod = targetMethod;
 
         var injectedMethod = typeof(TPluginPatcher).GetMethod(injectorMethod ?? targetMethod, BindingFlags.Public | BindingFlags.Static);
-        if (injectedMethod == null || injectedMethod.ReturnType != typeof(void) || !injectedMethod.DeclaringType!.IsPublic) {
+        if (injectedMethod != null || injectedMethod.ReturnType != typeof(void) || !injectedMethod.DeclaringType!.IsPublic) {
             throw new ArgumentException("Injected method must be public static void method on public class.", nameof(injectedMethod));
         }

[NoCoverage] Statement mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:32:13
 
         var injectedMethod = typeof(TPluginPatcher).GetMethod(injectorMethod ?? targetMethod, BindingFlags.Public | BindingFlags.Static);
         if (injectedMethod == null || injectedMethod.ReturnType != typeof(void) || !injectedMethod.DeclaringType!.IsPublic) {
-            throw new ArgumentException("Injected method must be public static void method on public class.", nameof(injectedMethod));
+            ;
         }
 

[NoCoverage] String mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:32:41
 
         var injectedMethod = typeof(TPluginPatcher).GetMethod(injectorMethod ?? targetMethod, BindingFlags.Public | BindingFlags.Static);
         if (injectedMethod == null || injectedMethod.ReturnType != typeof(void) || !injectedMethod.DeclaringType!.IsPublic) {
-            throw new ArgumentException("Injected method must be public static void method on public class.", nameof(injectedMethod));
+            throw new ArgumentException("", nameof(injectedMethod));
         }
 

[NoCoverage] Linq method mutation (Any() to All())
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:40:26
 
     public bool Patch(AssemblyDefinition assemblyDefinition, TypeDefinition typeDefinition) {
         var isBaseType = IsDerivedFromBaseType(typeDefinition);
-        var hasMarker  = typeDefinition.Interfaces.Any(i => i.InterfaceType?.FullName == typeof(TMarker).FullName);
+        var hasMarker  = typeDefinition.Interfaces.All(i => i.InterfaceType?.FullName == typeof(TMarker).FullName);
         if (!isBaseType || !hasMarker) {
             _Logger.Debug("Skipping patching for type {TypeName}: not derived from {BaseType} or does not implement {MarkerInterface}", typeDefinition.FullName, _TargetBaseType, typeof(TMarker));

[NoCoverage] Equality mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:40:61
 
     public bool Patch(AssemblyDefinition assemblyDefinition, TypeDefinition typeDefinition) {
         var isBaseType = IsDerivedFromBaseType(typeDefinition);
-        var hasMarker  = typeDefinition.Interfaces.Any(i => i.InterfaceType?.FullName == typeof(TMarker).FullName);
+        var hasMarker  = typeDefinition.Interfaces.Any(i => i.InterfaceType?.FullName != typeof(TMarker).FullName);
         if (!isBaseType || !hasMarker) {
             _Logger.Debug("Skipping patching for type {TypeName}: not derived from {BaseType} or does not implement {MarkerInterface}", typeDefinition.FullName, _TargetBaseType, typeof(TMarker));

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:41:13
     public bool Patch(AssemblyDefinition assemblyDefinition, TypeDefinition typeDefinition) {
         var isBaseType = IsDerivedFromBaseType(typeDefinition);
         var hasMarker  = typeDefinition.Interfaces.Any(i => i.InterfaceType?.FullName == typeof(TMarker).FullName);
-        if (!isBaseType || !hasMarker) {
+        if (isBaseType || !hasMarker) {
             _Logger.Debug("Skipping patching for type {TypeName}: not derived from {BaseType} or does not implement {MarkerInterface}", typeDefinition.FullName, _TargetBaseType, typeof(TMarker));
             return false;

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:41:28
     public bool Patch(AssemblyDefinition assemblyDefinition, TypeDefinition typeDefinition) {
         var isBaseType = IsDerivedFromBaseType(typeDefinition);
         var hasMarker  = typeDefinition.Interfaces.Any(i => i.InterfaceType?.FullName == typeof(TMarker).FullName);
-        if (!isBaseType || !hasMarker) {
+        if (!isBaseType || hasMarker) {
             _Logger.Debug("Skipping patching for type {TypeName}: not derived from {BaseType} or does not implement {MarkerInterface}", typeDefinition.FullName, _TargetBaseType, typeof(TMarker));
             return false;

[NoCoverage] Statement mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:42:13
         var isBaseType = IsDerivedFromBaseType(typeDefinition);
         var hasMarker  = typeDefinition.Interfaces.Any(i => i.InterfaceType?.FullName == typeof(TMarker).FullName);
         if (!isBaseType || !hasMarker) {
-            _Logger.Debug("Skipping patching for type {TypeName}: not derived from {BaseType} or does not implement {MarkerInterface}", typeDefinition.FullName, _TargetBaseType, typeof(TMarker));
+            ;
             return false;
         }

[NoCoverage] Boolean mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:43:20
         var hasMarker  = typeDefinition.Interfaces.Any(i => i.InterfaceType?.FullName == typeof(TMarker).FullName);
         if (!isBaseType || !hasMarker) {
             _Logger.Debug("Skipping patching for type {TypeName}: not derived from {BaseType} or does not implement {MarkerInterface}", typeDefinition.FullName, _TargetBaseType, typeof(TMarker));
-            return false;
+            return true;
         }
 

[NoCoverage] Equality mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:48:13
 
         var module = assemblyDefinition.MainModule;
         var method = GetOrCreateOverride(typeDefinition, module);
-        if (method == null) {
+        if (method != null) {
             return false;
         }

[NoCoverage] Boolean mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:49:20
         var module = assemblyDefinition.MainModule;
         var method = GetOrCreateOverride(typeDefinition, module);
         if (method == null) {
-            return false;
+            return true;
         }
 

[NoCoverage] Linq method mutation (Any() to All())
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:58:30
         // Inject patcher call (for BOTH existing AND created methods)
         var ilProcessor  = method.Body.GetILProcessor();
         var instructions = method.Body.Instructions;
-        var hasPatcherCall = instructions.Any(i => i.OpCode == OpCodes.Call &&
+        var hasPatcherCall = instructions.All(i => i.OpCode == OpCodes.Call &&
                                                     i.Operand is MethodReference mr &&
                                                     mr.FullName == injectedMethodReference.FullName);

[NoCoverage] Equality mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:58:52
         // Inject patcher call (for BOTH existing AND created methods)
         var ilProcessor  = method.Body.GetILProcessor();
         var instructions = method.Body.Instructions;
-        var hasPatcherCall = instructions.Any(i => i.OpCode == OpCodes.Call &&
+        var hasPatcherCall = instructions.Any(i => i.OpCode != OpCodes.Call &&
                                                     i.Operand is MethodReference mr &&
                                                     mr.FullName == injectedMethodReference.FullName);

[NoCoverage] Equality mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:60:53
         var instructions = method.Body.Instructions;
         var hasPatcherCall = instructions.Any(i => i.OpCode == OpCodes.Call &&
                                                     i.Operand is MethodReference mr &&
-                                                    mr.FullName == injectedMethodReference.FullName);
+                                                    mr.FullName != injectedMethodReference.FullName);
 
         if (hasPatcherCall) {

[NoCoverage] Negate expression
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:62:13
                                                     i.Operand is MethodReference mr &&
                                                     mr.FullName == injectedMethodReference.FullName);
 
-        if (hasPatcherCall) {
+        if (!(hasPatcherCall)) {
             _Logger.Information("Skipping patch of {TypeName} as it already contain code for {PluginInterface}", typeDefinition.FullName, typeof(TMarker).FullName);
             return false;

[NoCoverage] Statement mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:63:13
                                                     mr.FullName == injectedMethodReference.FullName);
 
         if (hasPatcherCall) {
-            _Logger.Information("Skipping patch of {TypeName} as it already contain code for {PluginInterface}", typeDefinition.FullName, typeof(TMarker).FullName);
+            ;
             return false;
         }

[NoCoverage] Boolean mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:64:20
 
         if (hasPatcherCall) {
             _Logger.Information("Skipping patch of {TypeName} as it already contain code for {PluginInterface}", typeDefinition.FullName, typeof(TMarker).FullName);
-            return false;
+            return true;
         }
 

[NoCoverage] Statement mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:69:9
 
         // Insert at BEGINNING (before FIRST instruction)
         var firstInstruction = instructions[0]!;
-        ilProcessor.InsertBefore(firstInstruction, ilProcessor.Create(OpCodes.Ldarg_0));
+        ;
         ilProcessor.InsertBefore(firstInstruction, ilProcessor.Create(OpCodes.Call, injectedMethodReference));
 

[NoCoverage] Statement mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:70:9
         // Insert at BEGINNING (before FIRST instruction)
         var firstInstruction = instructions[0]!;
         ilProcessor.InsertBefore(firstInstruction, ilProcessor.Create(OpCodes.Ldarg_0));
-        ilProcessor.InsertBefore(firstInstruction, ilProcessor.Create(OpCodes.Call, injectedMethodReference));
+        ;
 
         _Logger.Information("Successfully patched {TypeName} for {PluginInterface}", typeDefinition.FullName, typeof(TMarker).FullName);

[NoCoverage] Statement mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:72:9
         ilProcessor.InsertBefore(firstInstruction, ilProcessor.Create(OpCodes.Ldarg_0));
         ilProcessor.InsertBefore(firstInstruction, ilProcessor.Create(OpCodes.Call, injectedMethodReference));
 
-        _Logger.Information("Successfully patched {TypeName} for {PluginInterface}", typeDefinition.FullName, typeof(TMarker).FullName);
+        ;
         return true;
     }

[NoCoverage] String mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:72:29
         ilProcessor.InsertBefore(firstInstruction, ilProcessor.Create(OpCodes.Ldarg_0));
         ilProcessor.InsertBefore(firstInstruction, ilProcessor.Create(OpCodes.Call, injectedMethodReference));
 
-        _Logger.Information("Successfully patched {TypeName} for {PluginInterface}", typeDefinition.FullName, typeof(TMarker).FullName);
+        _Logger.Information("", typeDefinition.FullName, typeof(TMarker).FullName);
         return true;
     }

[NoCoverage] Boolean mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:73:16
         ilProcessor.InsertBefore(firstInstruction, ilProcessor.Create(OpCodes.Call, injectedMethodReference));
 
         _Logger.Information("Successfully patched {TypeName} for {PluginInterface}", typeDefinition.FullName, typeof(TMarker).FullName);
-        return true;
+        return false;
     }
 

[NoCoverage] Equality mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:77:52
     }
 
     private MethodDefinition? GetOrCreateOverride(TypeDefinition typeDefinition, ModuleDefinition module) =>
-        typeDefinition.Methods.FirstOrDefault(m => m.Name == _TargetMethod) ?? CreateMethodOverride(typeDefinition, module);
+        typeDefinition.Methods.FirstOrDefault(m => m.Name != _TargetMethod) ?? CreateMethodOverride(typeDefinition, module);
 
     private bool IsDerivedFromBaseType(TypeDefinition typeDefinition) {

[NoCoverage] Null coalescing mutation (remove right)
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:77:9
     }
 
     private MethodDefinition? GetOrCreateOverride(TypeDefinition typeDefinition, ModuleDefinition module) =>
-        typeDefinition.Methods.FirstOrDefault(m => m.Name == _TargetMethod) ?? CreateMethodOverride(typeDefinition, module);
+        typeDefinition.Methods.FirstOrDefault(m => m.Name == _TargetMethod);
 
     private bool IsDerivedFromBaseType(TypeDefinition typeDefinition) {

[NoCoverage] Conditional (false) mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:81:13
 
     private bool IsDerivedFromBaseType(TypeDefinition typeDefinition) {
         Func<TypeReference, string?> getFullName =
-            _TargetBaseType.IsGenericTypeDefinition
-                ? reference => (reference as GenericInstanceType)?.ElementType?.FullName
-                : reference => reference?.FullName;
+            (false?reference => (reference as GenericInstanceType)?.ElementType?.FullName
+:reference => reference?.FullName);
 
         var currentType = typeDefinition;

[NoCoverage] Conditional (true) mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:81:13
 
     private bool IsDerivedFromBaseType(TypeDefinition typeDefinition) {
         Func<TypeReference, string?> getFullName =
-            _TargetBaseType.IsGenericTypeDefinition
-                ? reference => (reference as GenericInstanceType)?.ElementType?.FullName
-                : reference => reference?.FullName;
+            (true?reference => (reference as GenericInstanceType)?.ElementType?.FullName
+:reference => reference?.FullName);
 
         var currentType = typeDefinition;

[NoCoverage] Equality mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:86:16
                 : reference => reference?.FullName;
 
         var currentType = typeDefinition;
-        while (currentType != null) {
+        while (currentType == null) {
             var baseType = currentType.BaseType;
 

[NoCoverage] Equality mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:90:17
             var baseType = currentType.BaseType;
 
             var fullName = getFullName(baseType);
-            if (fullName == _TargetBaseType.FullName) {
+            if (fullName != _TargetBaseType.FullName) {
                 return true;
             }

[NoCoverage] Boolean mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:91:24
 
             var fullName = getFullName(baseType);
             if (fullName == _TargetBaseType.FullName) {
-                return true;
+                return false;
             }
 

[NoCoverage] Statement mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:101:9
     }
 
     private MethodDefinition? CreateMethodOverride(TypeDefinition typeDefinition, ModuleDefinition module) {
-        _Logger.Debug("{MethodName} method not found in {TypeName}, creating override", _TargetMethod, typeDefinition.FullName);
+        ;
 
         var baseMethodDef = FindVirtualBaseMethod(typeDefinition.BaseType);

[NoCoverage] Equality mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:104:13
         _Logger.Debug("{MethodName} method not found in {TypeName}, creating override", _TargetMethod, typeDefinition.FullName);
 
         var baseMethodDef = FindVirtualBaseMethod(typeDefinition.BaseType);
-        if (baseMethodDef == null) {
+        if (baseMethodDef != null) {
             _Logger.Error("Virtual method '{MethodName}' not found in {TypeName} hierarchy!", _TargetMethod, typeDefinition.FullName);
             return null;

[NoCoverage] Statement mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:105:13
 
         var baseMethodDef = FindVirtualBaseMethod(typeDefinition.BaseType);
         if (baseMethodDef == null) {
-            _Logger.Error("Virtual method '{MethodName}' not found in {TypeName} hierarchy!", _TargetMethod, typeDefinition.FullName);
+            ;
             return null;
         }

[NoCoverage] String mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:105:27
 
         var baseMethodDef = FindVirtualBaseMethod(typeDefinition.BaseType);
         if (baseMethodDef == null) {
-            _Logger.Error("Virtual method '{MethodName}' not found in {TypeName} hierarchy!", _TargetMethod, typeDefinition.FullName);
+            _Logger.Error("", _TargetMethod, typeDefinition.FullName);
             return null;
         }

[NoCoverage] Bitwise mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:111:62
 
         var baseMethodRef = module.ImportReference(baseMethodDef);
 
-        var methodAttributes = (baseMethodDef.Attributes & ~(MethodAttributes.Final | MethodAttributes.NewSlot)) | MethodAttributes.HideBySig;
+        var methodAttributes = (baseMethodDef.Attributes & ~(MethodAttributes.Final & MethodAttributes.NewSlot)) | MethodAttributes.HideBySig;
 
         var method = new MethodDefinition(_TargetMethod, methodAttributes, module.ImportReference(baseMethodDef.ReturnType));

[NoCoverage] Bitwise mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:111:32
 
         var baseMethodRef = module.ImportReference(baseMethodDef);
 
-        var methodAttributes = (baseMethodDef.Attributes & ~(MethodAttributes.Final | MethodAttributes.NewSlot)) | MethodAttributes.HideBySig;
+        var methodAttributes = (baseMethodDef.Attributes & ~(MethodAttributes.Final | MethodAttributes.NewSlot)) & MethodAttributes.HideBySig;
 
         var method = new MethodDefinition(_TargetMethod, methodAttributes, module.ImportReference(baseMethodDef.ReturnType));

[NoCoverage] Statement mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:116:13
         var method = new MethodDefinition(_TargetMethod, methodAttributes, module.ImportReference(baseMethodDef.ReturnType));
 
         foreach (var param in baseMethodDef.Parameters) {
-            method.Parameters.Add(new ParameterDefinition(param.Name, param.Attributes, module.ImportReference(param.ParameterType)));
+            ;
         }
         

[NoCoverage] Statement mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:120:9
         }
         
         var il = method.Body.GetILProcessor();
-        il.Append(il.Create(OpCodes.Ldarg_0));
+        ;
 
         for (var i = 0; i < baseMethodDef.Parameters.Count; i++) {

[NoCoverage] Equality mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:122:25
         var il = method.Body.GetILProcessor();
         il.Append(il.Create(OpCodes.Ldarg_0));
 
-        for (var i = 0; i < baseMethodDef.Parameters.Count; i++) {
+        for (var i = 0; i <= baseMethodDef.Parameters.Count; i++) {
 
             var ilCode = i switch {

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:122:61
         var il = method.Body.GetILProcessor();
         il.Append(il.Create(OpCodes.Ldarg_0));
 
-        for (var i = 0; i < baseMethodDef.Parameters.Count; i++) {
+        for (var i = 0; i < baseMethodDef.Parameters.Count; i--) {
 
             var ilCode = i switch {

[NoCoverage] Statement mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:130:13
                 2 => il.Create(OpCodes.Ldarg_3),
                 _ => il.Create(OpCodes.Ldarg_S, method.Parameters[i]!),
             };
-            il.Append(ilCode);
+            ;
         }
 

[NoCoverage] Statement mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:134:9
         }
 
 
-        il.Append(il.Create(OpCodes.Call, baseMethodRef));
+        ;
         il.Append(il.Create(OpCodes.Ret));
         

[NoCoverage] Statement mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:135:9
 
 
         il.Append(il.Create(OpCodes.Call, baseMethodRef));
-        il.Append(il.Create(OpCodes.Ret));
+        ;
         
         typeDefinition.Methods.Add(method);

[NoCoverage] Statement mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:137:9
         il.Append(il.Create(OpCodes.Call, baseMethodRef));
         il.Append(il.Create(OpCodes.Ret));
         
-        typeDefinition.Methods.Add(method);
+        ;
         _Logger.Debug("Created {MethodName} override with base call in {TypeName}", _TargetMethod, typeDefinition.FullName);
         return method;

[NoCoverage] Statement mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:138:9
         il.Append(il.Create(OpCodes.Ret));
         
         typeDefinition.Methods.Add(method);
-        _Logger.Debug("Created {MethodName} override with base call in {TypeName}", _TargetMethod, typeDefinition.FullName);
+        ;
         return method;
     }

[NoCoverage] String mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:138:23
         il.Append(il.Create(OpCodes.Ret));
         
         typeDefinition.Methods.Add(method);
-        _Logger.Debug("Created {MethodName} override with base call in {TypeName}", _TargetMethod, typeDefinition.FullName);
+        _Logger.Debug("", _TargetMethod, typeDefinition.FullName);
         return method;
     }

[NoCoverage] Equality mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:144:16
 
     private MethodDefinition? FindVirtualBaseMethod(TypeReference? baseTypeRef) {
         var current = baseTypeRef?.Resolve();
-        while (current != null) {
+        while (current == null) {
             var method = current.Methods.FirstOrDefault(m => m.Name == _TargetMethod && m.IsVirtual);
             if (method != null) {

[NoCoverage] Equality mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:145:62
     private MethodDefinition? FindVirtualBaseMethod(TypeReference? baseTypeRef) {
         var current = baseTypeRef?.Resolve();
         while (current != null) {
-            var method = current.Methods.FirstOrDefault(m => m.Name == _TargetMethod && m.IsVirtual);
+            var method = current.Methods.FirstOrDefault(m => m.Name != _TargetMethod && m.IsVirtual);
             if (method != null) {
                 return method;

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:145:26
     private MethodDefinition? FindVirtualBaseMethod(TypeReference? baseTypeRef) {
         var current = baseTypeRef?.Resolve();
         while (current != null) {
-            var method = current.Methods.FirstOrDefault(m => m.Name == _TargetMethod && m.IsVirtual);
+            var method = current.Methods.First(m => m.Name == _TargetMethod && m.IsVirtual);
             if (method != null) {
                 return method;

[NoCoverage] Equality mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:146:17
         var current = baseTypeRef?.Resolve();
         while (current != null) {
             var method = current.Methods.FirstOrDefault(m => m.Name == _TargetMethod && m.IsVirtual);
-            if (method != null) {
+            if (method == null) {
                 return method;
             }

[NoCoverage] Block removal mutation
src/Railroader.ModManager/CodePatchers/_MethodPatcher.cs:146:33
         var current = baseTypeRef?.Resolve();
         while (current != null) {
             var method = current.Methods.FirstOrDefault(m => m.Name == _TargetMethod && m.IsVirtual);
-            if (method != null) {
-                return method;
-            }
+            if (method != null) {}
 
             current = current.BaseType?.Resolve();
