[Killed] Block removal mutation
src/Railroader.ModManager/CodePatchers/_TypePatcher.cs:15:57
 {
     private readonly IMethodPatcher[] _MethodPatchers;
 
-    public TypePatcher(IMethodPatcher[] methodPatchers) {
-        _MethodPatchers = methodPatchers;
-    }
+    public TypePatcher(IMethodPatcher[] methodPatchers) {}
 
     public bool Patch(AssemblyDefinition assemblyDefinition, TypeDefinition typeDefinition)
killedBy: Railroader.ModManager.Tests.CodePatchers.TestsTypePatcher.CallAllMethodPatchers

[Killed] Linq method mutation (Any() to All())
src/Railroader.ModManager/CodePatchers/_TypePatcher.cs:20:12
     }
 
     public bool Patch(AssemblyDefinition assemblyDefinition, TypeDefinition typeDefinition)
-        => _MethodPatchers.Select(o => o.Patch(assemblyDefinition, typeDefinition)).Any(o => o);
+        => _MethodPatchers.Select(o => o.Patch(assemblyDefinition, typeDefinition)).All(o => o);
 }
 
killedBy: Railroader.ModManager.Tests.CodePatchers.TestsTypePatcher.CallAllMethodPatchers
