[Killed] Statement mutation
src/Railroader.ModManager/JsonConverters/LogEventLevelJsonConverter.cs:13:9
 {
     /// <inheritdoc />
     public override void WriteJson(JsonWriter writer, LogEventLevel? value, JsonSerializer serializer) {
-        writer.WriteValue(value.ToString());
+        ;
     }
 
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsLogEventLevelJsonConverter.WriteJsonNotSupported

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/JsonConverters/LogEventLevelJsonConverter.cs:24:21
 
             case JsonToken.String: {
                 var raw = (string)reader.Value!;
-                if (!Enum.TryParse<LogEventLevel>(raw, true, out var parsed)) {
+                if (Enum.TryParse<LogEventLevel>(raw, true, out var parsed)) {
                     var validValues = Enum.GetValues(typeof(LogEventLevel)).Cast<LogEventLevel>().Select(o => $"'{o}'");
                     throw new JsonReaderException($"Unexpected token value '{raw}' when reading {typeof(LogEventLevel?)}. Expected: {string.Join(", ", validValues)} or null");
killedBy: Railroader.ModManager.Tests.TestsModDefinition.LoadFromValidJsonCorrectly; Railroader.ModManager.Tests.TestsModDefinition.LoadFromInvalidJson_MissingName; Railroader.ModManager.Tests.TestsModDefinition.LoadFromInvalidJson_MissingId

[Killed] Boolean mutation
src/Railroader.ModManager/JsonConverters/LogEventLevelJsonConverter.cs:24:56
 
             case JsonToken.String: {
                 var raw = (string)reader.Value!;
-                if (!Enum.TryParse<LogEventLevel>(raw, true, out var parsed)) {
+                if (!Enum.TryParse<LogEventLevel>(raw, false, out var parsed)) {
                     var validValues = Enum.GetValues(typeof(LogEventLevel)).Cast<LogEventLevel>().Select(o => $"'{o}'");
                     throw new JsonReaderException($"Unexpected token value '{raw}' when reading {typeof(LogEventLevel?)}. Expected: {string.Join(", ", validValues)} or null");
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsLogEventLevelJsonConverter.ReadValidJson

[Killed] String mutation
src/Railroader.ModManager/JsonConverters/LogEventLevelJsonConverter.cs:26:146
                 var raw = (string)reader.Value!;
                 if (!Enum.TryParse<LogEventLevel>(raw, true, out var parsed)) {
                     var validValues = Enum.GetValues(typeof(LogEventLevel)).Cast<LogEventLevel>().Select(o => $"'{o}'");
-                    throw new JsonReaderException($"Unexpected token value '{raw}' when reading {typeof(LogEventLevel?)}. Expected: {string.Join(", ", validValues)} or null");
+                    throw new JsonReaderException($"Unexpected token value '{raw}' when reading {typeof(LogEventLevel?)}. Expected: {string.Join("", validValues)} or null");
                 }
 
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsLogEventLevelJsonConverter.ReadInvalidValue

[Killed] String mutation
src/Railroader.ModManager/JsonConverters/LogEventLevelJsonConverter.cs:26:51
                 var raw = (string)reader.Value!;
                 if (!Enum.TryParse<LogEventLevel>(raw, true, out var parsed)) {
                     var validValues = Enum.GetValues(typeof(LogEventLevel)).Cast<LogEventLevel>().Select(o => $"'{o}'");
-                    throw new JsonReaderException($"Unexpected token value '{raw}' when reading {typeof(LogEventLevel?)}. Expected: {string.Join(", ", validValues)} or null");
+                    throw new JsonReaderException($"");
                 }
 
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsLogEventLevelJsonConverter.ReadInvalidValue
