[Killed] Statement mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:15:9
 {
     /// <inheritdoc />
     public override void WriteJson(JsonWriter writer, Dictionary<string, FluentVersion?>? value, JsonSerializer serializer) {
-        writer.WriteStartObject();
+        ;
         foreach (var pair in value!.OrderBy(o => o.Key)) {
             writer.WritePropertyName(pair.Key);
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.WriteJson

[Killed] Linq method mutation (OrderBy() to OrderByDescending())
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:16:30
     /// <inheritdoc />
     public override void WriteJson(JsonWriter writer, Dictionary<string, FluentVersion?>? value, JsonSerializer serializer) {
         writer.WriteStartObject();
-        foreach (var pair in value!.OrderBy(o => o.Key)) {
+        foreach (var pair in value!.OrderByDescending(o => o.Key)) {
             writer.WritePropertyName(pair.Key);
             if (pair.Value == null) {
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.WriteJson

[Killed] Statement mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:17:13
     public override void WriteJson(JsonWriter writer, Dictionary<string, FluentVersion?>? value, JsonSerializer serializer) {
         writer.WriteStartObject();
         foreach (var pair in value!.OrderBy(o => o.Key)) {
-            writer.WritePropertyName(pair.Key);
+            ;
             if (pair.Value == null) {
                 writer.WriteNull();
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.WriteJson

[Killed] Equality mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:18:17
         writer.WriteStartObject();
         foreach (var pair in value!.OrderBy(o => o.Key)) {
             writer.WritePropertyName(pair.Key);
-            if (pair.Value == null) {
+            if (pair.Value != null) {
                 writer.WriteNull();
             } else {
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.WriteJson

[Killed] Statement mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:19:17
         foreach (var pair in value!.OrderBy(o => o.Key)) {
             writer.WritePropertyName(pair.Key);
             if (pair.Value == null) {
-                writer.WriteNull();
+                ;
             } else {
                 writer.WriteValue(pair.Value.ToString());
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.WriteJson

[Killed] Statement mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:21:17
             if (pair.Value == null) {
                 writer.WriteNull();
             } else {
-                writer.WriteValue(pair.Value.ToString());
+                ;
             }
         }
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.WriteJson

[Killed] Block removal mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:28:49
 
     /// <inheritdoc />
-        if (reader.TokenType == JsonToken.Null) {
-            return new Dictionary<string, FluentVersion?>();
-        }
+        if (reader.TokenType == JsonToken.Null) {}
 
         var jObject = JObject.Load(reader);
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadNullDictionary

[Killed] Equality mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:28:13
 
     /// <inheritdoc />
-        if (reader.TokenType == JsonToken.Null) {
+        if (reader.TokenType != JsonToken.Null) {
             return new Dictionary<string, FluentVersion?>();
         }
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidType; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] Equality mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:37:17
 
         foreach (var property in jObject.Properties()) {
             var identifier = property.Name;
-            if (property.Value.Type == JTokenType.Null) {
+            if (property.Value.Type != JTokenType.Null) {
                 result.Add(identifier, null);
                 continue;
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidType; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] Statement mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:38:17
         foreach (var property in jObject.Properties()) {
             var identifier = property.Name;
             if (property.Value.Type == JTokenType.Null) {
-                result.Add(identifier, null);
+                ;
                 continue;
             }
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] Statement mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:39:17
             var identifier = property.Name;
             if (property.Value.Type == JTokenType.Null) {
                 result.Add(identifier, null);
-                continue;
+                ;
             }
 
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] Equality mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:42:17
                 continue;
             }
 
-            if (property.Value.Type != JTokenType.String) {
+            if (property.Value.Type == JTokenType.String) {
                 throw new JsonSerializationException($"Invalid version constraint for mod '{identifier}' in {objectType.Name}. Expected a string.");
             }
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidType; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] Statement mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:43:17
             }
 
             if (property.Value.Type != JTokenType.String) {
-                throw new JsonSerializationException($"Invalid version constraint for mod '{identifier}' in {objectType.Name}. Expected a string.");
+                ;
             }
 
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidType

[Killed] String mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:43:54
             }
 
             if (property.Value.Type != JTokenType.String) {
-                throw new JsonSerializationException($"Invalid version constraint for mod '{identifier}' in {objectType.Name}. Expected a string.");
+                throw new JsonSerializationException($"");
             }
 
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidType

[Killed] Statement mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:48:13
 
             var constraint    = property.Value.ToString();
             var fluentVersion = ParseVersionConstraint(constraint, identifier);
-            result.Add(identifier, fluentVersion);
+            ;
         }
 
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] Negate expression
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:55:13
     }
 
     private static FluentVersion? ParseVersionConstraint(string constraint, string identifier) {
-        if (string.IsNullOrEmpty(constraint)) {
+        if (!(string.IsNullOrEmpty(constraint))) {
             return null;
         }
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] Block removal mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:55:47
     }
 
     private static FluentVersion? ParseVersionConstraint(string constraint, string identifier) {
-        if (string.IsNullOrEmpty(constraint)) {
-            return null;
-        }
+        if (string.IsNullOrEmpty(constraint)) {}
 
 
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] Conditional (true) mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:61:20
 
 
         var (op, skip) = constraint[0] switch {
-            '>' => constraint.Length > 1 && constraint[1] == '=' ? (VersionOperator.GreaterOrEqual, 2) : (VersionOperator.GreaterThan, 1),
+            '>' => (true?(VersionOperator.GreaterOrEqual, 2) :(VersionOperator.GreaterThan, 1)),
             '<' => constraint.Length > 1 && constraint[1] == '=' ? (VersionOperator.LessOrEqual, 2) : (VersionOperator.LessThan, 1),
             '=' => (VersionOperator.Equal, 1),
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidJson

[Killed] Conditional (false) mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:61:20
 
 
         var (op, skip) = constraint[0] switch {
-            '>' => constraint.Length > 1 && constraint[1] == '=' ? (VersionOperator.GreaterOrEqual, 2) : (VersionOperator.GreaterThan, 1),
+            '>' => (false?(VersionOperator.GreaterOrEqual, 2) :(VersionOperator.GreaterThan, 1)),
             '<' => constraint.Length > 1 && constraint[1] == '=' ? (VersionOperator.LessOrEqual, 2) : (VersionOperator.LessThan, 1),
             '=' => (VersionOperator.Equal, 1),
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] Conditional (false) mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:62:20
 
         var (op, skip) = constraint[0] switch {
             '>' => constraint.Length > 1 && constraint[1] == '=' ? (VersionOperator.GreaterOrEqual, 2) : (VersionOperator.GreaterThan, 1),
-            '<' => constraint.Length > 1 && constraint[1] == '=' ? (VersionOperator.LessOrEqual, 2) : (VersionOperator.LessThan, 1),
+            '<' => (false?(VersionOperator.LessOrEqual, 2) :(VersionOperator.LessThan, 1)),
             '=' => (VersionOperator.Equal, 1),
             '0' or '1' or '2' or '3' or '4' or '5' or '6' or '7' or '8' or '9'
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] Logical mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:62:20
 
         var (op, skip) = constraint[0] switch {
             '>' => constraint.Length > 1 && constraint[1] == '=' ? (VersionOperator.GreaterOrEqual, 2) : (VersionOperator.GreaterThan, 1),
-            '<' => constraint.Length > 1 && constraint[1] == '=' ? (VersionOperator.LessOrEqual, 2) : (VersionOperator.LessThan, 1),
+            '<' => constraint.Length > 1 || constraint[1] == '=' ? (VersionOperator.LessOrEqual, 2) : (VersionOperator.LessThan, 1),
             '=' => (VersionOperator.Equal, 1),
             '0' or '1' or '2' or '3' or '4' or '5' or '6' or '7' or '8' or '9'
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidJson

[Killed] Logical mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:64:13
             '>' => constraint.Length > 1 && constraint[1] == '=' ? (VersionOperator.GreaterOrEqual, 2) : (VersionOperator.GreaterThan, 1),
             '<' => constraint.Length > 1 && constraint[1] == '=' ? (VersionOperator.LessOrEqual, 2) : (VersionOperator.LessThan, 1),
             '=' => (VersionOperator.Equal, 1),
-            '0' or '1' or '2' or '3' or '4' or '5' or '6' or '7' or '8' or '9'
+            '0' or '1' or '2' or '3' or '4' and '5' or '6' or '7' or '8' or '9'
                 => (VersionOperator.GreaterOrEqual, 0),
             _ => (VersionOperator.Equal, -1)
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] Logical mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:64:13
             '>' => constraint.Length > 1 && constraint[1] == '=' ? (VersionOperator.GreaterOrEqual, 2) : (VersionOperator.GreaterThan, 1),
             '<' => constraint.Length > 1 && constraint[1] == '=' ? (VersionOperator.LessOrEqual, 2) : (VersionOperator.LessThan, 1),
             '=' => (VersionOperator.Equal, 1),
-            '0' or '1' or '2' or '3' or '4' or '5' or '6' or '7' or '8' or '9'
+            '0' or '1' or '2' or '3' or '4' or '5' or '6' and '7' or '8' or '9'
                 => (VersionOperator.GreaterOrEqual, 0),
             _ => (VersionOperator.Equal, -1)
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] UnaryMinusExpression to UnaryPlusExpression mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:66:42
             '=' => (VersionOperator.Equal, 1),
             '0' or '1' or '2' or '3' or '4' or '5' or '6' or '7' or '8' or '9'
                 => (VersionOperator.GreaterOrEqual, 0),
-            _ => (VersionOperator.Equal, -1)
+            _ => (VersionOperator.Equal, +1)
         };
 
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidJson

[Killed] Equality mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:69:13
             _ => (VersionOperator.Equal, -1)
         };
 
-        if (skip != -1) {
+        if (skip == -1) {
             var version = VersionJsonConverter.ParseString(constraint.Substring(skip).TrimStart());
             if (version != null) {
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] UnaryMinusExpression to UnaryPlusExpression mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:69:21
             _ => (VersionOperator.Equal, -1)
         };
 
-        if (skip != -1) {
+        if (skip != +1) {
             var version = VersionJsonConverter.ParseString(constraint.Substring(skip).TrimStart());
             if (version != null) {
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] Equality mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:71:17
 
         if (skip != -1) {
             var version = VersionJsonConverter.ParseString(constraint.Substring(skip).TrimStart());
-            if (version != null) {
+            if (version == null) {
                 return new FluentVersion(version, op);
             }
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] Block removal mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:71:34
 
         if (skip != -1) {
             var version = VersionJsonConverter.ParseString(constraint.Substring(skip).TrimStart());
-            if (version != null) {
-                return new FluentVersion(version, op);
-            }
+            if (version != null) {}
         }
 
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson
