[Killed] Statement mutation
src/Railroader.ModManager/JsonConverters/VersionJsonConverter.cs:13:9
 
     /// <inheritdoc />
     public override void WriteJson(JsonWriter writer, Version? value, JsonSerializer serializer) {
-        writer.WriteValue(value!.ToString());
+        ;
     }
 
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsVersionJsonConverter.WriteJson

[Killed] Equality mutation
src/Railroader.ModManager/JsonConverters/VersionJsonConverter.cs:18:13
 
     /// <inheritdoc />
     public override Version ReadJson(JsonReader reader, Type objectType, Version? existingValue, bool hasExistingValue, JsonSerializer serializer) {
-        if (reader.TokenType == JsonToken.String) {
+        if (reader.TokenType != JsonToken.String) {
             var value   = Convert.ToString(reader.Value!);
 
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsVersionJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsVersionJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsVersionJsonConverter.ReadValidJson

[Killed] Equality mutation
src/Railroader.ModManager/JsonConverters/VersionJsonConverter.cs:22:17
             var value   = Convert.ToString(reader.Value!);
 
             var version = ParseString(value);
-            if (version == null) {
+            if (version != null) {
                 throw new JsonSerializationException($"Invalid version format '{value}'. {Expected}");
             }
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsVersionJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsVersionJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsVersionJsonConverter.ReadValidJson

[Killed] Statement mutation
src/Railroader.ModManager/JsonConverters/VersionJsonConverter.cs:23:17
 
             var version = ParseString(value);
             if (version == null) {
-                throw new JsonSerializationException($"Invalid version format '{value}'. {Expected}");
+                ;
             }
 
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsVersionJsonConverter.ReadInvalidValue; Railroader.ModManager.Tests.JsonConverters.TestsVersionJsonConverter.ReadInvalidValue

[Killed] Statement mutation
src/Railroader.ModManager/JsonConverters/VersionJsonConverter.cs:29:9
             return version;
         }
 
-        throw new JsonSerializationException($"Invalid version token {reader.TokenType}. {Expected}");
+        ;
     }
 
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsVersionJsonConverter.ReadInvalidType; Railroader.ModManager.Tests.JsonConverters.TestsVersionJsonConverter.ReadInvalidType

[Killed] String mutation
src/Railroader.ModManager/JsonConverters/VersionJsonConverter.cs:29:46
             return version;
         }
 
-        throw new JsonSerializationException($"Invalid version token {reader.TokenType}. {Expected}");
+        throw new JsonSerializationException($"");
     }
 
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsVersionJsonConverter.ReadInvalidType; Railroader.ModManager.Tests.JsonConverters.TestsVersionJsonConverter.ReadInvalidType

[Killed] Equality mutation
src/Railroader.ModManager/JsonConverters/VersionJsonConverter.cs:33:13
     }
 
     public static Version? ParseString(string value) {
-        if (value.IndexOf('.') == -1) { // to support "version": "1" instead of "1.0"
+        if (value.IndexOf('.') != -1) { // to support "version": "1" instead of "1.0"
             value += ".0";
         }
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] UnaryMinusExpression to UnaryPlusExpression mutation
src/Railroader.ModManager/JsonConverters/VersionJsonConverter.cs:33:35
     }
 
     public static Version? ParseString(string value) {
-        if (value.IndexOf('.') == -1) { // to support "version": "1" instead of "1.0"
+        if (value.IndexOf('.') == +1) { // to support "version": "1" instead of "1.0"
             value += ".0";
         }
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsVersionJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsVersionJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsVersionJsonConverter.ReadValidJson

[Killed] String mutation
src/Railroader.ModManager/JsonConverters/VersionJsonConverter.cs:34:22
 
     public static Version? ParseString(string value) {
         if (value.IndexOf('.') == -1) { // to support "version": "1" instead of "1.0"
-            value += ".0";
+            value += "";
         }
 
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsVersionJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson
