[NoCoverage] Null coalescing mutation (remove left)
src/Railroader.ModManager/Services/LoggerFactory.cs:14:90
 public class LoggerFactory(ILogger logger) : ILoggerFactory
 {
     /// <inheritdoc />
-    public ILogger GetLogger(string? scope = null) => logger.ForContext("SourceContext", scope ?? "Railroader.ModInjector");
+    public ILogger GetLogger(string? scope = null) => logger.ForContext("SourceContext", "Railroader.ModInjector");
 }
 
