[Killed] Boolean mutation
src/Railroader.ModManager/Services/ServiceManager.cs:12:136
 
     public Dictionary<Type, ServiceContext> Services { get; } = new();
 
-    public void AddSingleton<TInterface, TService>() where TService : class, TInterface, new() => Add<TInterface>(_ => new TService(), true);
+    public void AddSingleton<TInterface, TService>() where TService : class, TInterface, new() => Add<TInterface>(_ => new TService(), false);
     public void AddTransient<TInterface, TService>() where TService : class, TInterface, new() => Add<TInterface>(_ => new TService(), false);
 
killedBy: Railroader.ModManager.Tests.Services.ServiceManagerTests.AddSingleton_SuccessfullyRegisters; Railroader.ModManager.Tests.Services.ServiceManagerTests.Get_Singleton_ReturnsSameInstance

[Killed] Boolean mutation
src/Railroader.ModManager/Services/ServiceManager.cs:13:136
     public Dictionary<Type, ServiceContext> Services { get; } = new();
 
     public void AddSingleton<TInterface, TService>() where TService : class, TInterface, new() => Add<TInterface>(_ => new TService(), true);
-    public void AddTransient<TInterface, TService>() where TService : class, TInterface, new() => Add<TInterface>(_ => new TService(), false);
+    public void AddTransient<TInterface, TService>() where TService : class, TInterface, new() => Add<TInterface>(_ => new TService(), true);
 
     public void AddSingleton<TInterface, TService>(Func<IServiceProvider, TService> factory) where TService : class, TInterface => Add<TInterface>(factory, true);
killedBy: Railroader.ModManager.Tests.Services.ServiceManagerTests.AddTransient_SuccessfullyRegisters; Railroader.ModManager.Tests.Services.ServiceManagerTests.Get_Transient_ReturnsNewInstances

[Killed] Boolean mutation
src/Railroader.ModManager/Services/ServiceManager.cs:15:157
     public void AddSingleton<TInterface, TService>() where TService : class, TInterface, new() => Add<TInterface>(_ => new TService(), true);
     public void AddTransient<TInterface, TService>() where TService : class, TInterface, new() => Add<TInterface>(_ => new TService(), false);
 
-    public void AddSingleton<TInterface, TService>(Func<IServiceProvider, TService> factory) where TService : class, TInterface => Add<TInterface>(factory, true);
+    public void AddSingleton<TInterface, TService>(Func<IServiceProvider, TService> factory) where TService : class, TInterface => Add<TInterface>(factory, false);
     public void AddTransient<TInterface, TService>(Func<IServiceProvider, TService> factory) where TService : class, TInterface => Add<TInterface>(factory, false);
 
killedBy: Railroader.ModManager.Tests.Services.ServiceManagerTests.AddSingleton_Factory_SuccessfullyRegisters

[Killed] Boolean mutation
src/Railroader.ModManager/Services/ServiceManager.cs:16:157
     public void AddTransient<TInterface, TService>() where TService : class, TInterface, new() => Add<TInterface>(_ => new TService(), false);
 
     public void AddSingleton<TInterface, TService>(Func<IServiceProvider, TService> factory) where TService : class, TInterface => Add<TInterface>(factory, true);
-    public void AddTransient<TInterface, TService>(Func<IServiceProvider, TService> factory) where TService : class, TInterface => Add<TInterface>(factory, false);
+    public void AddTransient<TInterface, TService>(Func<IServiceProvider, TService> factory) where TService : class, TInterface => Add<TInterface>(factory, true);
 
     private void Add<TInterface>(Func<IServiceProvider, object?> factory, bool isSingleton) {
killedBy: Railroader.ModManager.Tests.Services.ServiceManagerTests.AddTransient_Factory_SuccessfullyRegisters

[Killed] Negate expression
src/Railroader.ModManager/Services/ServiceManager.cs:20:17
 
     private void Add<TInterface>(Func<IServiceProvider, object?> factory, bool isSingleton) {
         lock (Services) {
-            if (Services.ContainsKey(typeof(TInterface))) {
+            if (!(Services.ContainsKey(typeof(TInterface)))) {
                 throw new InvalidOperationException($"Service {typeof(TInterface)} is already registered");
             }
killedBy: Railroader.ModManager.Tests.Services.ServiceManagerTests.AddSingleton_SuccessfullyRegisters; Railroader.ModManager.Tests.Services.ServiceManagerTests.AddTransient_SuccessfullyRegisters; Railroader.ModManager.Tests.Services.ServiceManagerTests.Add_Duplicate_Throws

[Killed] Statement mutation
src/Railroader.ModManager/Services/ServiceManager.cs:21:17
     private void Add<TInterface>(Func<IServiceProvider, object?> factory, bool isSingleton) {
         lock (Services) {
             if (Services.ContainsKey(typeof(TInterface))) {
-                throw new InvalidOperationException($"Service {typeof(TInterface)} is already registered");
+                ;
             }
 
killedBy: Railroader.ModManager.Tests.Services.ServiceManagerTests.Add_Duplicate_Throws

[Killed] Statement mutation
src/Railroader.ModManager/Services/ServiceManager.cs:24:13
                 throw new InvalidOperationException($"Service {typeof(TInterface)} is already registered");
             }
 
-            Services.Add(typeof(TInterface), new ServiceContext(factory, isSingleton, null));
+            ;
         }
     }
killedBy: Railroader.ModManager.Tests.Services.ServiceManagerTests.AddSingleton_SuccessfullyRegisters; Railroader.ModManager.Tests.Services.ServiceManagerTests.AddTransient_SuccessfullyRegisters; Railroader.ModManager.Tests.Services.ServiceManagerTests.Add_Duplicate_Throws

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Services/ServiceManager.cs:30:17
 
     public object GetService(Type serviceType) {
         lock (Services) {
-            if (!Services.TryGetValue(serviceType, out var serviceContext)) {
+            if (Services.TryGetValue(serviceType, out var serviceContext)) {
                 throw new InvalidOperationException($"Cannot find service {serviceType}");
             }
killedBy: Railroader.ModManager.Tests.Services.ServiceManagerTests.Get_Transient_ReturnsNewInstances; Railroader.ModManager.Tests.Services.ServiceManagerTests.Get_Singleton_ReturnsSameInstance; Railroader.ModManager.Tests.Services.ServiceManagerTests.Get_UnregisteredService_Throws

[Killed] Statement mutation
src/Railroader.ModManager/Services/ServiceManager.cs:31:17
     public object GetService(Type serviceType) {
         lock (Services) {
             if (!Services.TryGetValue(serviceType, out var serviceContext)) {
-                throw new InvalidOperationException($"Cannot find service {serviceType}");
+                ;
             }
 
killedBy: Railroader.ModManager.Tests.Services.ServiceManagerTests.Get_UnregisteredService_Throws

[Killed] Block removal mutation
src/Railroader.ModManager/Services/ServiceManager.cs:34:50
                 throw new InvalidOperationException($"Cannot find service {serviceType}");
             }
 
-            if (serviceContext.Instance != null) {
-                return serviceContext.Instance;
-            }
+            if (serviceContext.Instance != null) {}
 
             var instance = serviceContext.Factory(this) ?? throw new InvalidOperationException($"Failed to create instance of {serviceType}");
killedBy: Railroader.ModManager.Tests.Services.ServiceManagerTests.Get_Singleton_ReturnsSameInstance

[Killed] Equality mutation
src/Railroader.ModManager/Services/ServiceManager.cs:34:17
                 throw new InvalidOperationException($"Cannot find service {serviceType}");
             }
 
-            if (serviceContext.Instance != null) {
+            if (serviceContext.Instance == null) {
                 return serviceContext.Instance;
             }
killedBy: Railroader.ModManager.Tests.Services.ServiceManagerTests.Get_Transient_ReturnsNewInstances; Railroader.ModManager.Tests.Services.ServiceManagerTests.Get_Singleton_ReturnsSameInstance; Railroader.ModManager.Tests.Services.ServiceManagerTests.Get_NullFactoryResult_Throws

[Killed] String mutation
src/Railroader.ModManager/Services/ServiceManager.cs:38:96
                 return serviceContext.Instance;
             }
 
-            var instance = serviceContext.Factory(this) ?? throw new InvalidOperationException($"Failed to create instance of {serviceType}");
+            var instance = serviceContext.Factory(this) ?? throw new InvalidOperationException($"");
             if (serviceContext.IsSingleton) {
                 Services[serviceType] = serviceContext with { Instance = instance };
killedBy: Railroader.ModManager.Tests.Services.ServiceManagerTests.Get_NullFactoryResult_Throws

[Killed] Negate expression
src/Railroader.ModManager/Services/ServiceManager.cs:39:17
             }
 
             var instance = serviceContext.Factory(this) ?? throw new InvalidOperationException($"Failed to create instance of {serviceType}");
-            if (serviceContext.IsSingleton) {
+            if (!(serviceContext.IsSingleton)) {
                 Services[serviceType] = serviceContext with { Instance = instance };
             }
killedBy: Railroader.ModManager.Tests.Services.ServiceManagerTests.Get_Transient_ReturnsNewInstances; Railroader.ModManager.Tests.Services.ServiceManagerTests.Get_Singleton_ReturnsSameInstance

[Killed] Block removal mutation
src/Railroader.ModManager/Services/ServiceManager.cs:39:45
             }
 
             var instance = serviceContext.Factory(this) ?? throw new InvalidOperationException($"Failed to create instance of {serviceType}");
-            if (serviceContext.IsSingleton) {
-                Services[serviceType] = serviceContext with { Instance = instance };
-            }
+            if (serviceContext.IsSingleton) {}
 
             return instance;
killedBy: Railroader.ModManager.Tests.Services.ServiceManagerTests.Get_Singleton_ReturnsSameInstance
