[NoCoverage] String mutation
src/Railroader.ModManager/Services/_CodeCompiler.cs:54:9
     public string[] ReferenceNames { get; init; } = [
         "Assembly-CSharp",
         "0Harmony",
-        "Railroader.ModManager.Interfaces",
+        "",
         "Serilog",
         "UnityEngine.CoreModule"

[NoCoverage] String mutation
src/Railroader.ModManager/Services/_CodeCompiler.cs:56:9
         "0Harmony",
         "Railroader.ModManager.Interfaces",
         "Serilog",
-        "UnityEngine.CoreModule"
+        ""
     ];
 

[NoCoverage] Linq method mutation (OrderByDescending() to OrderBy())
src/Railroader.ModManager/Services/_CodeCompiler.cs:62:23
     /// <inheritdoc />
     public string? CompileMod(ModDefinition definition) {
 
-        var csFiles = directoryInfo(definition.BasePath)
-                      .EnumerateFiles("*.cs", SearchOption.AllDirectories)
-                      .OrderByDescending(o => o.LastWriteTime)
+        var csFiles = directoryInfo(definition.BasePath)
+                      .EnumerateFiles("*.cs", SearchOption.AllDirectories)
+                      .OrderBy(o => o.LastWriteTime)
                       .ToArray();
         if (csFiles.Length == 0) {

[NoCoverage] Equality mutation
src/Railroader.ModManager/Services/_CodeCompiler.cs:66:13
                       .EnumerateFiles("*.cs", SearchOption.AllDirectories)
                       .OrderByDescending(o => o.LastWriteTime)
                       .ToArray();
-        if (csFiles.Length == 0) {
+        if (csFiles.Length != 0) {
             return null;
         }

[NoCoverage] Block removal mutation
src/Railroader.ModManager/Services/_CodeCompiler.cs:66:34
                       .EnumerateFiles("*.cs", SearchOption.AllDirectories)
                       .OrderByDescending(o => o.LastWriteTime)
                       .ToArray();
-        if (csFiles.Length == 0) {
-            return null;
-        }
+        if (csFiles.Length == 0) {}
 
         var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + ".dll");

[NoCoverage] Negate expression
src/Railroader.ModManager/Services/_CodeCompiler.cs:71:13
         }
 
         var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + ".dll");
-        if (exists(assemblyPath)) {
+        if (!(exists(assemblyPath))) {
             var newestFile = csFiles[0];
             if (getLastWriteTime(assemblyPath) >= newestFile.LastWriteTime) {

[NoCoverage] Equality mutation
src/Railroader.ModManager/Services/_CodeCompiler.cs:73:17
         var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + ".dll");
         if (exists(assemblyPath)) {
             var newestFile = csFiles[0];
-            if (getLastWriteTime(assemblyPath) >= newestFile.LastWriteTime) {
+            if (getLastWriteTime(assemblyPath) < newestFile.LastWriteTime) {
                 logger.Information("Using existing mod {ModId} DLL at {Path}", definition.Identifier, assemblyPath);
                 return assemblyPath;

[NoCoverage] Negate expression
src/Railroader.ModManager/Services/_CodeCompiler.cs:73:17
         var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + ".dll");
         if (exists(assemblyPath)) {
             var newestFile = csFiles[0];
-            if (getLastWriteTime(assemblyPath) >= newestFile.LastWriteTime) {
+            if (!(getLastWriteTime(assemblyPath) >= newestFile.LastWriteTime)) {
                 logger.Information("Using existing mod {ModId} DLL at {Path}", definition.Identifier, assemblyPath);
                 return assemblyPath;

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CodeCompiler.cs:74:17
         if (exists(assemblyPath)) {
             var newestFile = csFiles[0];
             if (getLastWriteTime(assemblyPath) >= newestFile.LastWriteTime) {
-                logger.Information("Using existing mod {ModId} DLL at {Path}", definition.Identifier, assemblyPath);
+                ;
                 return assemblyPath;
             }

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CodeCompiler.cs:78:13
                 return assemblyPath;
             }
 
-            logger.Information("Deleting mod {ModId} DLL at {Path} because it is outdated", definition.Identifier, assemblyPath);
+            ;
             delete(assemblyPath);
         }

[NoCoverage] String mutation
src/Railroader.ModManager/Services/_CodeCompiler.cs:78:32
                 return assemblyPath;
             }
 
-            logger.Information("Deleting mod {ModId} DLL at {Path} because it is outdated", definition.Identifier, assemblyPath);
+            logger.Information("", definition.Identifier, assemblyPath);
             delete(assemblyPath);
         }

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CodeCompiler.cs:79:13
             }
 
             logger.Information("Deleting mod {ModId} DLL at {Path} because it is outdated", definition.Identifier, assemblyPath);
-            delete(assemblyPath);
+            ;
         }
 

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CodeCompiler.cs:82:9
             delete(assemblyPath);
         }
 
-        logger.Information("Compiling mod {ModId} ...", definition.Identifier);
+        ;
 
         var sources = csFiles.Select(o => o.FullName).ToArray();

[NoCoverage] String mutation
src/Railroader.ModManager/Services/_CodeCompiler.cs:86:82
 
         var sources = csFiles.Select(o => o.FullName).ToArray();
 
-        var managedPath = Path.Combine(getCurrentDirectory(), "Railroader_Data", "Managed");
+        var managedPath = Path.Combine(getCurrentDirectory(), "Railroader_Data", "");
         var references  = ReferenceNames.Select(o => Path.Combine(managedPath, o + ".dll")).ToList();
 

[NoCoverage] String mutation
src/Railroader.ModManager/Services/_CodeCompiler.cs:86:63
 
         var sources = csFiles.Select(o => o.FullName).ToArray();
 
-        var managedPath = Path.Combine(getCurrentDirectory(), "Railroader_Data", "Managed");
+        var managedPath = Path.Combine(getCurrentDirectory(), "", "Managed");
         var references  = ReferenceNames.Select(o => Path.Combine(managedPath, o + ".dll")).ToList();
 

[NoCoverage] Negate expression
src/Railroader.ModManager/Services/_CodeCompiler.cs:89:13
         var managedPath = Path.Combine(getCurrentDirectory(), "Railroader_Data", "Managed");
         var references  = ReferenceNames.Select(o => Path.Combine(managedPath, o + ".dll")).ToList();
 
-        if (definition.Requires?.Count > 0) {
+        if (!(definition.Requires?.Count > 0)) {
             logger.Information("Adding references to {Mods} ...", definition.Requires.Keys);
             var modsPath      = Path.Combine(getCurrentDirectory(), "Mods");

[NoCoverage] Equality mutation
src/Railroader.ModManager/Services/_CodeCompiler.cs:89:13
         var managedPath = Path.Combine(getCurrentDirectory(), "Railroader_Data", "Managed");
         var references  = ReferenceNames.Select(o => Path.Combine(managedPath, o + ".dll")).ToList();
 
-        if (definition.Requires?.Count > 0) {
+        if (definition.Requires?.Count < 0) {
             logger.Information("Adding references to {Mods} ...", definition.Requires.Keys);
             var modsPath      = Path.Combine(getCurrentDirectory(), "Mods");

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CodeCompiler.cs:90:13
         var references  = ReferenceNames.Select(o => Path.Combine(managedPath, o + ".dll")).ToList();
 
         if (definition.Requires?.Count > 0) {
-            logger.Information("Adding references to {Mods} ...", definition.Requires.Keys);
+            ;
             var modsPath      = Path.Combine(getCurrentDirectory(), "Mods");
             var modReferences = definition.Requires.Keys.Select(o => Path.Combine(modsPath, o, o + ".dll"));

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CodeCompiler.cs:93:13
             logger.Information("Adding references to {Mods} ...", definition.Requires.Keys);
             var modsPath      = Path.Combine(getCurrentDirectory(), "Mods");
             var modReferences = definition.Requires.Keys.Select(o => Path.Combine(modsPath, o, o + ".dll"));
-            references.AddRange(modReferences);
+            ;
         }
 

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Services/_CodeCompiler.cs:96:13
             references.AddRange(modReferences);
         }
 
-        if (!compileAssembly(assemblyPath, sources, references.ToArray(), out _)) {
+        if (compileAssembly(assemblyPath, sources, references.ToArray(), out _)) {
             logger.Error("Compilation failed for mod {ModId} ...", definition.Identifier);
             return null;

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CodeCompiler.cs:97:13
         }
 
         if (!compileAssembly(assemblyPath, sources, references.ToArray(), out _)) {
-            logger.Error("Compilation failed for mod {ModId} ...", definition.Identifier);
+            ;
             return null;
         }

[NoCoverage] String mutation
src/Railroader.ModManager/Services/_CodeCompiler.cs:97:26
         }
 
         if (!compileAssembly(assemblyPath, sources, references.ToArray(), out _)) {
-            logger.Error("Compilation failed for mod {ModId} ...", definition.Identifier);
+            logger.Error("", definition.Identifier);
             return null;
         }

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CodeCompiler.cs:101:9
             return null;
         }
 
-        logger.Information("Compilation complete for mod {ModId}", definition.Identifier);
+        ;
         return assemblyPath;
     }

[NoCoverage] String mutation
src/Railroader.ModManager/Services/_CodeCompiler.cs:101:28
             return null;
         }
 
-        logger.Information("Compilation complete for mod {ModId}", definition.Identifier);
+        logger.Information("", definition.Identifier);
         return assemblyPath;
     }
