[NoCoverage] Negate expression
src/Railroader.ModManager/Services/_CodePatcher.cs:53:13
 
     /// <inheritdoc />
     public void ApplyPatches(ModDefinition definition) {
-        if (PluginPatchers.Count > 0) {
+        if (!(PluginPatchers.Count > 0)) {
             logger.Information("Patching mod {ModId} ...", definition.Identifier);
 

[NoCoverage] Equality mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:53:13
 
     /// <inheritdoc />
     public void ApplyPatches(ModDefinition definition) {
-        if (PluginPatchers.Count > 0) {
+        if (PluginPatchers.Count >= 0) {
             logger.Information("Patching mod {ModId} ...", definition.Identifier);
 

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:54:13
     /// <inheritdoc />
     public void ApplyPatches(ModDefinition definition) {
         if (PluginPatchers.Count > 0) {
-            logger.Information("Patching mod {ModId} ...", definition.Identifier);
+            ;
 
             var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + ".dll");

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:57:17
             logger.Information("Patching mod {ModId} ...", definition.Identifier);
 
             var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + ".dll");
-            if (!ApplyPatches(assemblyPath, definition.Identifier)) {
+            if (ApplyPatches(assemblyPath, definition.Identifier)) {
                 logger.Error("Failed to apply patches to assembly {AssemblyPath} for mod {ModId}", assemblyPath, definition.Identifier);
                 return;

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:58:17
 
             var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + ".dll");
             if (!ApplyPatches(assemblyPath, definition.Identifier)) {
-                logger.Error("Failed to apply patches to assembly {AssemblyPath} for mod {ModId}", assemblyPath, definition.Identifier);
+                ;
                 return;
             }

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:59:17
             var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + ".dll");
             if (!ApplyPatches(assemblyPath, definition.Identifier)) {
                 logger.Error("Failed to apply patches to assembly {AssemblyPath} for mod {ModId}", assemblyPath, definition.Identifier);
-                return;
+                ;
             }
 

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:62:13
                 return;
             }
 
-            logger.Information("Patching complete for mod {ModId}", definition.Identifier);
+            ;
         }
     }

[NoCoverage] Boolean mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:72:28
     /// <returns>True if patching succeeds, false otherwise.</returns>
     private bool ApplyPatches(string assemblyPath, string modId) {
         var tempFilePath = Path.ChangeExtension(assemblyPath, ".patched.dll");
-        var success      = false;
+        var success      = true;
 
         AssemblyDefinition? assemblyDefinition = null;

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:79:13
             var resolver = new DefaultAssemblyResolver();
 
             // game DLLs
-            resolver.AddSearchDirectory(Path.Combine(getCurrentDirectory(), "Railroader_Data", "Managed"));
+            ;
 
             // other mods DLLs

[NoCoverage] String mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:83:84
 
             // other mods DLLs
             var thisModDir = Path.GetDirectoryName(assemblyPath);
-            var modDirs = enumerateDirectories(Path.Combine(getCurrentDirectory(), "Mods"))
+            var modDirs = enumerateDirectories(Path.Combine(getCurrentDirectory(), ""))
                                     .Where(o => o != thisModDir);
             foreach (var modDir in modDirs) {

[NoCoverage] Equality mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:84:49
             // other mods DLLs
             var thisModDir = Path.GetDirectoryName(assemblyPath);
             var modDirs = enumerateDirectories(Path.Combine(getCurrentDirectory(), "Mods"))
-                                    .Where(o => o != thisModDir);
+                                    .Where(o => o == thisModDir);
             foreach (var modDir in modDirs) {
                 resolver.AddSearchDirectory(modDir);

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:86:17
             var modDirs = enumerateDirectories(Path.Combine(getCurrentDirectory(), "Mods"))
                                     .Where(o => o != thisModDir);
             foreach (var modDir in modDirs) {
-                resolver.AddSearchDirectory(modDir);
+                ;
             }
 

[NoCoverage] Equality mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:91:17
 
             var readParameters = new ReaderParameters { AssemblyResolver = resolver };
             assemblyDefinition = readAssemblyDefinition(assemblyPath, readParameters);
-            if (assemblyDefinition == null) {
+            if (assemblyDefinition != null) {
                 logger.Error("Failed to load definition for assembly {AssemblyPath} for mod {ModId}", assemblyPath, modId);
                 return false;

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:92:17
             var readParameters = new ReaderParameters { AssemblyResolver = resolver };
             assemblyDefinition = readAssemblyDefinition(assemblyPath, readParameters);
             if (assemblyDefinition == null) {
-                logger.Error("Failed to load definition for assembly {AssemblyPath} for mod {ModId}", assemblyPath, modId);
+                ;
                 return false;
             }

[NoCoverage] String mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:92:30
             var readParameters = new ReaderParameters { AssemblyResolver = resolver };
             assemblyDefinition = readAssemblyDefinition(assemblyPath, readParameters);
             if (assemblyDefinition == null) {
-                logger.Error("Failed to load definition for assembly {AssemblyPath} for mod {ModId}", assemblyPath, modId);
+                logger.Error("", assemblyPath, modId);
                 return false;
             }

[NoCoverage] Boolean mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:93:24
             assemblyDefinition = readAssemblyDefinition(assemblyPath, readParameters);
             if (assemblyDefinition == null) {
                 logger.Error("Failed to load definition for assembly {AssemblyPath} for mod {ModId}", assemblyPath, modId);
-                return false;
+                return true;
             }
 

[NoCoverage] Boolean mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:96:28
                 return false;
             }
 
-            var hasPatch = false;
+            var hasPatch = true;
             var hasError = false;
             foreach (var type in assemblyDefinition.MainModule.Types) {

[NoCoverage] Boolean mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:97:28
             }
 
             var hasPatch = false;
-            var hasError = false;
+            var hasError = true;
             foreach (var type in assemblyDefinition.MainModule.Types) {
                 try {

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:106:25
                                                      _ => (ITypePatcher)Activator.CreateInstance(pair.PluginPatcherType!, logger)!
                                                  ));
                     foreach (var patcher in patchers) {
-                        patcher!.Patch(assemblyDefinition, type);
+                        ;
                         hasPatch = true;
                     }

[NoCoverage] Boolean mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:107:36
                                                  ));
                     foreach (var patcher in patchers) {
                         patcher!.Patch(assemblyDefinition, type);
-                        hasPatch = true;
+                        hasPatch = false;
                     }
                 } catch (Exception ex) {

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:110:21
                         hasPatch = true;
                     }
                 } catch (Exception ex) {
-                    logger.Error(ex, "Failed to patch type {TypeName} for mod {ModId}", type.FullName, modId);
+                    ;
                     hasError = true;
                 }

[NoCoverage] Boolean mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:111:32
                     }
                 } catch (Exception ex) {
                     logger.Error(ex, "Failed to patch type {TypeName} for mod {ModId}", type.FullName, modId);
-                    hasError = true;
+                    hasError = false;
                 }
             }

[NoCoverage] Logical mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:115:23
                 }
             }
 
-            success = hasPatch && !hasError;
+            success = hasPatch || !hasError;
 
             if (success) {

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:115:35
                 }
             }
 
-            success = hasPatch && !hasError;
+            success = hasPatch && hasError;
 
             if (success) {

[NoCoverage] Negate expression
src/Railroader.ModManager/Services/_CodePatcher.cs:117:17
 
             success = hasPatch && !hasError;
 
-            if (success) {
+            if (!(success)) {
                 writeAssemblyDefinition(assemblyDefinition, tempFilePath);
                 logger.Debug("Wrote patched assembly to temporary file {TempPath} for mod {ModId}", tempFilePath, modId);

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:118:17
             success = hasPatch && !hasError;
 
             if (success) {
-                writeAssemblyDefinition(assemblyDefinition, tempFilePath);
+                ;
                 logger.Debug("Wrote patched assembly to temporary file {TempPath} for mod {ModId}", tempFilePath, modId);
             } else {

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:119:17
 
             if (success) {
                 writeAssemblyDefinition(assemblyDefinition, tempFilePath);
-                logger.Debug("Wrote patched assembly to temporary file {TempPath} for mod {ModId}", tempFilePath, modId);
+                ;
             } else {
                 logger.Information("No patches to assembly {AssemblyPath} for mod {ModId} where applied", assemblyPath, modId);

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:121:17
                 writeAssemblyDefinition(assemblyDefinition, tempFilePath);
                 logger.Debug("Wrote patched assembly to temporary file {TempPath} for mod {ModId}", tempFilePath, modId);
             } else {
-                logger.Information("No patches to assembly {AssemblyPath} for mod {ModId} where applied", assemblyPath, modId);
+                ;
             }
 

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:126:13
 
             return true;
         } finally {
-            assemblyDefinition?.Dispose();
+            ;
             if (success) {
                 delete(assemblyPath);

[NoCoverage] Negate expression
src/Railroader.ModManager/Services/_CodePatcher.cs:127:17
             return true;
         } finally {
             assemblyDefinition?.Dispose();
-            if (success) {
+            if (!(success)) {
                 delete(assemblyPath);
                 move(tempFilePath, assemblyPath);

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:128:17
         } finally {
             assemblyDefinition?.Dispose();
             if (success) {
-                delete(assemblyPath);
+                ;
                 move(tempFilePath, assemblyPath);
             }

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CodePatcher.cs:129:17
             assemblyDefinition?.Dispose();
             if (success) {
                 delete(assemblyPath);
-                move(tempFilePath, assemblyPath);
+                ;
             }
         }
