[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CompileAssemblyCore.cs:23:9
     private static bool CompileAssembly(InvokeCompiler invokeCompiler, ILogger logger, string outputPath, ICollection<string> sources, ICollection<string> references, out string messages) {
         var args = CompilerArguments(outputPath, sources, references).ToArray();
 
-        logger.Information("Compiling assembly {outputPath} ...", outputPath);
+        ;
         foreach (var reference in references) {
             logger.Debug("reference: {source}", reference);

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CompileAssemblyCore.cs:25:13
 
         logger.Information("Compiling assembly {outputPath} ...", outputPath);
         foreach (var reference in references) {
-            logger.Debug("reference: {source}", reference);
+            ;
         }
 

[NoCoverage] String mutation
src/Railroader.ModManager/Services/_CompileAssemblyCore.cs:25:26
 
         logger.Information("Compiling assembly {outputPath} ...", outputPath);
         foreach (var reference in references) {
-            logger.Debug("reference: {source}", reference);
+            logger.Debug("", reference);
         }
 

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CompileAssemblyCore.cs:29:13
         }
 
         foreach (var source in sources) {
-            logger.Debug("source: {source}", source);
+            ;
         }
 

[NoCoverage] String mutation
src/Railroader.ModManager/Services/_CompileAssemblyCore.cs:29:26
         }
 
         foreach (var source in sources) {
-            logger.Debug("source: {source}", source);
+            logger.Debug("", source);
         }
 

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Services/_CompileAssemblyCore.cs:39:13
         }
 
         messages = sb.ToString();
-        if (!string.IsNullOrEmpty(messages)) {
+        if (string.IsNullOrEmpty(messages)) {
             logger.Information("Compilation messages:\r\n{messages}", messages);
         }

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CompileAssemblyCore.cs:40:13
 
         messages = sb.ToString();
         if (!string.IsNullOrEmpty(messages)) {
-            logger.Information("Compilation messages:\r\n{messages}", messages);
+            ;
         }
 

[NoCoverage] String mutation
src/Railroader.ModManager/Services/_CompileAssemblyCore.cs:40:32
 
         messages = sb.ToString();
         if (!string.IsNullOrEmpty(messages)) {
-            logger.Information("Compilation messages:\r\n{messages}", messages);
+            logger.Information("", messages);
         }
 

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CompileAssemblyCore.cs:44:13
         }
 
         if (result) {
-            logger.Information("Assembly {outputPath} compiled successfully", outputPath);
+            ;
             return true;
         }

[NoCoverage] Boolean mutation
src/Railroader.ModManager/Services/_CompileAssemblyCore.cs:45:20
 
         if (result) {
             logger.Information("Assembly {outputPath} compiled successfully", outputPath);
-            return true;
+            return false;
         }
 

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CompileAssemblyCore.cs:48:9
             return true;
         }
 
-        logger.Error("Compilation of assembly {outputPath} failed", outputPath);
+        ;
         return false;
     }

[NoCoverage] Boolean mutation
src/Railroader.ModManager/Services/_CompileAssemblyCore.cs:49:16
         }
 
         logger.Error("Compilation of assembly {outputPath} failed", outputPath);
-        return false;
+        return true;
     }
 

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CompileAssemblyCore.cs:62:13
     [SuppressMessage("ReSharper", "StringLiteralTypo")]
     private static IEnumerable<string> CompilerArguments(string assemblyPath, ICollection<string> sources, ICollection<string> references) {
         foreach (var source in sources) {
-            yield return source;
+            ;
         }
 

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CompileAssemblyCore.cs:72:9
         //   -codepage:ID         Sets code page to the one in ID (number, utf8, reset)
         //   -define:S1[;S2]      Defines one or more conditional symbols (short: -d)
         //   -debug[+|-], -g      Generate debugging information
-        yield return "-debug-";
+        ;
         //   -delaysign[+|-]      Only insert the public key into the assembly (no signing)
         //   -doc:FILE            Process documentation comments to XML file

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CompileAssemblyCore.cs:76:9
         //   -delaysign[+|-]      Only insert the public key into the assembly (no signing)
         //   -doc:FILE            Process documentation comments to XML file
         //   -fullpaths           Any issued error or warning uses absolute file path
-        yield return "-fullpaths";
+        ;
         //   -help                Lists all compiler options (short: -?)
         //   -keycontainer:NAME   The key pair container used to sign the output assembly

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CompileAssemblyCore.cs:88:9
         //   -nostdlib[+|-]       Does not reference mscorlib.dll library
         //   -nowarn:W1[,Wn]      Suppress one or more compiler warnings
         //   -optimize[+|-]       Enables advanced compiler optimizations (short: -o)
-        yield return "-optimize";
+        ;
         //   -out:FILE            Specifies output assembly name
         yield return $"-out:{assemblyPath}";

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CompileAssemblyCore.cs:90:9
         //   -optimize[+|-]       Enables advanced compiler optimizations (short: -o)
         yield return "-optimize";
         //   -out:FILE            Specifies output assembly name
-        yield return $"-out:{assemblyPath}";
+        ;
         //   -pkg:P1[,Pn]         References packages P1..Pn
         //   -platform:ARCH       Specifies the target platform of the output assembly

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CompileAssemblyCore.cs:98:9
         //yield return  "-platform:anycpu",
         //   -recurse:SPEC        Recursively compiles files according to SPEC pattern
         //   -reference:A1[,An]   Imports metadata from the specified assembly (short: -r)
-        yield return $"-reference:{string.Join(",", references)}";
+        ;
         //   -reference:ALIAS=A   Imports metadata using specified extern alias (short: -r)
         //   -sdk:VERSION         Specifies SDK version of referenced assemblies

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CompileAssemblyCore.cs:104:9
         //                        VERSION can be one of: 2, 4, 4.5 (default) or a custom value
         //   -target:KIND         Specifies the format of the output assembly (short: -t)
         //                        KIND can be one of: exe, winexe, library, module
-        yield return "-target:library";
+        ;
         //   -unsafe[+|-]         Allows to compile code which uses unsafe keyword
         //   -warnaserror[+|-]    Treats all warnings as errors

[NoCoverage] String mutation
src/Railroader.ModManager/Services/_CompileAssemblyCore.cs:104:22
         //                        VERSION can be one of: 2, 4, 4.5 (default) or a custom value
         //   -target:KIND         Specifies the format of the output assembly (short: -t)
         //                        KIND can be one of: exe, winexe, library, module
-        yield return "-target:library";
+        yield return "";
         //   -unsafe[+|-]         Allows to compile code which uses unsafe keyword
         //   -warnaserror[+|-]    Treats all warnings as errors

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_CompileAssemblyCore.cs:109:9
         //   -warnaserror[+|-]    Treats all warnings as errors
         //   -warnaserror[+|-]:W1[,Wn] Treats one or more compiler warnings as errors
         //   -warn:0-4            Sets warning level, the default is 4 (short -w:)
-        yield return "-warn:4";
+        ;
     }
 }
