[NoCoverage] String mutation
src/Railroader.ModManager/Services/_ModDefinitionLoader.cs:44:65
     public void LoadDefinitions() {
         var modDefinitions = new Dictionary<string, ModDefinition>(StringComparer.OrdinalIgnoreCase);
 
-        var baseDirectory = Path.Combine(getCurrentDirectory(), "Mods");
+        var baseDirectory = Path.Combine(getCurrentDirectory(), "");
         foreach (var directory in enumerateDirectories(baseDirectory)) {
             var path = Path.Combine(directory, "Definition.json");

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Services/_ModDefinitionLoader.cs:47:17
         var baseDirectory = Path.Combine(getCurrentDirectory(), "Mods");
         foreach (var directory in enumerateDirectories(baseDirectory)) {
             var path = Path.Combine(directory, "Definition.json");
-            if (!exists(path)) {
+            if (exists(path)) {
                 logger.Warning("Not loading directory {directory}: Missing Definition.json.", directory);
                 continue;

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_ModDefinitionLoader.cs:48:17
         foreach (var directory in enumerateDirectories(baseDirectory)) {
             var path = Path.Combine(directory, "Definition.json");
             if (!exists(path)) {
-                logger.Warning("Not loading directory {directory}: Missing Definition.json.", directory);
+                ;
                 continue;
             }

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_ModDefinitionLoader.cs:49:17
             var path = Path.Combine(directory, "Definition.json");
             if (!exists(path)) {
                 logger.Warning("Not loading directory {directory}: Missing Definition.json.", directory);
-                continue;
+                ;
             }
 

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_ModDefinitionLoader.cs:52:13
                 continue;
             }
 
-            logger.Information("Loading definition from {directory} ...", directory);
+            ;
             try {
                 var jObject       = JObject.Parse(readAllText(path));

[NoCoverage] Negate expression
src/Railroader.ModManager/Services/_ModDefinitionLoader.cs:57:21
                 var jObject       = JObject.Parse(readAllText(path));
                 var modDefinition = jObject.ToObject<ModDefinition>()!;
 
-                if (modDefinitions.TryGetValue(modDefinition.Identifier, out var conflict)) {
+                if (!(modDefinitions.TryGetValue(modDefinition.Identifier, out var conflict))) {
                     logger.Error("Another mod with the same Identifier has been found in '{directory}'", conflict.BasePath);
                 } else {

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_ModDefinitionLoader.cs:58:21
                 var modDefinition = jObject.ToObject<ModDefinition>()!;
 
                 if (modDefinitions.TryGetValue(modDefinition.Identifier, out var conflict)) {
-                    logger.Error("Another mod with the same Identifier has been found in '{directory}'", conflict.BasePath);
+                    ;
                 } else {
                     modDefinition.BasePath = directory;

[NoCoverage] String mutation
src/Railroader.ModManager/Services/_ModDefinitionLoader.cs:58:34
                 var modDefinition = jObject.ToObject<ModDefinition>()!;
 
                 if (modDefinitions.TryGetValue(modDefinition.Identifier, out var conflict)) {
-                    logger.Error("Another mod with the same Identifier has been found in '{directory}'", conflict.BasePath);
+                    logger.Error("", conflict.BasePath);
                 } else {
                     modDefinition.BasePath = directory;

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_ModDefinitionLoader.cs:61:21
                     logger.Error("Another mod with the same Identifier has been found in '{directory}'", conflict.BasePath);
                 } else {
                     modDefinition.BasePath = directory;
-                    modDefinitions.Add(modDefinition.Identifier, modDefinition);
+                    ;
                 }
             } catch (JsonException exc) {

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_ModDefinitionLoader.cs:64:17
                     modDefinitions.Add(modDefinition.Identifier, modDefinition);
                 }
             } catch (JsonException exc) {
-                logger.Error("Failed to parse definition JSON, json error: {exception}", exc);
+                ;
             } catch (Exception exc) {
                 logger.Error("Failed to parse definition JSON, generic error: {exception}", exc);

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_ModDefinitionLoader.cs:66:17
             } catch (JsonException exc) {
                 logger.Error("Failed to parse definition JSON, json error: {exception}", exc);
             } catch (Exception exc) {
-                logger.Error("Failed to parse definition JSON, generic error: {exception}", exc);
+                ;
             }
         }
