[NoCoverage] Block removal mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:20:61
     public List<string> Errors { get; } = new();
 
     public bool PreprocessModDefinitions(ref ModDefinition[] modDefinitions) {
-        if (VerifyRequirementsAndConflicts(modDefinitions)) {
-            modDefinitions = SortByDependencies(modDefinitions);
-        }
+        if (VerifyRequirementsAndConflicts(modDefinitions)) {}
 
         if (Errors.Count > 0) {

[NoCoverage] Negate expression
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:20:13
     public List<string> Errors { get; } = new();
 
     public bool PreprocessModDefinitions(ref ModDefinition[] modDefinitions) {
-        if (VerifyRequirementsAndConflicts(modDefinitions)) {
+        if (!(VerifyRequirementsAndConflicts(modDefinitions))) {
             modDefinitions = SortByDependencies(modDefinitions);
         }

[NoCoverage] Equality mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:24:13
             modDefinitions = SortByDependencies(modDefinitions);
         }
 
-        if (Errors.Count > 0) {
+        if (Errors.Count >= 0) {
             logger.Error("Mod preprocessing failed with error(s): {errors}", Errors.ToArray());
             modDefinitions = [];

[NoCoverage] Negate expression
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:24:13
             modDefinitions = SortByDependencies(modDefinitions);
         }
 
-        if (Errors.Count > 0) {
+        if (!(Errors.Count > 0)) {
             logger.Error("Mod preprocessing failed with error(s): {errors}", Errors.ToArray());
             modDefinitions = [];

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:25:13
         }
 
         if (Errors.Count > 0) {
-            logger.Error("Mod preprocessing failed with error(s): {errors}", Errors.ToArray());
+            ;
             modDefinitions = [];
             return false;

[NoCoverage] String mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:25:26
         }
 
         if (Errors.Count > 0) {
-            logger.Error("Mod preprocessing failed with error(s): {errors}", Errors.ToArray());
+            logger.Error("", Errors.ToArray());
             modDefinitions = [];
             return false;

[NoCoverage] Boolean mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:27:20
         if (Errors.Count > 0) {
             logger.Error("Mod preprocessing failed with error(s): {errors}", Errors.ToArray());
             modDefinitions = [];
-            return false;
+            return true;
         }
 

[NoCoverage] Equality mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:41:17
 
         foreach (var mod in modDefinitions) {
             // Verify Requirements
-            if (mod.Requires != null) {
+            if (mod.Requires == null) {
                 foreach (var (requiredId, fluentVersion) in mod.Requires) {
                     if (!modMap.TryGetValue(requiredId, out var requiredMod)) {

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:43:25
             // Verify Requirements
             if (mod.Requires != null) {
                 foreach (var (requiredId, fluentVersion) in mod.Requires) {
-                    if (!modMap.TryGetValue(requiredId, out var requiredMod)) {
+                    if (modMap.TryGetValue(requiredId, out var requiredMod)) {
                         Errors.Add($"Mod '{mod.Identifier}' requires mod '{requiredId}', but it is not present.");
                     }

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:44:25
             if (mod.Requires != null) {
                 foreach (var (requiredId, fluentVersion) in mod.Requires) {
                     if (!modMap.TryGetValue(requiredId, out var requiredMod)) {
-                        Errors.Add($"Mod '{mod.Identifier}' requires mod '{requiredId}', but it is not present.");
+                        ;
                     }
 

[NoCoverage] Negate expression
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:47:25
                         Errors.Add($"Mod '{mod.Identifier}' requires mod '{requiredId}', but it is not present.");
                     }
 
-                    if (fluentVersion != null && !IsVersionSatisfied(requiredMod!.Version, fluentVersion)) {
+                    if (!(fluentVersion != null && !IsVersionSatisfied(requiredMod!.Version, fluentVersion))) {
                         Errors.Add($"Mod '{mod.Identifier}' requires mod '{requiredId}' with version constraint '{fluentVersion}', but found version '{requiredMod.Version}'.");
                     }

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:47:50
                         Errors.Add($"Mod '{mod.Identifier}' requires mod '{requiredId}', but it is not present.");
                     }
 
-                    if (fluentVersion != null && !IsVersionSatisfied(requiredMod!.Version, fluentVersion)) {
+                    if (fluentVersion != null && IsVersionSatisfied(requiredMod!.Version, fluentVersion)) {
                         Errors.Add($"Mod '{mod.Identifier}' requires mod '{requiredId}' with version constraint '{fluentVersion}', but found version '{requiredMod.Version}'.");
                     }

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:48:25
                     }
 
                     if (fluentVersion != null && !IsVersionSatisfied(requiredMod!.Version, fluentVersion)) {
-                        Errors.Add($"Mod '{mod.Identifier}' requires mod '{requiredId}' with version constraint '{fluentVersion}', but found version '{requiredMod.Version}'.");
+                        ;
                     }
                 }

[NoCoverage] Equality mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:54:17
             }
 
             // Verify Conflicts
-            if (mod.ConflictsWith != null) {
+            if (mod.ConflictsWith == null) {
                 foreach (var (conflictId, fluentVersion) in mod.ConflictsWith) {
                     if (modMap.TryGetValue(conflictId, out var conflictingMod)) {

[NoCoverage] Negate expression
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:56:25
             // Verify Conflicts
             if (mod.ConflictsWith != null) {
                 foreach (var (conflictId, fluentVersion) in mod.ConflictsWith) {
-                    if (modMap.TryGetValue(conflictId, out var conflictingMod)) {
+                    if (!(modMap.TryGetValue(conflictId, out var conflictingMod))) {
                         if (fluentVersion == null || IsVersionSatisfied(conflictingMod.Version, fluentVersion)) {

[NoCoverage] Equality mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:57:29
             if (mod.ConflictsWith != null) {
                 foreach (var (conflictId, fluentVersion) in mod.ConflictsWith) {
                     if (modMap.TryGetValue(conflictId, out var conflictingMod)) {
-                        if (fluentVersion == null || IsVersionSatisfied(conflictingMod.Version, fluentVersion)) {
+                        if (fluentVersion != null || IsVersionSatisfied(conflictingMod.Version, fluentVersion)) {
                         }

[NoCoverage] Negate expression
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:57:29
             if (mod.ConflictsWith != null) {
                 foreach (var (conflictId, fluentVersion) in mod.ConflictsWith) {
                     if (modMap.TryGetValue(conflictId, out var conflictingMod)) {
-                        if (fluentVersion == null || IsVersionSatisfied(conflictingMod.Version, fluentVersion)) {
+                        if (!(fluentVersion == null || IsVersionSatisfied(conflictingMod.Version, fluentVersion))) {
                         }

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:79:17
         var invalidMods    = new HashSet<string>(StringComparer.OrdinalIgnoreCase);
 
         foreach (var mod in modDefinitions) {
-            if (!visited.Contains(mod.Identifier)) {
+            if (visited.Contains(mod.Identifier)) {
                 Visit(mod, new Stack<string>());
             }

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:80:17
 
         foreach (var mod in modDefinitions) {
             if (!visited.Contains(mod.Identifier)) {
-                Visit(mod, new Stack<string>());
+                ;
             }
         }

[NoCoverage] Negate expression
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:87:17
         return sorted.ToArray();
 
         bool Visit(ModDefinition mod, Stack<string> path) {
-            if (path.Contains(mod.Identifier)) {
+            if (!(path.Contains(mod.Identifier))) {
                 path.Push(mod.Identifier);
                 Errors.Add($"Cyclic dependency detected: {string.Join(" -> ", path.Reverse())}");

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:88:17
 
         bool Visit(ModDefinition mod, Stack<string> path) {
             if (path.Contains(mod.Identifier)) {
-                path.Push(mod.Identifier);
+                ;
                 Errors.Add($"Cyclic dependency detected: {string.Join(" -> ", path.Reverse())}");
                 return false;

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:89:17
         bool Visit(ModDefinition mod, Stack<string> path) {
             if (path.Contains(mod.Identifier)) {
                 path.Push(mod.Identifier);
-                Errors.Add($"Cyclic dependency detected: {string.Join(" -> ", path.Reverse())}");
+                ;
                 return false;
             }

[NoCoverage] Linq method mutation (Reverse() to AsEnumerable())
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:89:79
         bool Visit(ModDefinition mod, Stack<string> path) {
             if (path.Contains(mod.Identifier)) {
                 path.Push(mod.Identifier);
-                Errors.Add($"Cyclic dependency detected: {string.Join(" -> ", path.Reverse())}");
+                Errors.Add($"Cyclic dependency detected: {string.Join(" -> ", path.AsEnumerable())}");
                 return false;
             }

[NoCoverage] Boolean mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:90:24
             if (path.Contains(mod.Identifier)) {
                 path.Push(mod.Identifier);
                 Errors.Add($"Cyclic dependency detected: {string.Join(" -> ", path.Reverse())}");
-                return false;
+                return true;
             }
 

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:93:17
                 return false;
             }
 
-            if (!visited.Add(mod.Identifier)) {
+            if (visited.Add(mod.Identifier)) {
                 return !invalidMods.Contains(mod.Identifier);
             }

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:94:24
             }
 
             if (!visited.Add(mod.Identifier)) {
-                return !invalidMods.Contains(mod.Identifier);
+                return invalidMods.Contains(mod.Identifier);
             }
 

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:97:13
                 return !invalidMods.Contains(mod.Identifier);
             }
 
-            path.Push(mod.Identifier);
+            ;
 
             var isValid = true;

[NoCoverage] Boolean mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:99:27
 
             path.Push(mod.Identifier);
 
-            var isValid = true;
+            var isValid = false;
             if (mod.Requires != null) {
                 foreach (var requiredId in mod.Requires.Keys) {

[NoCoverage] Equality mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:100:17
             path.Push(mod.Identifier);
 
             var isValid = true;
-            if (mod.Requires != null) {
+            if (mod.Requires == null) {
                 foreach (var requiredId in mod.Requires.Keys) {
                     if (invalidMods.Contains(requiredId)) {

[NoCoverage] Negate expression
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:102:25
             var isValid = true;
             if (mod.Requires != null) {
                 foreach (var requiredId in mod.Requires.Keys) {
-                    if (invalidMods.Contains(requiredId)) {
+                    if (!(invalidMods.Contains(requiredId))) {
                         Errors.Add($"Mod '{mod.Identifier}' cannot resolve mod '{requiredId}' because mod '{requiredId}' is part of a cyclic dependency.");
                     } else if (!Visit(modMap[requiredId]!, path)) {

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:103:25
             if (mod.Requires != null) {
                 foreach (var requiredId in mod.Requires.Keys) {
                     if (invalidMods.Contains(requiredId)) {
-                        Errors.Add($"Mod '{mod.Identifier}' cannot resolve mod '{requiredId}' because mod '{requiredId}' is part of a cyclic dependency.");
+                        ;
                     } else if (!Visit(modMap[requiredId]!, path)) {
                         isValid = false;

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:104:32
                 foreach (var requiredId in mod.Requires.Keys) {
                     if (invalidMods.Contains(requiredId)) {
                         Errors.Add($"Mod '{mod.Identifier}' cannot resolve mod '{requiredId}' because mod '{requiredId}' is part of a cyclic dependency.");
-                    } else if (!Visit(modMap[requiredId]!, path)) {
+                    } else if (Visit(modMap[requiredId]!, path)) {
                         isValid = false;
                     }

[NoCoverage] Boolean mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:105:35
                     if (invalidMods.Contains(requiredId)) {
                         Errors.Add($"Mod '{mod.Identifier}' cannot resolve mod '{requiredId}' because mod '{requiredId}' is part of a cyclic dependency.");
                     } else if (!Visit(modMap[requiredId]!, path)) {
-                        isValid = false;
+                        isValid = true;
                     }
                 }

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:110:13
                 }
             }
 
-            path.Pop();
+            ;
 
             if (isValid) {

[NoCoverage] Negate expression
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:112:17
 
             path.Pop();
 
-            if (isValid) {
+            if (!(isValid)) {
                 sorted.Add(mod);
             } else {

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:113:17
             path.Pop();
 
             if (isValid) {
-                sorted.Add(mod);
+                ;
             } else {
                 invalidMods.Add(mod.Identifier);

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:115:17
             if (isValid) {
                 sorted.Add(mod);
             } else {
-                invalidMods.Add(mod.Identifier);
+                ;
             }
 

[NoCoverage] Equality mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:124:47
 
     private static bool IsVersionSatisfied(Version actualVersion, FluentVersion constraint) {
         return constraint.Operator switch {
-            VersionOperator.Equal          => actualVersion == constraint.Version,
+            VersionOperator.Equal          => actualVersion != constraint.Version,
             VersionOperator.GreaterThan    => actualVersion > constraint.Version,
             VersionOperator.GreaterOrEqual => actualVersion >= constraint.Version,

[NoCoverage] Equality mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:125:47
     private static bool IsVersionSatisfied(Version actualVersion, FluentVersion constraint) {
         return constraint.Operator switch {
             VersionOperator.Equal          => actualVersion == constraint.Version,
-            VersionOperator.GreaterThan    => actualVersion > constraint.Version,
+            VersionOperator.GreaterThan    => actualVersion < constraint.Version,
             VersionOperator.GreaterOrEqual => actualVersion >= constraint.Version,
             VersionOperator.LessThan       => actualVersion < constraint.Version,

[NoCoverage] Equality mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:125:47
     private static bool IsVersionSatisfied(Version actualVersion, FluentVersion constraint) {
         return constraint.Operator switch {
             VersionOperator.Equal          => actualVersion == constraint.Version,
-            VersionOperator.GreaterThan    => actualVersion > constraint.Version,
+            VersionOperator.GreaterThan    => actualVersion >= constraint.Version,
             VersionOperator.GreaterOrEqual => actualVersion >= constraint.Version,
             VersionOperator.LessThan       => actualVersion < constraint.Version,

[NoCoverage] Equality mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:126:47
         return constraint.Operator switch {
             VersionOperator.Equal          => actualVersion == constraint.Version,
             VersionOperator.GreaterThan    => actualVersion > constraint.Version,
-            VersionOperator.GreaterOrEqual => actualVersion >= constraint.Version,
+            VersionOperator.GreaterOrEqual => actualVersion < constraint.Version,
             VersionOperator.LessThan       => actualVersion < constraint.Version,
             VersionOperator.LessOrEqual    => actualVersion <= constraint.Version,

[NoCoverage] Equality mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:126:47
         return constraint.Operator switch {
             VersionOperator.Equal          => actualVersion == constraint.Version,
             VersionOperator.GreaterThan    => actualVersion > constraint.Version,
-            VersionOperator.GreaterOrEqual => actualVersion >= constraint.Version,
+            VersionOperator.GreaterOrEqual => actualVersion > constraint.Version,
             VersionOperator.LessThan       => actualVersion < constraint.Version,
             VersionOperator.LessOrEqual    => actualVersion <= constraint.Version,

[NoCoverage] Equality mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:127:47
             VersionOperator.Equal          => actualVersion == constraint.Version,
             VersionOperator.GreaterThan    => actualVersion > constraint.Version,
             VersionOperator.GreaterOrEqual => actualVersion >= constraint.Version,
-            VersionOperator.LessThan       => actualVersion < constraint.Version,
+            VersionOperator.LessThan       => actualVersion > constraint.Version,
             VersionOperator.LessOrEqual    => actualVersion <= constraint.Version,
             _                              => throw new InvalidOperationException($"Unknown version operator: {constraint.Operator}")

[NoCoverage] Equality mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:127:47
             VersionOperator.Equal          => actualVersion == constraint.Version,
             VersionOperator.GreaterThan    => actualVersion > constraint.Version,
             VersionOperator.GreaterOrEqual => actualVersion >= constraint.Version,
-            VersionOperator.LessThan       => actualVersion < constraint.Version,
+            VersionOperator.LessThan       => actualVersion <= constraint.Version,
             VersionOperator.LessOrEqual    => actualVersion <= constraint.Version,
             _                              => throw new InvalidOperationException($"Unknown version operator: {constraint.Operator}")

[NoCoverage] Equality mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:128:47
             VersionOperator.GreaterThan    => actualVersion > constraint.Version,
             VersionOperator.GreaterOrEqual => actualVersion >= constraint.Version,
             VersionOperator.LessThan       => actualVersion < constraint.Version,
-            VersionOperator.LessOrEqual    => actualVersion <= constraint.Version,
+            VersionOperator.LessOrEqual    => actualVersion > constraint.Version,
             _                              => throw new InvalidOperationException($"Unknown version operator: {constraint.Operator}")
         };

[NoCoverage] Equality mutation
src/Railroader.ModManager/Services/_ModDefinitionProcessor.cs:128:47
             VersionOperator.GreaterThan    => actualVersion > constraint.Version,
             VersionOperator.GreaterOrEqual => actualVersion >= constraint.Version,
             VersionOperator.LessThan       => actualVersion < constraint.Version,
-            VersionOperator.LessOrEqual    => actualVersion <= constraint.Version,
+            VersionOperator.LessOrEqual    => actualVersion < constraint.Version,
             _                              => throw new InvalidOperationException($"Unknown version operator: {constraint.Operator}")
         };
