[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_ModExtractor.cs:47:13
 
         foreach (var zipFile in zipFiles)
         {
-            ExtractMod(zipFile, modsDirectory);
+            ;
         }
     }
