[NoCoverage] Equality mutation
src/Railroader.ModManager/Services/_PluginManager.cs:29:13
 
     private IEnumerable<IPlugin> PluginFactory(Mod mod) {
         var assembly = loadFrom(mod.AssemblyPath!);
-        if (assembly == null) {
+        if (assembly != null) {
             yield break;
         }

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_PluginManager.cs:30:13
     private IEnumerable<IPlugin> PluginFactory(Mod mod) {
         var assembly = loadFrom(mod.AssemblyPath!);
         if (assembly == null) {
-            yield break;
+            ;
         }
 

[NoCoverage] Negate expression
src/Railroader.ModManager/Services/_PluginManager.cs:34:17
         }
 
         foreach (var type in assembly.GetTypes()) {
-            if (type.IsAbstract) {
+            if (!(type.IsAbstract)) {
                 continue;
             }

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_PluginManager.cs:35:17
 
         foreach (var type in assembly.GetTypes()) {
             if (type.IsAbstract) {
-                continue;
+                ;
             }
 

[NoCoverage] Logical mutation
src/Railroader.ModManager/Services/_PluginManager.cs:38:17
                 continue;
             }
 
-            if (type.BaseType is not { IsGenericType: true } || type.BaseType?.GetGenericTypeDefinition() != typeof(PluginBase<>)) {
+            if (type.BaseType is not { IsGenericType: true } && type.BaseType?.GetGenericTypeDefinition() != typeof(PluginBase<>)) {
                 if (typeof(IPlugin).IsAssignableFrom(type)) {
                     logger.Warning("Type {type} inherits IPluginBase but not PluginBase<> in mod {ModId}", type, mod.Definition.Identifier);

[NoCoverage] Negate expression
src/Railroader.ModManager/Services/_PluginManager.cs:38:17
                 continue;
             }
 
-            if (type.BaseType is not { IsGenericType: true } || type.BaseType?.GetGenericTypeDefinition() != typeof(PluginBase<>)) {
+            if (!(type.BaseType is not { IsGenericType: true } || type.BaseType?.GetGenericTypeDefinition() != typeof(PluginBase<>))) {
                 if (typeof(IPlugin).IsAssignableFrom(type)) {
                     logger.Warning("Type {type} inherits IPluginBase but not PluginBase<> in mod {ModId}", type, mod.Definition.Identifier);

[NoCoverage] Negate expression
src/Railroader.ModManager/Services/_PluginManager.cs:39:21
             }
 
             if (type.BaseType is not { IsGenericType: true } || type.BaseType?.GetGenericTypeDefinition() != typeof(PluginBase<>)) {
-                if (typeof(IPlugin).IsAssignableFrom(type)) {
+                if (!(typeof(IPlugin).IsAssignableFrom(type))) {
                     logger.Warning("Type {type} inherits IPluginBase but not PluginBase<> in mod {ModId}", type, mod.Definition.Identifier);
                 }

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_PluginManager.cs:40:21
 
             if (type.BaseType is not { IsGenericType: true } || type.BaseType?.GetGenericTypeDefinition() != typeof(PluginBase<>)) {
                 if (typeof(IPlugin).IsAssignableFrom(type)) {
-                    logger.Warning("Type {type} inherits IPluginBase but not PluginBase<> in mod {ModId}", type, mod.Definition.Identifier);
+                    ;
                 }
 

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_PluginManager.cs:43:17
                     logger.Warning("Type {type} inherits IPluginBase but not PluginBase<> in mod {ModId}", type, mod.Definition.Identifier);
                 }
 
-                continue;
+                ;
             }
 

[NoCoverage] Bitwise mutation
src/Railroader.ModManager/Services/_PluginManager.cs:46:51
                 continue;
             }
 
-            var constructor = type.GetConstructor(BindingFlags.Public | BindingFlags.NonPublic | BindingFlags.Instance, null!, [typeof(IModdingContext), typeof(IMod)], null!);
+            var constructor = type.GetConstructor(BindingFlags.Public & BindingFlags.NonPublic | BindingFlags.Instance, null!, [typeof(IModdingContext), typeof(IMod)], null!);
             if (constructor == null) {
                 logger.Warning("Cannot find constructor that accepts IModdingContext, IMod parameters on plugin {plugin} in mod {ModId}", type, mod.Definition.Identifier);

[NoCoverage] Bitwise mutation
src/Railroader.ModManager/Services/_PluginManager.cs:46:51
                 continue;
             }
 
-            var constructor = type.GetConstructor(BindingFlags.Public | BindingFlags.NonPublic | BindingFlags.Instance, null!, [typeof(IModdingContext), typeof(IMod)], null!);
+            var constructor = type.GetConstructor(BindingFlags.Public | BindingFlags.NonPublic & BindingFlags.Instance, null!, [typeof(IModdingContext), typeof(IMod)], null!);
             if (constructor == null) {
                 logger.Warning("Cannot find constructor that accepts IModdingContext, IMod parameters on plugin {plugin} in mod {ModId}", type, mod.Definition.Identifier);

[NoCoverage] Equality mutation
src/Railroader.ModManager/Services/_PluginManager.cs:47:17
             }
 
             var constructor = type.GetConstructor(BindingFlags.Public | BindingFlags.NonPublic | BindingFlags.Instance, null!, [typeof(IModdingContext), typeof(IMod)], null!);
-            if (constructor == null) {
+            if (constructor != null) {
                 logger.Warning("Cannot find constructor that accepts IModdingContext, IMod parameters on plugin {plugin} in mod {ModId}", type, mod.Definition.Identifier);
                 continue;

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_PluginManager.cs:48:17
 
             var constructor = type.GetConstructor(BindingFlags.Public | BindingFlags.NonPublic | BindingFlags.Instance, null!, [typeof(IModdingContext), typeof(IMod)], null!);
             if (constructor == null) {
-                logger.Warning("Cannot find constructor that accepts IModdingContext, IMod parameters on plugin {plugin} in mod {ModId}", type, mod.Definition.Identifier);
+                ;
                 continue;
             }

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_PluginManager.cs:49:17
             var constructor = type.GetConstructor(BindingFlags.Public | BindingFlags.NonPublic | BindingFlags.Instance, null!, [typeof(IModdingContext), typeof(IMod)], null!);
             if (constructor == null) {
                 logger.Warning("Cannot find constructor that accepts IModdingContext, IMod parameters on plugin {plugin} in mod {ModId}", type, mod.Definition.Identifier);
-                continue;
+                ;
             }
 

[NoCoverage] Statement mutation
src/Railroader.ModManager/Services/_PluginManager.cs:52:13
                 continue;
             }
 
-            yield return (IPlugin)constructor.Invoke([moddingContext, mod])!;
+            ;
         }
     }
