[NoCoverage] Equality mutation
Manager/src/Railroader.ModManager/_Mod.cs:27:17
         get => _IsEnabled;
         internal set
         {
-            if (_IsEnabled == value) {
+            if (_IsEnabled != value) {
                 return;
             }

[NoCoverage] Statement mutation
Manager/src/Railroader.ModManager/_Mod.cs:28:17
         internal set
         {
             if (_IsEnabled == value) {
-                return;
+                ;
             }
 

[NoCoverage] Equality mutation
Manager/src/Railroader.ModManager/_Mod.cs:33:17
 
             _IsEnabled = value;
 
-            if (Plugins != null) {
+            if (Plugins == null) {
                 foreach (var plugin in Plugins) {
                     plugin.IsEnabled = value;

[NoCoverage] Block removal mutation
Manager/src/Railroader.ModManager/_Mod.cs:34:49
             _IsEnabled = value;
 
             if (Plugins != null) {
-                foreach (var plugin in Plugins) {
-                    plugin.IsEnabled = value;
-                }
+                foreach (var plugin in Plugins) {}
             }
         }

[NoCoverage] Equality mutation
Manager/src/Railroader.ModManager/_Mod.cs:53:78
 
     /// <inheritdoc />
     public ILogger CreateLogger(string? scope = null)
-        => ModManager.ServiceProvider.GetService<ILoggerFactory>().GetLogger(scope == null ? Definition.Identifier : $"{Definition.Identifier}.{scope}");
+        => ModManager.ServiceProvider.GetService<ILoggerFactory>().GetLogger(scope != null ? Definition.Identifier : $"{Definition.Identifier}.{scope}");
 }

[NoCoverage] Conditional (true) mutation
Manager/src/Railroader.ModManager/_Mod.cs:53:78
 
     /// <inheritdoc />
     public ILogger CreateLogger(string? scope = null)
-        => ModManager.ServiceProvider.GetService<ILoggerFactory>().GetLogger(scope == null ? Definition.Identifier : $"{Definition.Identifier}.{scope}");
+        => ModManager.ServiceProvider.GetService<ILoggerFactory>().GetLogger((true?Definition.Identifier :$"{Definition.Identifier}.{scope}"));
 }
