[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Manager/src/Railroader.ModManager/_ModDefinition.cs:49:28
 
     /// <summary> Gets a value indicating whether this mod definition is valid. </summary>
     [JsonIgnore]
-    public bool IsValid => !string.IsNullOrEmpty(Identifier) && !string.IsNullOrEmpty(Name);
+    public bool IsValid => string.IsNullOrEmpty(Identifier) && !string.IsNullOrEmpty(Name);
 }
 
killedBy: Railroader.ModManager.Tests.TestsModDefinition.LoadFromValidJsonCorrectly; Railroader.ModManager.Tests.TestsModDefinition.LoadFromInvalidJson_MissingId

[Killed] Logical mutation
Manager/src/Railroader.ModManager/_ModDefinition.cs:49:28
 
     /// <summary> Gets a value indicating whether this mod definition is valid. </summary>
     [JsonIgnore]
-    public bool IsValid => !string.IsNullOrEmpty(Identifier) && !string.IsNullOrEmpty(Name);
+    public bool IsValid => !string.IsNullOrEmpty(Identifier) || !string.IsNullOrEmpty(Name);
 }
 
killedBy: Railroader.ModManager.Tests.TestsModDefinition.LoadFromInvalidJson_MissingName; Railroader.ModManager.Tests.TestsModDefinition.LoadFromInvalidJson_MissingId
