[Killed] Null coalescing mutation (remove left)
src/MemoryFileSystem/Internal/MemoryEntry.cs:16:34
     public static readonly DateTime DefaultLastWriteTime = new(2000, 1, 1);
 
     public MemoryEntry(string folderPath, DateTime? lastWriteTime = null)
-        : this(folderPath, true, lastWriteTime ?? DefaultLastWriteTime, null, null, false) {
+        : this(folderPath, true, DefaultLastWriteTime, null, null, false) {
     }
 
killedBy: MemoryFileSystem.Tests.Internal.TestsMemoryEntry.Constructor_Folder

[Killed] Boolean mutation
src/MemoryFileSystem/Internal/MemoryEntry.cs:16:85
     public static readonly DateTime DefaultLastWriteTime = new(2000, 1, 1);
 
     public MemoryEntry(string folderPath, DateTime? lastWriteTime = null)
-        : this(folderPath, true, lastWriteTime ?? DefaultLastWriteTime, null, null, false) {
+        : this(folderPath, true, lastWriteTime ?? DefaultLastWriteTime, null, null, true) {
     }
 
killedBy: MemoryFileSystem.Tests.Internal.TestsMemoryEntry.Constructor_Folder; MemoryFileSystem.Tests.Internal.TestsMemoryEntry.Constructor_Folder

[Killed] Boolean mutation
src/MemoryFileSystem/Internal/MemoryEntry.cs:20:26
     }
 
     public MemoryEntry(string filePath, byte[] content, DateTime? lastWriteTime = null)
-        : this(filePath, false, lastWriteTime ?? DefaultLastWriteTime, content, null, false) {
+        : this(filePath, true, lastWriteTime ?? DefaultLastWriteTime, content, null, false) {
     }
 
killedBy: MemoryFileSystem.Tests.Internal.TestsMemoryZipArchiveEntry.Open_OpensStreamWithContent; MemoryFileSystem.Tests.Internal.TestsMemoryEntry.ExistingContent_ReturnsContent; MemoryFileSystem.Tests.Internal.TestsMemoryEntry.Constructor_File_Valid

[Killed] Null coalescing mutation (remove left)
src/MemoryFileSystem/Internal/MemoryEntry.cs:20:33
     }
 
     public MemoryEntry(string filePath, byte[] content, DateTime? lastWriteTime = null)
-        : this(filePath, false, lastWriteTime ?? DefaultLastWriteTime, content, null, false) {
+        : this(filePath, false, DefaultLastWriteTime, content, null, false) {
     }
 
killedBy: MemoryFileSystem.Tests.Internal.TestsMemoryEntry.Constructor_File_Valid

[Killed] Boolean mutation
src/MemoryFileSystem/Internal/MemoryEntry.cs:24:26
     }
 
     public MemoryEntry(string filePath, Exception exception, DateTime? lastWriteTime = null)
-        : this(filePath, false, lastWriteTime ?? DefaultLastWriteTime, null, exception, false) {
+        : this(filePath, true, lastWriteTime ?? DefaultLastWriteTime, null, exception, false) {
     }
 
killedBy: MemoryFileSystem.Tests.Internal.TestsMemoryEntry.Constructor_File_Exception; MemoryFileSystem.Tests.Internal.TestsMemoryEntry.Constructor_File_Exception

[Killed] Null coalescing mutation (remove left)
src/MemoryFileSystem/Internal/MemoryEntry.cs:24:33
     }
 
     public MemoryEntry(string filePath, Exception exception, DateTime? lastWriteTime = null)
-        : this(filePath, false, lastWriteTime ?? DefaultLastWriteTime, null, exception, false) {
+        : this(filePath, false, DefaultLastWriteTime, null, exception, false) {
     }
 
killedBy: MemoryFileSystem.Tests.Internal.TestsMemoryEntry.Constructor_File_Exception

[Killed] Equality mutation
src/MemoryFileSystem/Internal/MemoryEntry.cs:28:53
     }
 
     [JsonIgnore]
-    public byte[] ExistingContent => IsDirectory || Content == null
+    public byte[] ExistingContent => IsDirectory || Content != null
         ? throw new InvalidDataException($"Entry at '{Path}' is directory or its content is missing.")
         : Content;
killedBy: MemoryFileSystem.Tests.Internal.TestsMemoryZipArchiveEntry.Open_OpensStreamWithContent; MemoryFileSystem.Tests.Internal.TestsMemoryEntry.ExistingContent_ReturnsContent; MemoryFileSystem.Tests.Internal.TestsMemoryEntry.ExistingContent_ThrowsForMissingContent

[Killed] Logical mutation
src/MemoryFileSystem/Internal/MemoryEntry.cs:28:38
     }
 
     [JsonIgnore]
-    public byte[] ExistingContent => IsDirectory || Content == null
+    public byte[] ExistingContent => IsDirectory && Content == null
         ? throw new InvalidDataException($"Entry at '{Path}' is directory or its content is missing.")
         : Content;
killedBy: MemoryFileSystem.Tests.Internal.TestsMemoryEntry.ExistingContent_ThrowsForMissingContent

[Killed] String mutation
src/MemoryFileSystem/Internal/MemoryEntry.cs:29:42
 
     [JsonIgnore]
     public byte[] ExistingContent => IsDirectory || Content == null
-        ? throw new InvalidDataException($"Entry at '{Path}' is directory or its content is missing.")
+        ? throw new InvalidDataException($"")
         : Content;
 
killedBy: MemoryFileSystem.Tests.Internal.TestsMemoryEntry.ExistingContent_ThrowsForMissingContent; MemoryFileSystem.Tests.Internal.TestsMemoryEntry.ExistingContent_ThrowsForDirectory

[Killed] Negate expression
src/MemoryFileSystem/Internal/MemoryEntry.cs:33:13
         : Content;
 
     public void CheckLock() {
-        if (Locked) {
+        if (!(Locked)) {
             throw new InvalidOperationException($"File '{Path}' is locked.");
         }
killedBy: MemoryFileSystem.Tests.Internal.TestsMemoryEntry.CheckLock_ThrowsWhenLocked; MemoryFileSystem.Tests.Internal.TestsMemoryEntry.CheckLock_ThrowsWhenLocked

[Killed] Statement mutation
src/MemoryFileSystem/Internal/MemoryEntry.cs:34:13
 
     public void CheckLock() {
         if (Locked) {
-            throw new InvalidOperationException($"File '{Path}' is locked.");
+            ;
         }
     }
killedBy: MemoryFileSystem.Tests.Internal.TestsMemoryEntry.CheckLock_ThrowsWhenLocked

[Killed] String mutation
src/MemoryFileSystem/Internal/MemoryEntry.cs:34:49
 
     public void CheckLock() {
         if (Locked) {
-            throw new InvalidOperationException($"File '{Path}' is locked.");
+            throw new InvalidOperationException($"");
         }
     }
killedBy: MemoryFileSystem.Tests.Internal.TestsMemoryEntry.CheckLock_ThrowsWhenLocked
