[Killed] Statement mutation
src/MemoryFileSystem/Internal/MemoryZipArchiveEntry.cs:15:9
 
     public IZipArchiveEntry Mock() {
         var mock = Substitute.For<IZipArchiveEntry>();
-        mock.FullName.Returns(_ => FullName);
+        ;
         mock.Name.Returns(_ => Name);
         mock.Open().Returns(_ => Open());
killedBy: MemoryFileSystem.Tests.Internal.TestsMemoryZipArchiveEntry.Constructor_SetProperties

[Killed] Statement mutation
src/MemoryFileSystem/Internal/MemoryZipArchiveEntry.cs:16:9
     public IZipArchiveEntry Mock() {
         var mock = Substitute.For<IZipArchiveEntry>();
         mock.FullName.Returns(_ => FullName);
-        mock.Name.Returns(_ => Name);
+        ;
         mock.Open().Returns(_ => Open());
         return mock;
killedBy: MemoryFileSystem.Tests.Internal.TestsMemoryZipArchiveEntry.Constructor_SetProperties

[Killed] Statement mutation
src/MemoryFileSystem/Internal/MemoryZipArchiveEntry.cs:17:9
         var mock = Substitute.For<IZipArchiveEntry>();
         mock.FullName.Returns(_ => FullName);
         mock.Name.Returns(_ => Name);
-        mock.Open().Returns(_ => Open());
+        ;
         return mock;
     }
killedBy: MemoryFileSystem.Tests.Internal.TestsMemoryZipArchiveEntry.Open_OpensStreamWithContent
