[Killed] String mutation
Manager/src/Railroader.ModManager.Interfaces/FluentVersion.cs:22:47
 {
     public override string ToString() =>
         Operator switch {
-            VersionOperator.Equal          => "",
+            VersionOperator.Equal          => "Stryker was here!",
             VersionOperator.GreaterThan    => ">",
             VersionOperator.GreaterOrEqual => ">=",
killedBy: Railroader.ModManager.Interfaces.Tests.TestsFluentVersion.ToStringTest

[Killed] String mutation
Manager/src/Railroader.ModManager.Interfaces/FluentVersion.cs:25:47
             VersionOperator.Equal          => "",
             VersionOperator.GreaterThan    => ">",
             VersionOperator.GreaterOrEqual => ">=",
-            VersionOperator.LessOrEqual    => "<=",
+            VersionOperator.LessOrEqual    => "",
             VersionOperator.LessThan       => "<",
             _                              => $"[Invalid operator: {Operator}]"
killedBy: Railroader.ModManager.Interfaces.Tests.TestsFluentVersion.ToStringTest

[Killed] String mutation
Manager/src/Railroader.ModManager.Interfaces/FluentVersion.cs:26:47
             VersionOperator.GreaterThan    => ">",
             VersionOperator.GreaterOrEqual => ">=",
             VersionOperator.LessOrEqual    => "<=",
-            VersionOperator.LessThan       => "<",
+            VersionOperator.LessThan       => "",
             _                              => $"[Invalid operator: {Operator}]"
         } + Version;
killedBy: Railroader.ModManager.Interfaces.Tests.TestsFluentVersion.ToStringTest
