[Killed] String mutation
Manager/src/Railroader.ModManager.Interfaces/PluginBase.cs:15:82
 
     /// <summary> Gets the singleton instance of this plugin type. </summary>
     /// <exception cref="InvalidOperationException"> Thrown if the instance has not been created yet. </exception>
-    public static T Instance => _Instance ?? throw new InvalidOperationException($"{typeof(T)} was not created.");
+    public static T Instance => _Instance ?? throw new InvalidOperationException($"");
 
     /// <summary> Initializes a new instance of the <see cref="PluginBase{T}"/> class. </summary>
killedBy: Railroader.ModManager.Interfaces.Tests.TestsPluginBase.PrematureInstanceAccess

[Killed] Equality mutation
Manager/src/Railroader.ModManager.Interfaces/PluginBase.cs:22:13
     /// <param name="mod">The mod definition.</param>
     /// <exception cref="InvalidOperationException"> Thrown if an instance of this type already exists. </exception>
     protected PluginBase(IModdingContext moddingContext, IMod mod) {
-        if (_Instance != null) {
+        if (_Instance == null) {
             throw new InvalidOperationException($"Cannot create plugin '{GetType()}' twice.");
         }
killedBy: Railroader.ModManager.Interfaces.Tests.TestsPluginBase.PrematureInstanceAccess; Railroader.ModManager.Interfaces.Tests.TestsPluginBase.CallsOnEnableCorrectly; Railroader.ModManager.Interfaces.Tests.TestsPluginBase.CallsOnDisableCorrectly

[Killed] Statement mutation
Manager/src/Railroader.ModManager.Interfaces/PluginBase.cs:23:13
     /// <exception cref="InvalidOperationException"> Thrown if an instance of this type already exists. </exception>
     protected PluginBase(IModdingContext moddingContext, IMod mod) {
         if (_Instance != null) {
-            throw new InvalidOperationException($"Cannot create plugin '{GetType()}' twice.");
+            ;
         }
 
killedBy: Railroader.ModManager.Interfaces.Tests.TestsPluginBase.EnsureSingleton

[Killed] String mutation
Manager/src/Railroader.ModManager.Interfaces/PluginBase.cs:23:49
     /// <exception cref="InvalidOperationException"> Thrown if an instance of this type already exists. </exception>
     protected PluginBase(IModdingContext moddingContext, IMod mod) {
         if (_Instance != null) {
-            throw new InvalidOperationException($"Cannot create plugin '{GetType()}' twice.");
+            throw new InvalidOperationException($"");
         }
 
killedBy: Railroader.ModManager.Interfaces.Tests.TestsPluginBase.EnsureSingleton

[Killed] Equality mutation
Manager/src/Railroader.ModManager.Interfaces/PluginBase.cs:44:17
     public bool IsEnabled {
         get => _IsEnabled;
         set {
-            if (_IsEnabled == value) {
+            if (_IsEnabled != value) {
                 return;
             }
killedBy: Railroader.ModManager.Interfaces.Tests.TestsPluginBase.CallsOnEnableCorrectly; Railroader.ModManager.Interfaces.Tests.TestsPluginBase.CallsOnDisableCorrectly

[Killed] Statement mutation
Manager/src/Railroader.ModManager.Interfaces/PluginBase.cs:49:13
             }
 
             _IsEnabled = value;
-            OnIsEnabledChanged();
+            ;
         }
     }
killedBy: Railroader.ModManager.Interfaces.Tests.TestsPluginBase.CallsOnEnableCorrectly; Railroader.ModManager.Interfaces.Tests.TestsPluginBase.CallsOnDisableCorrectly
