[Killed] Null coalescing mutation (remove left)
src/Railroader.ModManager2/Extensions/LoggerExtensions.cs:9:45
 public static class LoggerExtensions
 {
     public static ILogger ForSourceContext(this ILogger? logger, string? scope = null) =>
-        logger?.ForContext("SourceContext", scope ?? "Railroader.ModManager")
+        logger?.ForContext("SourceContext", "Railroader.ModManager")
         ?? throw new InvalidOperationException($"Failed to create logger for source context '{scope ?? "Railroader.ModManager"}'");
 }
killedBy: Railroader.ModManager.Tests.TestsMod.CreateLogger; Railroader.ModManager.Tests.TestsMod.CreateLogger; Railroader.ModManager.Tests.Extensions.TestLoggerExtensions.ForSourceContext

[NoCoverage] Null coalescing mutation (remove left)
src/Railroader.ModManager2/Extensions/LoggerExtensions.cs:10:95
 {
     public static ILogger ForSourceContext(this ILogger? logger, string? scope = null) =>
         logger?.ForContext("SourceContext", scope ?? "Railroader.ModManager")
-        ?? throw new InvalidOperationException($"Failed to create logger for source context '{scope ?? "Railroader.ModManager"}'");
+        ?? throw new InvalidOperationException($"Failed to create logger for source context '{"Railroader.ModManager"}'");
 }

[NoCoverage] String mutation
src/Railroader.ModManager2/Extensions/LoggerExtensions.cs:10:48
 {
     public static ILogger ForSourceContext(this ILogger? logger, string? scope = null) =>
         logger?.ForContext("SourceContext", scope ?? "Railroader.ModManager")
-        ?? throw new InvalidOperationException($"Failed to create logger for source context '{scope ?? "Railroader.ModManager"}'");
+        ?? throw new InvalidOperationException($"");
 }
