[Killed] Statement mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:35:9
     }
 
     public static void Execute(ExtractModsDelegate extractMods, ModDefinitionLoaderDelegate modDefinitionLoader, IHarmony factory, Action createManagerBehaviour) {
-        extractMods();
+        ;
         ModDefinitions = modDefinitionLoader();
 
killedBy: Railroader.ModManager.Tests.Features.TestsBootstrapper.Execute_Calls_ExtractMods

[Killed] Statement mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:38:9
         extractMods();
         ModDefinitions = modDefinitionLoader();
 
-        factory.PatchCategory(typeof(ModManager).Assembly, "LogManager");
+        ;
 
         createManagerBehaviour();
killedBy: Railroader.ModManager.Tests.Features.TestsBootstrapper.Execute_Calls_Harmony

[Killed] Statement mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:40:9
 
         factory.PatchCategory(typeof(ModManager).Assembly, "LogManager");
 
-        createManagerBehaviour();
+        ;
     }
 
killedBy: Railroader.ModManager.Tests.Features.TestsBootstrapper.Execute_Calls_CreateManagerBehaviour

[Killed] Statement mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:73:13
         IHarmony harmony
         ) {
         if (modDefinitions.Count == 0) {
-            logger.Information("No mods where found.");
+            ;
             return;
         }
killedBy: Railroader.ModManager.Tests.Features.TestsBootstrapper.LoadMods_When_No_Mods_Should_Log_And_Return

[Killed] Statement mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:74:13
         ) {
         if (modDefinitions.Count == 0) {
             logger.Information("No mods where found.");
-            return;
+            ;
         }
 
killedBy: Railroader.ModManager.Tests.Features.TestsBootstrapper.LoadMods_When_No_Mods_Should_Log_And_Return

[Killed] Statement mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:77:9
             return;
         }
 
-        logger.Information("Validating mods ...");
+        ;
         modDefinitions = modDefinitionValidator(modDefinitions);
 
killedBy: Railroader.ModManager.Tests.Features.TestsBootstrapper.LoadMods_When_Validation_Fails_Should_Log_Error_And_Cancel

[Killed] Statement mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:81:13
         modDefinitions = modDefinitionValidator(modDefinitions);
 
         if (modDefinitions.Count == 0) {
-            logger.Error("Validation error detected. Canceling mod loading.");
+            ;
             return;
         }
killedBy: Railroader.ModManager.Tests.Features.TestsBootstrapper.LoadMods_When_Validation_Fails_Should_Log_Error_And_Cancel

[Killed] Statement mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:82:13
 
         if (modDefinitions.Count == 0) {
             logger.Error("Validation error detected. Canceling mod loading.");
-            return;
+            ;
         }
         
killedBy: Railroader.ModManager.Tests.Features.TestsBootstrapper.LoadMods_When_Validation_Fails_Should_Log_Error_And_Cancel

[Killed] Equality mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:87:25
         
         var mods = new Mod[modDefinitions.Count];
 
-        for (var i = 0; i < modDefinitions.Count; i++) {
+        for (var i = 0; i <= modDefinitions.Count; i++) {
             var definition    = modDefinitions[i]!;
             var result = codeCompiler(definition);
killedBy: Railroader.ModManager.Tests.Features.TestsBootstrapper.LoadMods_Should_TryCompile_Each_Valid_Mod

[Killed] PostIncrementExpression to PostDecrementExpression mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:87:51
         
         var mods = new Mod[modDefinitions.Count];
 
-        for (var i = 0; i < modDefinitions.Count; i++) {
+        for (var i = 0; i < modDefinitions.Count; i--) {
             var definition    = modDefinitions[i]!;
             var result = codeCompiler(definition);
killedBy: Railroader.ModManager.Tests.Features.TestsBootstrapper.LoadMods_Should_TryCompile_Each_Valid_Mod

[Killed] Equality mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:90:17
         for (var i = 0; i < modDefinitions.Count; i++) {
             var definition    = modDefinitions[i]!;
             var result = codeCompiler(definition);
-            if (result == CompileModResult.Success) {
+            if (result != CompileModResult.Success) {
                 codePatcher(definition);
             }
killedBy: Railroader.ModManager.Tests.Features.TestsBootstrapper.LoadMods_Should_TryCompile_Each_Valid_Mod

[NoCoverage] Statement mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:91:17
             var definition    = modDefinitions[i]!;
             var result = codeCompiler(definition);
             if (result == CompileModResult.Success) {
-                codePatcher(definition);
+                ;
             }
 

[Survived] Statement mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:99:9
         }
 
         var moddingContext = new ModdingContext(mods);
-        logger.Information("Created modding context ...");
+        ;
         logger.Debug("mods: {mods}", JsonConvert.SerializeObject(moddingContext.Mods));
 

[Survived] String mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:99:28
         }
 
         var moddingContext = new ModdingContext(mods);
-        logger.Information("Created modding context ...");
+        logger.Information("");
         logger.Debug("mods: {mods}", JsonConvert.SerializeObject(moddingContext.Mods));
 

[Survived] Statement mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:100:9
 
         var moddingContext = new ModdingContext(mods);
         logger.Information("Created modding context ...");
-        logger.Debug("mods: {mods}", JsonConvert.SerializeObject(moddingContext.Mods));
+        ;
 
         var pluginManager = createPluginsDelegateFactory(moddingContext);

[Survived] Statement mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:104:9
 
         var pluginManager = createPluginsDelegateFactory(moddingContext);
 
-        logger.Information("Instantiating plugins ...");
+        ;
         foreach (var mod in mods.Where(o => o.AssemblyPath != null)) {
             mod.Plugins = pluginManager(mod).ToArray();

[Survived] String mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:104:28
 
         var pluginManager = createPluginsDelegateFactory(moddingContext);
 
-        logger.Information("Instantiating plugins ...");
+        logger.Information("");
         foreach (var mod in mods.Where(o => o.AssemblyPath != null)) {
             mod.Plugins = pluginManager(mod).ToArray();

[Survived] Equality mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:105:45
         var pluginManager = createPluginsDelegateFactory(moddingContext);
 
         logger.Information("Instantiating plugins ...");
-        foreach (var mod in mods.Where(o => o.AssemblyPath != null)) {
+        foreach (var mod in mods.Where(o => o.AssemblyPath == null)) {
             mod.Plugins = pluginManager(mod).ToArray();
             mod.IsLoaded = true;

[Survived] Boolean mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:107:28
         logger.Information("Instantiating plugins ...");
         foreach (var mod in mods.Where(o => o.AssemblyPath != null)) {
             mod.Plugins = pluginManager(mod).ToArray();
-            mod.IsLoaded = true;
+            mod.IsLoaded = false;
         }
 

[Survived] Statement mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:111:13
         }
 
         foreach (var mod in mods) {
-            logger.Debug("enabling mod {id}", mod.Definition.Identifier);
+            ;
             mod.IsEnabled = true;
         }

[Survived] String mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:111:26
         }
 
         foreach (var mod in mods) {
-            logger.Debug("enabling mod {id}", mod.Definition.Identifier);
+            logger.Debug("", mod.Definition.Identifier);
             mod.IsEnabled = true;
         }

[Survived] Boolean mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:112:29
 
         foreach (var mod in mods) {
             logger.Debug("enabling mod {id}", mod.Definition.Identifier);
-            mod.IsEnabled = true;
+            mod.IsEnabled = false;
         }
 

[Survived] Statement mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:115:9
             mod.IsEnabled = true;
         }
 
-        logger.Information("Applying harmony patches ...");
+        ;
 
         harmony.PatchAllUncategorized(typeof(ModManager).Assembly);

[Survived] Statement mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:117:9
 
         logger.Information("Applying harmony patches ...");
 
-        harmony.PatchAllUncategorized(typeof(ModManager).Assembly);
+        ;
 
         logger.Information("Mod loader loaded ...");

[Survived] Statement mutation
src/Railroader.ModManager2/Features/Bootstrapper.cs:119:9
 
         harmony.PatchAllUncategorized(typeof(ModManager).Assembly);
 
-        logger.Information("Mod loader loaded ...");
+        ;
     }
 }
