[Killed] Block removal mutation
src/Railroader.ModManager2/Features/CodeCompiler.cs:68:34
                       .EnumerateFiles("*.cs", SearchOption.AllDirectories)
                       .OrderByDescending(o => o.LastWriteTime)
                       .ToArray();
-        if (csFiles.Length == 0) {
-            return CompileModResult.NoCode;
-        }
+        if (csFiles.Length == 0) {}
 
         var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + ".dll");
killedBy: Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_WhenNoSources

[Killed] String mutation
src/Railroader.ModManager2/Features/CodeCompiler.cs:72:86
             return CompileModResult.NoCode;
         }
 
-        var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + ".dll");
+        var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + "");
         if (exists(assemblyPath)) {
             var newestFile = csFiles[0];
killedBy: Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_AssemblyUpToDate; Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_AssemblyUpToDate; Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Successful

[Killed] Equality mutation
src/Railroader.ModManager2/Features/CodeCompiler.cs:75:17
         var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + ".dll");
         if (exists(assemblyPath)) {
             var newestFile = csFiles[0];
-            if (getLastWriteTime(assemblyPath) >= newestFile.LastWriteTime) {
+            if (getLastWriteTime(assemblyPath) > newestFile.LastWriteTime) {
                 logger.Information("Using existing mod {ModId} DLL at {Path}", definition.Identifier, assemblyPath);
                 return CompileModResult.AssemblyValid;
killedBy: Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_AssemblyUpToDate

[Killed] String mutation
src/Railroader.ModManager2/Features/CodeCompiler.cs:76:36
         if (exists(assemblyPath)) {
             var newestFile = csFiles[0];
             if (getLastWriteTime(assemblyPath) >= newestFile.LastWriteTime) {
-                logger.Information("Using existing mod {ModId} DLL at {Path}", definition.Identifier, assemblyPath);
+                logger.Information("", definition.Identifier, assemblyPath);
                 return CompileModResult.AssemblyValid;
             }
killedBy: Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_AssemblyUpToDate; Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_AssemblyUpToDate

[Killed] String mutation
src/Railroader.ModManager2/Features/CodeCompiler.cs:89:84
         var sources = csFiles.Select(o => o.FullName).ToArray();
 
         var managedPath = Path.Combine(getCurrentDirectory(), "Railroader_Data", "Managed");
-        var references  = referenceNames.Select(o => Path.Combine(managedPath, o + ".dll")).ToList();
+        var references  = referenceNames.Select(o => Path.Combine(managedPath, o + "")).ToList();
 
         if (definition.Requires?.Count > 0) {
killedBy: Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Successful; Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Successful; Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Failed

[Killed] Equality mutation
src/Railroader.ModManager2/Features/CodeCompiler.cs:91:13
         var managedPath = Path.Combine(getCurrentDirectory(), "Railroader_Data", "Managed");
         var references  = referenceNames.Select(o => Path.Combine(managedPath, o + ".dll")).ToList();
 
-        if (definition.Requires?.Count > 0) {
+        if (definition.Requires?.Count >= 0) {
             logger.Information("Adding references to {Mods} ...", definition.Requires.Keys);
             var modsPath      = Path.Combine(getCurrentDirectory(), "Mods");
killedBy: Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Successful

[Killed] String mutation
src/Railroader.ModManager2/Features/CodeCompiler.cs:92:32
         var references  = referenceNames.Select(o => Path.Combine(managedPath, o + ".dll")).ToList();
 
         if (definition.Requires?.Count > 0) {
-            logger.Information("Adding references to {Mods} ...", definition.Requires.Keys);
+            logger.Information("", definition.Requires.Keys);
             var modsPath      = Path.Combine(getCurrentDirectory(), "Mods");
             var modReferences = definition.Requires.Keys.Select(o => Path.Combine(modsPath, o, o + ".dll"));
killedBy: Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_WithValidModReferences

[Killed] String mutation
src/Railroader.ModManager2/Features/CodeCompiler.cs:94:100
         if (definition.Requires?.Count > 0) {
             logger.Information("Adding references to {Mods} ...", definition.Requires.Keys);
             var modsPath      = Path.Combine(getCurrentDirectory(), "Mods");
-            var modReferences = definition.Requires.Keys.Select(o => Path.Combine(modsPath, o, o + ".dll"));
+            var modReferences = definition.Requires.Keys.Select(o => Path.Combine(modsPath, o, o + ""));
             references.AddRange(modReferences);
         }
killedBy: Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_WithValidModReferences
