[Killed] Equality mutation
src/Railroader.ModManager2/Features/CodePatcher.cs:42:13
     ];
 
-        if (pluginPatchers.Length == 0) {
+        if (pluginPatchers.Length != 0) {
             return;
         }
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_AssemblyLoadFail; Railroader.ModManager.Tests.Features.TestsCodePatcher.NoPatches_DoNothing

[Killed] Statement mutation
src/Railroader.ModManager2/Features/CodePatcher.cs:43:13
 
         if (pluginPatchers.Length == 0) {
-            return;
+            ;
         }
 
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.NoPatches_DoNothing

[Killed] Statement mutation
src/Railroader.ModManager2/Features/CodePatcher.cs:46:9
             return;
         }
 
-        logger.Information("Patching mod {ModId} ...", definition.Identifier);
+        ;
 
         var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + ".dll");
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_AssemblyLoadFail

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager2/Features/CodePatcher.cs:49:13
         logger.Information("Patching mod {ModId} ...", definition.Identifier);
 
         var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + ".dll");
-        if (!ApplyPatches(logger, readAssemblyDefinition, writeAssemblyDefinition, getCurrentDirectory, enumerateDirectories, delete, move, assemblyPath, definition.Identifier, pluginPatchers)) {
+        if (ApplyPatches(logger, readAssemblyDefinition, writeAssemblyDefinition, getCurrentDirectory, enumerateDirectories, delete, move, assemblyPath, definition.Identifier, pluginPatchers)) {
             logger.Error("Failed to apply patches to assembly {AssemblyPath} for mod {ModId}", assemblyPath, definition.Identifier);
             return;
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_AssemblyLoadFail

[Killed] Statement mutation
src/Railroader.ModManager2/Features/CodePatcher.cs:50:13
 
         var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + ".dll");
         if (!ApplyPatches(logger, readAssemblyDefinition, writeAssemblyDefinition, getCurrentDirectory, enumerateDirectories, delete, move, assemblyPath, definition.Identifier, pluginPatchers)) {
-            logger.Error("Failed to apply patches to assembly {AssemblyPath} for mod {ModId}", assemblyPath, definition.Identifier);
+            ;
             return;
         }
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_AssemblyLoadFail

[Survived] String mutation
src/Railroader.ModManager2/Features/CodePatcher.cs:66:77
             var resolver = new DefaultAssemblyResolver();
 
             // game DLLs
-            resolver.AddSearchDirectory(Path.Combine(getCurrentDirectory(), "Railroader_Data", "Managed"));
+            resolver.AddSearchDirectory(Path.Combine(getCurrentDirectory(), "", "Managed"));
 
             // other mods DLLs

[Survived] Equality mutation
src/Railroader.ModManager2/Features/CodePatcher.cs:70:107
 
             // other mods DLLs
             var thisModDir = Path.GetDirectoryName(assemblyPath);
-            var modDirs    = enumerateDirectories(Path.Combine(getCurrentDirectory(), "Mods")).Where(o => o != thisModDir);
+            var modDirs    = enumerateDirectories(Path.Combine(getCurrentDirectory(), "Mods")).Where(o => o == thisModDir);
             foreach (var modDir in modDirs) {
                 resolver.AddSearchDirectory(modDir);

[Survived] Statement mutation
src/Railroader.ModManager2/Features/CodePatcher.cs:91:25
                                                  .Select(o => o.Factory());
 
                     foreach (var patcher in patchers) {
-                        patcher!(assemblyDefinition, type);
+                        ;
                         hasPatch = true;
                     }

[Survived] Boolean mutation
src/Railroader.ModManager2/Features/CodePatcher.cs:92:36
 
                     foreach (var patcher in patchers) {
                         patcher!(assemblyDefinition, type);
-                        hasPatch = true;
+                        hasPatch = false;
                     }
                 } catch (Exception ex) {

[Survived] String mutation
src/Railroader.ModManager2/Features/CodePatcher.cs:104:30
 
             if (success) {
                 writeAssemblyDefinition(assemblyDefinition, tempFilePath);
-                logger.Debug("Wrote patched assembly to temporary file {TempPath} for mod {ModId}", tempFilePath, modId);
+                logger.Debug("", tempFilePath, modId);
             } else {
                 logger.Information("No patches to assembly {AssemblyPath} for mod {ModId} where applied", assemblyPath, modId);
