[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Railroader.ModManager2/Features/CodePatchers/HarmonyPluginPatcher.cs:36:68
     public static void OnIsEnabledChanged(IHarmonyPlugin plugin) {
         var context = (ModdingContext)plugin.ModdingContext;
 
-        var state = _States.GetOrAdd(plugin, _ => new PatcherState(!plugin.IsEnabled, context.HarmonyFactory(plugin.Mod.Definition.Identifier)))!;
+        var state = _States.GetOrAdd(plugin, _ => new PatcherState(plugin.IsEnabled, context.HarmonyFactory(plugin.Mod.Definition.Identifier)))!;
         if (state.IsEnabled == plugin.IsEnabled) {
             return;
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.PatchAllWhenEnabled; Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.IgnoreRepeatCalls; Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.UnpatchAllWhenDisabled

[Killed] Equality mutation
Railroader.ModManager2/Features/CodePatchers/HarmonyPluginPatcher.cs:37:13
         var context = (ModdingContext)plugin.ModdingContext;
 
         var state = _States.GetOrAdd(plugin, _ => new PatcherState(!plugin.IsEnabled, context.HarmonyFactory(plugin.Mod.Definition.Identifier)))!;
-        if (state.IsEnabled == plugin.IsEnabled) {
+        if (state.IsEnabled != plugin.IsEnabled) {
             return;
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.PatchAllWhenEnabled; Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.IgnoreRepeatCalls; Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.UnpatchAllWhenDisabled

[Killed] Negate expression
Railroader.ModManager2/Features/CodePatchers/HarmonyPluginPatcher.cs:43:13
 
         _States[plugin] = state with { IsEnabled = plugin.IsEnabled };
 
-        if (plugin.IsEnabled) {
+        if (!(plugin.IsEnabled)) {
             context.Logger.Information("Applying Harmony patch for mod {ModId}", plugin.Mod.Definition.Identifier);
             state.Harmony.PatchAll(plugin.GetType().Assembly);
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.PatchAllWhenEnabled; Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.IgnoreRepeatCalls; Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.UnpatchAllWhenDisabled

[Killed] Statement mutation
Railroader.ModManager2/Features/CodePatchers/HarmonyPluginPatcher.cs:44:13
         _States[plugin] = state with { IsEnabled = plugin.IsEnabled };
 
         if (plugin.IsEnabled) {
-            context.Logger.Information("Applying Harmony patch for mod {ModId}", plugin.Mod.Definition.Identifier);
+            ;
             state.Harmony.PatchAll(plugin.GetType().Assembly);
         } else {
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.PatchAllWhenEnabled; Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.IgnoreRepeatCalls

[Killed] Statement mutation
Railroader.ModManager2/Features/CodePatchers/HarmonyPluginPatcher.cs:45:13
 
         if (plugin.IsEnabled) {
             context.Logger.Information("Applying Harmony patch for mod {ModId}", plugin.Mod.Definition.Identifier);
-            state.Harmony.PatchAll(plugin.GetType().Assembly);
+            ;
         } else {
             context.Logger.Information("Removing Harmony patch for mod {ModId}", plugin.Mod.Definition.Identifier);
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.PatchAllWhenEnabled; Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.IgnoreRepeatCalls

[Killed] Statement mutation
Railroader.ModManager2/Features/CodePatchers/HarmonyPluginPatcher.cs:47:13
             context.Logger.Information("Applying Harmony patch for mod {ModId}", plugin.Mod.Definition.Identifier);
             state.Harmony.PatchAll(plugin.GetType().Assembly);
         } else {
-            context.Logger.Information("Removing Harmony patch for mod {ModId}", plugin.Mod.Definition.Identifier);
+            ;
             state.Harmony.UnpatchAll(plugin.Mod.Definition.Identifier);
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.UnpatchAllWhenDisabled

[Killed] Statement mutation
Railroader.ModManager2/Features/CodePatchers/HarmonyPluginPatcher.cs:48:13
             state.Harmony.PatchAll(plugin.GetType().Assembly);
         } else {
             context.Logger.Information("Removing Harmony patch for mod {ModId}", plugin.Mod.Definition.Identifier);
-            state.Harmony.UnpatchAll(plugin.Mod.Definition.Identifier);
+            ;
         }
     }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.UnpatchAllWhenDisabled
