[Killed] Null coalescing mutation (remove left)
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:30:52
 
     [EditorBrowsable(EditorBrowsableState.Never)]
     public static MethodPatcherDelegate Factory<TMarker>(ILogger logger, Type patcherType, Type targetBaseType, string targetMethod, string? injectorMethod = null) {
-        var injectedMethod = patcherType.GetMethod(injectorMethod ?? targetMethod, BindingFlags.Public | BindingFlags.Static);
+        var injectedMethod = patcherType.GetMethod(targetMethod, BindingFlags.Public | BindingFlags.Static);
 
         List<string> errors = new();
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists

[Killed] Bitwise mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:30:84
 
     [EditorBrowsable(EditorBrowsableState.Never)]
     public static MethodPatcherDelegate Factory<TMarker>(ILogger logger, Type patcherType, Type targetBaseType, string targetMethod, string? injectorMethod = null) {
-        var injectedMethod = patcherType.GetMethod(injectorMethod ?? targetMethod, BindingFlags.Public | BindingFlags.Static);
+        var injectedMethod = patcherType.GetMethod(injectorMethod ?? targetMethod, BindingFlags.Public & BindingFlags.Static);
 
         List<string> errors = new();
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists

[Killed] Equality mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:33:13
         var injectedMethod = patcherType.GetMethod(injectorMethod ?? targetMethod, BindingFlags.Public | BindingFlags.Static);
 
         List<string> errors = new();
-        if (injectedMethod == null) {
+        if (injectedMethod != null) {
             errors.Add("Injected method must be public and static.");
         } else {
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod

[Killed] Statement mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:34:13
 
         List<string> errors = new();
         if (injectedMethod == null) {
-            errors.Add("Injected method must be public and static.");
+            ;
         } else {
             if (injectedMethod.ReturnType != typeof(void)) {
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod

[Killed] Equality mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:36:17
         if (injectedMethod == null) {
             errors.Add("Injected method must be public and static.");
         } else {
-            if (injectedMethod.ReturnType != typeof(void)) {
+            if (injectedMethod.ReturnType == typeof(void)) {
                 errors.Add("Injected method must bave void return type.");
             }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes

[Killed] Statement mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:37:17
             errors.Add("Injected method must be public and static.");
         } else {
             if (injectedMethod.ReturnType != typeof(void)) {
-                errors.Add("Injected method must bave void return type.");
+                ;
             }
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:40:17
                 errors.Add("Injected method must bave void return type.");
             }
 
-            if (!injectedMethod.DeclaringType!.IsPublic) {
+            if (injectedMethod.DeclaringType!.IsPublic) {
                 errors.Add("Injected method declaring type must be public.");
             }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes

[Killed] Statement mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:41:17
             }
 
             if (!injectedMethod.DeclaringType!.IsPublic) {
-                errors.Add("Injected method declaring type must be public.");
+                ;
             }
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorClass

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:45:43
             }
 
             var parameters = injectedMethod.GetParameters();
-            if (parameters.Length != 1 || !parameters[0].ParameterType.IsAssignableFrom(typeof(TMarker))) {
+            if (parameters.Length != 1 || parameters[0].ParameterType.IsAssignableFrom(typeof(TMarker))) {
                 errors.Add($"Injected method must have single parameter assignable from {typeof(TMarker)}.");
             }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes

[Killed] Equality mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:45:17
             }
 
             var parameters = injectedMethod.GetParameters();
-            if (parameters.Length != 1 || !parameters[0].ParameterType.IsAssignableFrom(typeof(TMarker))) {
+            if (parameters.Length == 1 || !parameters[0].ParameterType.IsAssignableFrom(typeof(TMarker))) {
                 errors.Add($"Injected method must have single parameter assignable from {typeof(TMarker)}.");
             }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.Factory; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod

[Killed] Statement mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:46:17
 
             var parameters = injectedMethod.GetParameters();
             if (parameters.Length != 1 || !parameters[0].ParameterType.IsAssignableFrom(typeof(TMarker))) {
-                errors.Add($"Injected method must have single parameter assignable from {typeof(TMarker)}.");
+                ;
             }
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod

[Killed] String mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:46:28
 
             var parameters = injectedMethod.GetParameters();
             if (parameters.Length != 1 || !parameters[0].ParameterType.IsAssignableFrom(typeof(TMarker))) {
-                errors.Add($"Injected method must have single parameter assignable from {typeof(TMarker)}.");
+                errors.Add($"");
             }
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod

[Killed] Negate expression
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:50:13
             }
         }
 
-        if (injectedMethod == null || errors.Count > 0) {
+        if (!(injectedMethod == null || errors.Count > 0)) {
             throw new ValidationException("Failed to resolve injected method. See errors for details.", errors);
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod

[Killed] Equality mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:50:39
             }
         }
 
-        if (injectedMethod == null || errors.Count > 0) {
+        if (injectedMethod == null || errors.Count >= 0) {
             throw new ValidationException("Failed to resolve injected method. See errors for details.", errors);
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes

[Killed] Statement mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:51:13
         }
 
         if (injectedMethod == null || errors.Count > 0) {
-            throw new ValidationException("Failed to resolve injected method. See errors for details.", errors);
+            ;
         }
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod

[Killed] String mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:51:43
         }
 
         if (injectedMethod == null || errors.Count > 0) {
-            throw new ValidationException("Failed to resolve injected method. See errors for details.", errors);
+            throw new ValidationException("", errors);
         }
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod

[Killed] Linq method mutation (Any() to All())
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:60:26
 
     private static bool Execute(this MethodPatcherContext context, AssemblyDefinition assemblyDefinition, TypeDefinition typeDefinition) {
         var isBaseType = context.IsDerivedFromBaseType(typeDefinition);
-        var hasMarker  = typeDefinition.Interfaces.Any(i => i.InterfaceType?.FullName == context.MarkerType.FullName);
+        var hasMarker  = typeDefinition.Interfaces.All(i => i.InterfaceType?.FullName == context.MarkerType.FullName);
         if (!isBaseType || !hasMarker) {
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes

[Killed] Equality mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:60:61
 
     private static bool Execute(this MethodPatcherContext context, AssemblyDefinition assemblyDefinition, TypeDefinition typeDefinition) {
         var isBaseType = context.IsDerivedFromBaseType(typeDefinition);
-        var hasMarker  = typeDefinition.Interfaces.Any(i => i.InterfaceType?.FullName == context.MarkerType.FullName);
+        var hasMarker  = typeDefinition.Interfaces.Any(i => i.InterfaceType?.FullName != context.MarkerType.FullName);
         if (!isBaseType || !hasMarker) {
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Logical mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:61:13
     private static bool Execute(this MethodPatcherContext context, AssemblyDefinition assemblyDefinition, TypeDefinition typeDefinition) {
         var isBaseType = context.IsDerivedFromBaseType(typeDefinition);
         var hasMarker  = typeDefinition.Interfaces.Any(i => i.InterfaceType?.FullName == context.MarkerType.FullName);
-        if (!isBaseType || !hasMarker) {
+        if (!isBaseType && !hasMarker) {
             return false;
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:61:13
     private static bool Execute(this MethodPatcherContext context, AssemblyDefinition assemblyDefinition, TypeDefinition typeDefinition) {
         var isBaseType = context.IsDerivedFromBaseType(typeDefinition);
         var hasMarker  = typeDefinition.Interfaces.Any(i => i.InterfaceType?.FullName == context.MarkerType.FullName);
-        if (!isBaseType || !hasMarker) {
+        if (isBaseType || !hasMarker) {
             return false;
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes

[Killed] Boolean mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:63:20
         var hasMarker  = typeDefinition.Interfaces.Any(i => i.InterfaceType?.FullName == context.MarkerType.FullName);
         if (!isBaseType || !hasMarker) {
-            return false;
+            return true;
         }
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.Factory; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes

[Killed] Null coalescing mutation (left to right)
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:67:22
         }
 
         var module = assemblyDefinition.MainModule;
-        var method = typeDefinition.Methods.FirstOrDefault(m => m.Name == context.TargetMethod) ?? context.CreateMethodOverride(typeDefinition, module);
+        var method = context.CreateMethodOverride(typeDefinition, module)?? typeDefinition.Methods.FirstOrDefault(m => m.Name == context.TargetMethod);
         if (method == null) {
             return false;
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Linq method mutation (FirstOrDefault() to First())
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:67:22
         }
 
         var module = assemblyDefinition.MainModule;
-        var method = typeDefinition.Methods.FirstOrDefault(m => m.Name == context.TargetMethod) ?? context.CreateMethodOverride(typeDefinition, module);
+        var method = typeDefinition.Methods.First(m => m.Name == context.TargetMethod) ?? context.CreateMethodOverride(typeDefinition, module);
         if (method == null) {
             return false;
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Equality mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:68:13
 
         var module = assemblyDefinition.MainModule;
         var method = typeDefinition.Methods.FirstOrDefault(m => m.Name == context.TargetMethod) ?? context.CreateMethodOverride(typeDefinition, module);
-        if (method == null) {
+        if (method != null) {
             return false;
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Statement mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:83:13
                                                    mr.FullName == injectedMethodReference.FullName);
 
         if (hasPatcherCall) {
-            context.Logger.Information("Skipping patch of {TypeName} as it already contain code for {PluginInterface}", typeDefinition.FullName, context.MarkerType);
+            ;
             return false;
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch

[Killed] Boolean mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:84:20
 
         if (hasPatcherCall) {
             context.Logger.Information("Skipping patch of {TypeName} as it already contain code for {PluginInterface}", typeDefinition.FullName, context.MarkerType);
-            return false;
+            return true;
         }
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch

[Killed] Statement mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:92:9
         ilProcessor.InsertBefore(firstInstruction, ilProcessor.Create(OpCodes.Ldarg_0));
         ilProcessor.InsertBefore(firstInstruction, ilProcessor.Create(OpCodes.Call, injectedMethodReference));
 
-        context.Logger.Information("Successfully patched {TypeName} for {PluginInterface}", typeDefinition.FullName, context.MarkerType);
+        ;
         return true;
     }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Boolean mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:93:16
         ilProcessor.InsertBefore(firstInstruction, ilProcessor.Create(OpCodes.Call, injectedMethodReference));
 
         context.Logger.Information("Successfully patched {TypeName} for {PluginInterface}", typeDefinition.FullName, context.MarkerType);
-        return true;
+        return false;
     }
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Conditional (false) mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:98:13
 
     private static bool IsDerivedFromBaseType(this MethodPatcherContext context, TypeDefinition typeDefinition) {
         Func<TypeReference, string?> getFullName =
-            context.TargetBaseType.IsGenericTypeDefinition
-                ? reference => (reference as GenericInstanceType)?.ElementType?.FullName
-                : reference => reference?.FullName;
+            (false?reference => (reference as GenericInstanceType)?.ElementType?.FullName
+:reference => reference?.FullName);
 
         var currentType = typeDefinition;
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes

[Killed] Conditional (true) mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:98:13
 
     private static bool IsDerivedFromBaseType(this MethodPatcherContext context, TypeDefinition typeDefinition) {
         Func<TypeReference, string?> getFullName =
-            context.TargetBaseType.IsGenericTypeDefinition
-                ? reference => (reference as GenericInstanceType)?.ElementType?.FullName
-                : reference => reference?.FullName;
+            (true?reference => (reference as GenericInstanceType)?.ElementType?.FullName
+:reference => reference?.FullName);
 
         var currentType = typeDefinition;
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.Factory; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes

[Killed] Equality mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:107:17
             var baseType = currentType.BaseType;
 
             var fullName = getFullName(baseType);
-            if (fullName == context.TargetBaseType.FullName) {
+            if (fullName != context.TargetBaseType.FullName) {
                 return true;
             }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded_GenericBase

[Killed] Boolean mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:108:24
 
             var fullName = getFullName(baseType);
             if (fullName == context.TargetBaseType.FullName) {
-                return true;
+                return false;
             }
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Statement mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:118:9
     }
 
     private static MethodDefinition? CreateMethodOverride(this MethodPatcherContext context, TypeDefinition typeDefinition, ModuleDefinition module) {
-        context.Logger.Debug("{MethodName} method not found in {TypeName}, creating override", context.TargetMethod, typeDefinition.FullName);
+        ;
 
         var baseMethodDef = context.FindVirtualBaseMethod(typeDefinition.BaseType);
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] String mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:118:30
     }
 
     private static MethodDefinition? CreateMethodOverride(this MethodPatcherContext context, TypeDefinition typeDefinition, ModuleDefinition module) {
-        context.Logger.Debug("{MethodName} method not found in {TypeName}, creating override", context.TargetMethod, typeDefinition.FullName);
+        context.Logger.Debug("", context.TargetMethod, typeDefinition.FullName);
 
         var baseMethodDef = context.FindVirtualBaseMethod(typeDefinition.BaseType);
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Equality mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:121:13
         context.Logger.Debug("{MethodName} method not found in {TypeName}, creating override", context.TargetMethod, typeDefinition.FullName);
 
         var baseMethodDef = context.FindVirtualBaseMethod(typeDefinition.BaseType);
-        if (baseMethodDef == null) {
+        if (baseMethodDef != null) {
             context.Logger.Error("Virtual method '{MethodName}' not found in {TypeName} hierarchy!", context.TargetMethod, typeDefinition.FullName);
             return null;
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Statement mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:122:13
 
         var baseMethodDef = context.FindVirtualBaseMethod(typeDefinition.BaseType);
         if (baseMethodDef == null) {
-            context.Logger.Error("Virtual method '{MethodName}' not found in {TypeName} hierarchy!", context.TargetMethod, typeDefinition.FullName);
+            ;
             return null;
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists

[Killed] Bitwise mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:128:61
 
         var baseMethodRef = module.ImportReference(baseMethodDef);
 
-        var methodAttributes = baseMethodDef.Attributes & ~(MethodAttributes.Final | MethodAttributes.NewSlot) | MethodAttributes.HideBySig;
+        var methodAttributes = baseMethodDef.Attributes & ~(MethodAttributes.Final & MethodAttributes.NewSlot) | MethodAttributes.HideBySig;
 
         var method = new MethodDefinition(context.TargetMethod, methodAttributes, module.ImportReference(baseMethodDef.ReturnType));
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Bitwise mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:128:32
 
         var baseMethodRef = module.ImportReference(baseMethodDef);
 
-        var methodAttributes = baseMethodDef.Attributes & ~(MethodAttributes.Final | MethodAttributes.NewSlot) | MethodAttributes.HideBySig;
+        var methodAttributes = baseMethodDef.Attributes | ~(MethodAttributes.Final | MethodAttributes.NewSlot) | MethodAttributes.HideBySig;
 
         var method = new MethodDefinition(context.TargetMethod, methodAttributes, module.ImportReference(baseMethodDef.ReturnType));
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Statement mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:154:9
         il.Append(il.Create(OpCodes.Ret));
 
         typeDefinition.Methods.Add(method);
-        context.Logger.Debug("Created {MethodName} override with base call in {TypeName}", context.TargetMethod, typeDefinition.FullName);
+        ;
         return method;
     }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Equality mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:161:62
     private static MethodDefinition? FindVirtualBaseMethod(this MethodPatcherContext context, TypeReference? baseTypeRef) {
         var current = baseTypeRef?.Resolve();
         while (current != null) {
-            var method = current.Methods.FirstOrDefault(m => m.Name == context.TargetMethod && m.IsVirtual);
+            var method = current.Methods.FirstOrDefault(m => m.Name != context.TargetMethod && m.IsVirtual);
             if (method != null) {
                 return method;
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Linq method mutation (FirstOrDefault() to First())
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:161:26
     private static MethodDefinition? FindVirtualBaseMethod(this MethodPatcherContext context, TypeReference? baseTypeRef) {
         var current = baseTypeRef?.Resolve();
         while (current != null) {
-            var method = current.Methods.FirstOrDefault(m => m.Name == context.TargetMethod && m.IsVirtual);
+            var method = current.Methods.First(m => m.Name == context.TargetMethod && m.IsVirtual);
             if (method != null) {
                 return method;
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded
