[Killed] Block removal mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:162:33
         var current = baseTypeRef?.Resolve();
         while (current != null) {
             var method = current.Methods.FirstOrDefault(m => m.Name == context.TargetMethod && m.IsVirtual);
-            if (method != null) {
-                return method;
-            }
+            if (method != null) {}
 
             current = current.BaseType?.Resolve();
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Equality mutation
Railroader.ModManager2/Features/CodePatchers/MethodPatcher.cs:162:17
         var current = baseTypeRef?.Resolve();
         while (current != null) {
             var method = current.Methods.FirstOrDefault(m => m.Name == context.TargetMethod && m.IsVirtual);
-            if (method != null) {
+            if (method == null) {
                 return method;
             }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded
