[Killed] String mutation
src/Railroader.ModManager2/Features/CompileAssembly.cs:81:22
         //   -delaysign[+|-]      Only insert the public key into the assembly (no signing)
         //   -doc:FILE            Process documentation comments to XML file
         //   -fullpaths           Any issued error or warning uses absolute file path
-        yield return "-fullpaths";
+        yield return "";
         //   -help                Lists all compiler options (short: -?)
         //   -keycontainer:NAME   The key pair container used to sign the output assembly
killedBy: Railroader.ModManager.Tests.Features.TestsCompileAssemblyCore.CompileAssemblyWhenSuccessful; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes

[Killed] String mutation
src/Railroader.ModManager2/Features/CompileAssembly.cs:92:22
         //   -nostdlib[+|-]       Does not reference mscorlib.dll library
         //   -nowarn:W1[,Wn]      Suppress one or more compiler warnings
         //   -optimize[+|-]       Enables advanced compiler optimizations (short: -o)
-        yield return "-optimize";
+        yield return "";
         //   -out:FILE            Specifies output assembly name
         yield return $"-out:{assemblyPath}";
killedBy: Railroader.ModManager.Tests.Features.TestsCompileAssemblyCore.CompileAssemblyWhenSuccessful; Railroader.ModManager.Tests.Features.TestsCompileAssemblyCore.CompileAssemblyWhenFailed; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes

[Killed] String mutation
src/Railroader.ModManager2/Features/CompileAssembly.cs:94:22
         //   -optimize[+|-]       Enables advanced compiler optimizations (short: -o)
         yield return "-optimize";
         //   -out:FILE            Specifies output assembly name
-        yield return $"-out:{assemblyPath}";
+        yield return $"";
         //   -pkg:P1[,Pn]         References packages P1..Pn
         //   -platform:ARCH       Specifies the target platform of the output assembly
killedBy: Railroader.ModManager.Tests.Features.TestsCompileAssemblyCore.CompileAssemblyWhenSuccessful; Railroader.ModManager.Tests.Features.TestsCompileAssemblyCore.CompileAssemblyWhenFailed; Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.Factory

[Killed] String mutation
src/Railroader.ModManager2/Features/CompileAssembly.cs:101:48
         //                        x86, x64 or itanium. The default is anycpu.
         //   -recurse:SPEC        Recursively compiles files according to SPEC pattern
         //   -reference:A1[,An]   Imports metadata from the specified assembly (short: -r)
-        yield return $"-reference:{string.Join(",", references)}";
+        yield return $"-reference:{string.Join("", references)}";
         //   -reference:ALIAS=A   Imports metadata using specified extern alias (short: -r)
         //   -sdk:VERSION         Specifies SDK version of referenced assemblies
killedBy: Railroader.ModManager.Tests.Features.TestsCompileAssemblyCore.CompileAssemblyWhenSuccessful; Railroader.ModManager.Tests.Features.TestsCompileAssemblyCore.CompileAssemblyWhenFailed; Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.Factory
