[Killed] String mutation
src/Railroader.ModManager2/Features/ModDefinitionLoader.cs:30:32
         foreach (var directory in enumerateDirectories(baseDirectory)) {
             var path = Path.Combine(directory, "Definition.json");
             if (!exists(path)) {
-                logger.Warning("Not loading directory {directory}: Missing Definition.json.", directory);
+                logger.Warning("", directory);
                 continue;
             }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.SkipsModsWithoutDefinition

[Killed] String mutation
src/Railroader.ModManager2/Features/ModDefinitionLoader.cs:46:30
                     modDefinitions.Add(modDefinition.Identifier, modDefinition);
                 }
             } catch (JsonException exc) {
-                logger.Error("Failed to parse definition JSON, json error: {exception}", exc);
+                logger.Error("", exc);
             } catch (Exception exc) {
                 logger.Error("Failed to parse definition JSON, generic error: {exception}", exc);
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.DetectInvalidDefinitionJson

[Killed] String mutation
src/Railroader.ModManager2/Features/ModDefinitionLoader.cs:48:30
             } catch (JsonException exc) {
                 logger.Error("Failed to parse definition JSON, json error: {exception}", exc);
             } catch (Exception exc) {
-                logger.Error("Failed to parse definition JSON, generic error: {exception}", exc);
+                logger.Error("", exc);
             }
         }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.DetectAnyErrorWhenLoadingDefinitionJson
