[Killed] Negate expression
src/Railroader.ModManager2/Features/ModDefinitionValidator.cs:20:13
 
     public static IReadOnlyList<ModDefinition> Execute(ILogger logger, IReadOnlyList<ModDefinition> modDefinitions) {
         List<string> errors = [];
-        if (VerifyRequirementsAndConflicts(modDefinitions, errors)) {
+        if (!(VerifyRequirementsAndConflicts(modDefinitions, errors))) {
             modDefinitions = SortByDependencies(modDefinitions, errors);
         }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] Block removal mutation
src/Railroader.ModManager2/Features/ModDefinitionValidator.cs:20:69
 
     public static IReadOnlyList<ModDefinition> Execute(ILogger logger, IReadOnlyList<ModDefinition> modDefinitions) {
         List<string> errors = [];
-        if (VerifyRequirementsAndConflicts(modDefinitions, errors)) {
-            modDefinitions = SortByDependencies(modDefinitions, errors);
-        }
+        if (VerifyRequirementsAndConflicts(modDefinitions, errors)) {}
 
         if (errors.Count > 0) {
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] Equality mutation
src/Railroader.ModManager2/Features/ModDefinitionValidator.cs:24:13
             modDefinitions = SortByDependencies(modDefinitions, errors);
         }
 
-        if (errors.Count > 0) {
+        if (errors.Count >= 0) {
             logger.Error("Mod preprocessing failed with error(s): {errors}", errors.ToArray());
             return [];
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] Negate expression
src/Railroader.ModManager2/Features/ModDefinitionValidator.cs:24:13
             modDefinitions = SortByDependencies(modDefinitions, errors);
         }
 
-        if (errors.Count > 0) {
+        if (!(errors.Count > 0)) {
             logger.Error("Mod preprocessing failed with error(s): {errors}", errors.ToArray());
             return [];
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] Statement mutation
src/Railroader.ModManager2/Features/ModDefinitionValidator.cs:25:13
         }
 
         if (errors.Count > 0) {
-            logger.Error("Mod preprocessing failed with error(s): {errors}", errors.ToArray());
+            ;
             return [];
         }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] String mutation
src/Railroader.ModManager2/Features/ModDefinitionValidator.cs:25:26
         }
 
         if (errors.Count > 0) {
-            logger.Error("Mod preprocessing failed with error(s): {errors}", errors.ToArray());
+            logger.Error("", errors.ToArray());
             return [];
         }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] Statement mutation
src/Railroader.ModManager2/Features/ModDefinitionValidator.cs:43:25
             if (mod.Requires != null) {
                 foreach (var (requiredId, fluentVersion) in mod.Requires) {
                     if (!modMap.TryGetValue(requiredId, out var requiredMod)) {
-                        errors.Add($"Mod '{mod.Identifier}' requires mod '{requiredId}', but it is not present.");
+                        ;
                     }
 
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.MultipleErrors; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.MissingRequirement; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.MissingDependencyInSort

[Killed] Equality mutation
src/Railroader.ModManager2/Features/ModDefinitionValidator.cs:46:25
                         errors.Add($"Mod '{mod.Identifier}' requires mod '{requiredId}', but it is not present.");
                     }
 
-                    if (fluentVersion != null && !IsVersionSatisfied(requiredMod!.Version, fluentVersion)) {
+                    if (fluentVersion == null && !IsVersionSatisfied(requiredMod!.Version, fluentVersion)) {
                         errors.Add($"Mod '{mod.Identifier}' requires mod '{requiredId}' with version constraint '{fluentVersion}', but found version '{requiredMod.Version}'.");
                     }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] Statement mutation
src/Railroader.ModManager2/Features/ModDefinitionValidator.cs:47:25
                     }
 
                     if (fluentVersion != null && !IsVersionSatisfied(requiredMod!.Version, fluentVersion)) {
-                        errors.Add($"Mod '{mod.Identifier}' requires mod '{requiredId}' with version constraint '{fluentVersion}', but found version '{requiredMod.Version}'.");
+                        ;
                     }
                 }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] Logical mutation
src/Railroader.ModManager2/Features/ModDefinitionValidator.cs:56:29
             if (mod.ConflictsWith != null) {
                 foreach (var (conflictId, fluentVersion) in mod.ConflictsWith) {
                     if (modMap.TryGetValue(conflictId, out var conflictingMod)) {
-                        if (fluentVersion == null || IsVersionSatisfied(conflictingMod.Version, fluentVersion)) {
+                        if (fluentVersion == null && IsVersionSatisfied(conflictingMod.Version, fluentVersion)) {
                         }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.ConflictWithoutVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.MultipleErrors; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.ConflictDetected

[Killed] Linq method mutation (Reverse() to AsEnumerable())
src/Railroader.ModManager2/Features/ModDefinitionValidator.cs:88:79
         bool Visit(ModDefinition mod, Stack<string> path) {
             if (path.Contains(mod.Identifier)) {
                 path.Push(mod.Identifier);
-                errors.Add($"Cyclic dependency detected: {string.Join(" -> ", path.Reverse())}");
+                errors.Add($"Cyclic dependency detected: {string.Join(" -> ", path.AsEnumerable())}");
                 return false;
             }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.CycleCausingMissingDependency; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.CyclicDependency

[Killed] Statement mutation
src/Railroader.ModManager2/Features/ModDefinitionValidator.cs:88:17
         bool Visit(ModDefinition mod, Stack<string> path) {
             if (path.Contains(mod.Identifier)) {
                 path.Push(mod.Identifier);
-                errors.Add($"Cyclic dependency detected: {string.Join(" -> ", path.Reverse())}");
+                ;
                 return false;
             }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.CycleCausingMissingDependency; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.CyclicDependency

[Killed] Boolean mutation
src/Railroader.ModManager2/Features/ModDefinitionValidator.cs:89:24
             if (path.Contains(mod.Identifier)) {
                 path.Push(mod.Identifier);
                 errors.Add($"Cyclic dependency detected: {string.Join(" -> ", path.Reverse())}");
-                return false;
+                return true;
             }
 
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.CycleCausingMissingDependency

[Killed] Statement mutation
src/Railroader.ModManager2/Features/ModDefinitionValidator.cs:102:25
             if (mod.Requires != null) {
                 foreach (var requiredId in mod.Requires.Keys) {
                     if (invalidMods.Contains(requiredId)) {
-                        errors.Add($"Mod '{mod.Identifier}' cannot resolve mod '{requiredId}' because mod '{requiredId}' is part of a cyclic dependency.");
+                        ;
                     } else if (!Visit(modMap[requiredId]!, path)) {
                         isValid = false;
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.CycleCausingMissingDependency

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager2/Features/ModDefinitionValidator.cs:103:32
                 foreach (var requiredId in mod.Requires.Keys) {
                     if (invalidMods.Contains(requiredId)) {
                         errors.Add($"Mod '{mod.Identifier}' cannot resolve mod '{requiredId}' because mod '{requiredId}' is part of a cyclic dependency.");
-                    } else if (!Visit(modMap[requiredId]!, path)) {
+                    } else if (Visit(modMap[requiredId]!, path)) {
                         isValid = false;
                     }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion
