[Killed] Equality mutation
src/Railroader.ModManager2/Features/PluginManager.cs:36:17
                 continue;
             }
 
-            if (type.BaseType is not { IsGenericType: true } || type.BaseType?.GetGenericTypeDefinition() != typeof(PluginBase<>)) {
+            if (type.BaseType is { IsGenericType: true } || type.BaseType?.GetGenericTypeDefinition() != typeof(PluginBase<>)) {
                 if (typeof(IPlugin).IsAssignableFrom(type)) {
                     logger.Warning("Type {type} inherits IPluginBase but not PluginBase<> in mod {ModId}", type, mod.Definition.Identifier);
killedBy: Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_IgnoreClassesNotDerivedFromPluginBase; Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_IgnorePluginsWithInvalidConstructor; Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_IgnorePluginsWithInvalidConstructor

[Killed] String mutation
src/Railroader.ModManager2/Features/PluginManager.cs:38:36
 
             if (type.BaseType is not { IsGenericType: true } || type.BaseType?.GetGenericTypeDefinition() != typeof(PluginBase<>)) {
                 if (typeof(IPlugin).IsAssignableFrom(type)) {
-                    logger.Warning("Type {type} inherits IPluginBase but not PluginBase<> in mod {ModId}", type, mod.Definition.Identifier);
+                    logger.Warning("", type, mod.Definition.Identifier);
                 }
 
killedBy: Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_IgnoreClassesNotDerivedFromPluginBase_AndWarnIfIPluginBaseIsImplemented
