[Killed] Equality mutation
src/Railroader.ModManager2/JsonConverters/ModReferenceJsonConverter.cs:61:20
 
 
         var (op, skip) = constraint[0] switch {
-            '>' => constraint.Length > 1 && constraint[1] == '=' ? (VersionOperator.GreaterOrEqual, 2) : (VersionOperator.GreaterThan, 1),
+            '>' => constraint.Length >= 1 && constraint[1] == '=' ? (VersionOperator.GreaterOrEqual, 2) : (VersionOperator.GreaterThan, 1),
             '<' => constraint.Length > 1 && constraint[1] == '=' ? (VersionOperator.LessOrEqual, 2) : (VersionOperator.LessThan, 1),
             '=' => (VersionOperator.Equal, 1),
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidJson

[Killed] Equality mutation
src/Railroader.ModManager2/JsonConverters/ModReferenceJsonConverter.cs:62:45
 
         var (op, skip) = constraint[0] switch {
             '>' => constraint.Length > 1 && constraint[1] == '=' ? (VersionOperator.GreaterOrEqual, 2) : (VersionOperator.GreaterThan, 1),
-            '<' => constraint.Length > 1 && constraint[1] == '=' ? (VersionOperator.LessOrEqual, 2) : (VersionOperator.LessThan, 1),
+            '<' => constraint.Length > 1 && constraint[1] != '=' ? (VersionOperator.LessOrEqual, 2) : (VersionOperator.LessThan, 1),
             '=' => (VersionOperator.Equal, 1),
             '0' or '1' or '2' or '3' or '4' or '5' or '6' or '7' or '8' or '9'
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] Logical mutation
src/Railroader.ModManager2/JsonConverters/ModReferenceJsonConverter.cs:64:13
             '>' => constraint.Length > 1 && constraint[1] == '=' ? (VersionOperator.GreaterOrEqual, 2) : (VersionOperator.GreaterThan, 1),
             '<' => constraint.Length > 1 && constraint[1] == '=' ? (VersionOperator.LessOrEqual, 2) : (VersionOperator.LessThan, 1),
             '=' => (VersionOperator.Equal, 1),
-            '0' or '1' or '2' or '3' or '4' or '5' or '6' or '7' or '8' or '9'
+            '0' or '1' and '2' or '3' or '4' or '5' or '6' or '7' or '8' or '9'
                 => (VersionOperator.GreaterOrEqual, 0),
             _ => (VersionOperator.Equal, -1)
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson
