[Killed] String mutation
src/Railroader.ModManager2/JsonConverters/VersionJsonConverter.cs:23:54
 
             var version = ParseString(value);
             if (version == null) {
-                throw new JsonSerializationException($"Invalid version format '{value}'. {Expected}");
+                throw new JsonSerializationException($"");
             }
 
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsVersionJsonConverter.ReadInvalidValue; Railroader.ModManager.Tests.JsonConverters.TestsVersionJsonConverter.ReadInvalidValue
