[Killed] Conditional (true) mutation
Manager/src/Railroader.ModManager2/Mod.cs:52:36
 
     /// <inheritdoc />
     public ILogger CreateLogger(string? scope = null)
-        => logger.ForSourceContext(scope == null ? Definition.Identifier : $"{Definition.Identifier}.{scope}");
+        => logger.ForSourceContext((true?Definition.Identifier :$"{Definition.Identifier}.{scope}"));
 }
killedBy: Railroader.ModManager.Tests.TestsMod.CreateLogger

[Killed] Equality mutation
Manager/src/Railroader.ModManager2/Mod.cs:52:36
 
     /// <inheritdoc />
     public ILogger CreateLogger(string? scope = null)
-        => logger.ForSourceContext(scope == null ? Definition.Identifier : $"{Definition.Identifier}.{scope}");
+        => logger.ForSourceContext(scope != null ? Definition.Identifier : $"{Definition.Identifier}.{scope}");
 }
killedBy: Railroader.ModManager.Tests.TestsMod.CreateLogger; Railroader.ModManager.Tests.TestsMod.CreateLogger
