[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Manager/src/Railroader.ModManager2/ModDefinition.cs:49:65
 
     /// <summary> Gets a value indicating whether this mod definition is valid. </summary>
     [JsonIgnore]
-    public bool IsValid => !string.IsNullOrEmpty(Identifier) && !string.IsNullOrEmpty(Name);
+    public bool IsValid => !string.IsNullOrEmpty(Identifier) && string.IsNullOrEmpty(Name);
 }
 
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_NestedZip_SkipsRootAndExtractsCorrectly; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_ValidZipWithDefinition_ExtractsToCorrectFolder; Railroader.ModManager.Tests.TestsModDefinition.LoadFromInvalidJson_MissingName
