[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/MemoryFileSystem2/Internal/MemoryDirectoryInfo.cs:17:31
 
     public IEnumerable<IFileInfo> EnumerateFiles(string searchPattern, SearchOption searchOption = SearchOption.TopDirectoryOnly) =>
         fileSystem.Enumerate(_Path, searchPattern, searchOption)
-                  .Where(o => !o.IsDirectory)
+                  .Where(o => o.IsDirectory)
                   .Select(o => new MemoryFileInfo(fileSystem, o.Path).Mock());
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.FullName; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.LastWriteTime; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.LastWriteTime_WhenNotFound

[Killed] Statement mutation
src/MemoryFileSystem2/Internal/MemoryDirectoryInfo.cs:22:9
 
     public IDirectoryInfo Mock() {
         var mock = Substitute.For<IDirectoryInfo>();
-        mock.EnumerateFiles(Arg.Any<string>(), Arg.Any<SearchOption>()).Returns(o => EnumerateFiles(o.Arg<string>(), o.Arg<SearchOption>()));
+        ;
         return mock;
     }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.FullName; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.LastWriteTime; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.LastWriteTime_WhenNotFound
