[Killed] Negate expression
src/MemoryFileSystem2/Internal/MemoryFileInfo.cs:14:17
 {
     public DateTime LastWriteTime {
         get {
-            if (fileSystem.Items.TryGetValue(FullName, out var entry) && entry is { IsDirectory: false }) {
+            if (!(fileSystem.Items.TryGetValue(FullName, out var entry) && entry is { IsDirectory: false })) {
                 return entry.LastWriteTime;
             }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.LastWriteTime; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.LastWriteTime_WhenNotFound

[Killed] Block removal mutation
src/MemoryFileSystem2/Internal/MemoryFileInfo.cs:14:107
 {
     public DateTime LastWriteTime {
         get {
-            if (fileSystem.Items.TryGetValue(FullName, out var entry) && entry is { IsDirectory: false }) {
-                return entry.LastWriteTime;
-            }
+            if (fileSystem.Items.TryGetValue(FullName, out var entry) && entry is { IsDirectory: false }) {}
 
             throw new FileNotFoundException($"File not found: {FullName}");
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.LastWriteTime

[Killed] Statement mutation
src/MemoryFileSystem2/Internal/MemoryFileInfo.cs:18:13
                 return entry.LastWriteTime;
             }
 
-            throw new FileNotFoundException($"File not found: {FullName}");
+            ;
         }
     }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.LastWriteTime_WhenNotFound

[Killed] Statement mutation
src/MemoryFileSystem2/Internal/MemoryFileInfo.cs:26:9
 
     public void MoveTo(string destFileName) {
         destFileName = fileSystem.NormalizePath(destFileName);
-        fileSystem.File.Move(FullName, destFileName);
+        ;
         FullName = destFileName;
     }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.MoveTo

[Killed] Statement mutation
src/MemoryFileSystem2/Internal/MemoryFileInfo.cs:32:9
 
     public IFileInfo Mock() {
         var mock = Substitute.For<IFileInfo>();
-        mock.FullName.Returns(_ => FullName);
+        ;
         mock.LastWriteTime.Returns(_ => LastWriteTime);
         mock.When(o => o.MoveTo(Arg.Any<string>())).Do(o => MoveTo(o.Arg<string>()));
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.FullName; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesDirectoryInfo.EnumerateFiles

[Killed] Statement mutation
src/MemoryFileSystem2/Internal/MemoryFileInfo.cs:33:9
     public IFileInfo Mock() {
         var mock = Substitute.For<IFileInfo>();
         mock.FullName.Returns(_ => FullName);
-        mock.LastWriteTime.Returns(_ => LastWriteTime);
+        ;
         mock.When(o => o.MoveTo(Arg.Any<string>())).Do(o => MoveTo(o.Arg<string>()));
         return mock;
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.LastWriteTime; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.LastWriteTime_WhenNotFound

[Killed] Statement mutation
src/MemoryFileSystem2/Internal/MemoryFileInfo.cs:34:9
         var mock = Substitute.For<IFileInfo>();
         mock.FullName.Returns(_ => FullName);
         mock.LastWriteTime.Returns(_ => LastWriteTime);
-        mock.When(o => o.MoveTo(Arg.Any<string>())).Do(o => MoveTo(o.Arg<string>()));
+        ;
         return mock;
     }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.MoveTo
