[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/MemoryFileSystem2/Internal/MemoryZipArchive.cs:15:25
 {
     public IReadOnlyCollection<IZipArchiveEntry> Entries { get; } =
         memoryZip
-            .Where(e => !e.IsDirectory)
+            .Where(e => e.IsDirectory)
             .Select(o => new MemoryZipArchiveEntry(o).Mock())
             .ToArray();
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ReturnsCorrectZipArchive

[Killed] Equality mutation
src/MemoryFileSystem2/Internal/MemoryZipArchive.cs:19:88
             .Select(o => new MemoryZipArchiveEntry(o).Mock())
             .ToArray();
 
-    public IZipArchiveEntry? GetEntry(string entryName) => Entries.FirstOrDefault(e => e.FullName == entryName);
+    public IZipArchiveEntry? GetEntry(string entryName) => Entries.FirstOrDefault(e => e.FullName != entryName);
 
     [ExcludeFromCodeCoverage]
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ReturnsCorrectZipArchive

[Survived] Linq method mutation (FirstOrDefault() to First())
src/MemoryFileSystem2/Internal/MemoryZipArchive.cs:19:60
             .Select(o => new MemoryZipArchiveEntry(o).Mock())
             .ToArray();
 
-    public IZipArchiveEntry? GetEntry(string entryName) => Entries.FirstOrDefault(e => e.FullName == entryName);
+    public IZipArchiveEntry? GetEntry(string entryName) => Entries.First(e => e.FullName == entryName);
 
     [ExcludeFromCodeCoverage]

[Killed] Statement mutation
src/MemoryFileSystem2/Internal/MemoryZipArchive.cs:27:9
 
     public IZipArchive Mock() {
         var mock = Substitute.For<IZipArchive>();
-        mock.Entries.Returns(_ => Entries);
+        ;
         mock.GetEntry(Arg.Any<string>()).Returns(o => GetEntry(o.Arg<string>()));
         return mock;
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ReturnsCorrectZipArchive

[Killed] Statement mutation
src/MemoryFileSystem2/Internal/MemoryZipArchive.cs:28:9
     public IZipArchive Mock() {
         var mock = Substitute.For<IZipArchive>();
         mock.Entries.Returns(_ => Entries);
-        mock.GetEntry(Arg.Any<string>()).Returns(o => GetEntry(o.Arg<string>()));
+        ;
         return mock;
     }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ReturnsCorrectZipArchive
