[Killed] Negate expression
Manager/src/MemoryFileSystem2/MemoryFileSystem.Add.cs:24:13
     public void Add(MemoryEntry entry) {
         entry = entry with { Path = NormalizePath(entry.Path) };
 
-        if (Items.ContainsKey(entry.Path)) {
+        if (!(Items.ContainsKey(entry.Path))) {
             throw new InvalidOperationException($"Path '{entry.Path}' already exists.");
         }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesDirectoryInfo.EnumerateFiles; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenSourceLocked; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.GetLastWriteTime_ThrowsWhenNotFoundOrDirectory

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Add.cs:25:13
         entry = entry with { Path = NormalizePath(entry.Path) };
 
         if (Items.ContainsKey(entry.Path)) {
-            throw new InvalidOperationException($"Path '{entry.Path}' already exists.");
+            ;
         }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Create_WhenAddThrows; MemoryFileSystem2.Tests.TestsMemoryFileSystemAdd.Add_Duplicate_Throws

[Killed] Equality mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Add.cs:29:13
         }
 
         var path = GetParentPath(entry.Path);
-        if (path != null) {
+        if (path == null) {
             VerifyParents(path, entry.LastWriteTime);
         }
killedBy: MemoryFileSystem2.Tests.TestsMemoryZip.Constructor_DeserializeEntriesFromByteArray; MemoryFileSystem2.Tests.TestsMemoryFileSystemAdd.Add_Throws_WhenCannotAddParents; MemoryFileSystem2.Tests.TestsMemoryFileSystemAdd.AddRange_AddsINCorrectOrder

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Add.cs:30:13
 
         var path = GetParentPath(entry.Path);
         if (path != null) {
-            VerifyParents(path, entry.LastWriteTime);
+            ;
         }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemAdd.Add_Throws_WhenCannotAddParents; MemoryFileSystem2.Tests.TestsMemoryFileSystemAdd.AddRange_AddsINCorrectOrder; MemoryFileSystem2.Tests.TestsMemoryFileSystemAdd.Add_AddParents

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Add.cs:33:9
             VerifyParents(path, entry.LastWriteTime);
         }
 
-        Items.TryAdd(entry.Path, entry);
+        ;
     }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemBase.Enumerate_TopDirectoryOnly_MatchesPattern

[Killed] Linq method mutation (OrderBy() to OrderByDescending())
Manager/src/MemoryFileSystem2/MemoryFileSystem.Add.cs:37:31
     }
 
     public void AddRange(IEnumerable<MemoryEntry> entries) {
-        foreach (var entry in entries
-                              .Select(o => o with { Path = NormalizePath(o.Path) })
-                              .OrderBy(o => o.Path.Length)) {
+        foreach (var entry in entries
+                              .Select(o => o with { Path = NormalizePath(o.Path) })
+                              .OrderByDescending(o => o.Path.Length)) {
             Add(entry);
         }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemAdd.AddRange_AddsINCorrectOrder

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Add.cs:40:13
         foreach (var entry in entries
                               .Select(o => o with { Path = NormalizePath(o.Path) })
                               .OrderBy(o => o.Path.Length)) {
-            Add(entry);
+            ;
         }
     }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemAdd.AddRange_AddsINCorrectOrder
