[Killed] Linq method mutation (OrderBy() to OrderByDescending())
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:17:56
     [ExcludeFromCodeCoverage]
     IEnumerator IEnumerable.GetEnumerator() => GetEnumerator();
 
-    public IEnumerator<MemoryEntry> GetEnumerator() => Items.Values.OrderBy(o => o.Path).GetEnumerator();
+    public IEnumerator<MemoryEntry> GetEnumerator() => Items.Values.OrderByDescending(o => o.Path).GetEnumerator();
 
     public EntryDictionary Items { get; } = new();
killedBy: MemoryFileSystem2.Tests.TestsMemoryFs.Constructor_SetCurrentDirectoryAddsAlParents

[Killed] CoalesceAssignmentExpression to SimpleAssignmentExpression mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:24:9
     protected abstract string? GetParentPath(string path);
 
     protected void VerifyParents(string folderPath, DateTime? lastWriteTime = null) {
-        lastWriteTime ??= MemoryEntry.DefaultLastWriteTime;
+        lastWriteTime = MemoryEntry.DefaultLastWriteTime;
         var paths = new Stack<string>();
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemAdd.Add_UpdateParentsLastWriteTime

[Killed] Equality mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:28:37
         var paths = new Stack<string>();
 
         var current = folderPath;
-        while (current is { Length: > 0 }) {
+        while (current is { Length: >= 0 }) {
             paths.Push(current);
             current = Path.GetDirectoryName(current);
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ReturnsCorrectZipArchive; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractNestedZipFile_CreatesCorrectEntries; MemoryFileSystem2.Tests.TestsMemoryZip.Constructor_DeserializeEntriesFromByteArray

[Killed] Equality mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:28:16
         var paths = new Stack<string>();
 
         var current = folderPath;
-        while (current is { Length: > 0 }) {
+        while (current is not { Length: > 0 }) {
             paths.Push(current);
             current = Path.GetDirectoryName(current);
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractNestedZipFile_CreatesCorrectEntries; MemoryFileSystem2.Tests.TestsMemoryZip.Constructor_DeserializeEntriesFromByteArray

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:29:13
 
         var current = folderPath;
         while (current is { Length: > 0 }) {
-            paths.Push(current);
+            ;
             current = Path.GetDirectoryName(current);
         }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractNestedZipFile_CreatesCorrectEntries; MemoryFileSystem2.Tests.TestsMemoryZip.Constructor_DeserializeEntriesFromByteArray

[Killed] Negate expression
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:33:16
             current = Path.GetDirectoryName(current);
         }
 
-        while (paths.Any()) {
+        while (!(paths.Any())) {
             var directoryPath = paths.Pop()!;
             if (Items.TryGetValue(directoryPath, out var directoryEntry)) {
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemAdd.Add_Directory; MemoryFileSystem2.Tests.TestsMemoryFileSystemAdd.Add_Throws_WhenCannotAddParents; MemoryFileSystem2.Tests.TestsMemoryFileSystemAdd.AddRange_AddsINCorrectOrder

[Killed] Negate expression
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:35:17
 
         while (paths.Any()) {
             var directoryPath = paths.Pop()!;
-            if (Items.TryGetValue(directoryPath, out var directoryEntry)) {
+            if (!(Items.TryGetValue(directoryPath, out var directoryEntry))) {
                 if (directoryEntry is not { IsDirectory: true }) {
                     throw new InvalidOperationException($"Path '{directoryPath}' is a file, not a directory.");
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenSourceLocked; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.GetLastWriteTime_ThrowsWhenNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.GetLastWriteTime_ThrowsWhenNotFoundOrDirectory

[Killed] Equality mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:36:21
         while (paths.Any()) {
             var directoryPath = paths.Pop()!;
             if (Items.TryGetValue(directoryPath, out var directoryEntry)) {
-                if (directoryEntry is not { IsDirectory: true }) {
+                if (directoryEntry is { IsDirectory: true }) {
                     throw new InvalidOperationException($"Path '{directoryPath}' is a file, not a directory.");
                 }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenSourceLocked; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.GetLastWriteTime_ThrowsWhenNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_WhenValid

[Killed] Boolean mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:36:58
         while (paths.Any()) {
             var directoryPath = paths.Pop()!;
             if (Items.TryGetValue(directoryPath, out var directoryEntry)) {
-                if (directoryEntry is not { IsDirectory: true }) {
+                if (directoryEntry is not { IsDirectory: false }) {
                     throw new InvalidOperationException($"Path '{directoryPath}' is a file, not a directory.");
                 }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemAdd.Add_Throws_WhenCannotAddParents; MemoryFileSystem2.Tests.TestsMemoryFileSystemAdd.AddRange_AddsINCorrectOrder

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:37:21
             var directoryPath = paths.Pop()!;
             if (Items.TryGetValue(directoryPath, out var directoryEntry)) {
                 if (directoryEntry is not { IsDirectory: true }) {
-                    throw new InvalidOperationException($"Path '{directoryPath}' is a file, not a directory.");
+                    ;
                 }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemAdd.Add_Throws_WhenCannotAddParents

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:42:17
 
                 Items[directoryPath] = directoryEntry with { LastWriteTime = lastWriteTime.Value };
             } else {
-                Items.TryAdd(directoryPath, new MemoryEntry(directoryPath, lastWriteTime.Value));
+                ;
             }
         }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemAdd.AddRange_AddsINCorrectOrder; MemoryFileSystem2.Tests.TestsMemoryFileSystemAdd.Add_AddParents; MemoryFileSystem2.Tests.TestsMemoryFileSystemAdd.Add_UpdateParentsLastWriteTime

[Killed] Boolean mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:49:56
 
     public abstract string NormalizePath(string path);
 
-    public void LockFile(string path) => SetLock(path, true);
+    public void LockFile(string path) => SetLock(path, false);
 
     public void UnlockFile(string path) => SetLock(path, false);
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemBase.LockFile; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenSourceLocked; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Delete_ThrowsWhenLocked

[Killed] Boolean mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:51:58
 
     public void LockFile(string path) => SetLock(path, true);
 
-    public void UnlockFile(string path) => SetLock(path, false);
+    public void UnlockFile(string path) => SetLock(path, true);
 
     private void SetLock(string path, bool locked) {
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemBase.UnlockFile

[Killed] Block removal mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:53:52
 
     public void UnlockFile(string path) => SetLock(path, false);
 
-    private void SetLock(string path, bool locked) {
-        path = NormalizePath(path);
-        Items[path] = Items[path]! with { Locked = locked };
-    }
+    private void SetLock(string path, bool locked) {}
 
     private static Regex ToRegex(string searchPattern) {
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemBase.UnlockFile; MemoryFileSystem2.Tests.TestsMemoryFileSystemBase.LockFile; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenSourceLocked

[Killed] Logical mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:60:36
 
     private static Regex ToRegex(string searchPattern) {
         var invalidPathChars = Path.GetInvalidFileNameChars();
-        if (searchPattern.Any(o => (o != '?') & (o != '*') && invalidPathChars.Contains(o))) {
+        if (searchPattern.Any(o => (o != '?') & (o != '*') || invalidPathChars.Contains(o))) {
             throw new ArgumentException("Invalid search pattern.");
         }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesDirectory.EnumerateDirectories

[Killed] Bitwise mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:60:36
 
     private static Regex ToRegex(string searchPattern) {
         var invalidPathChars = Path.GetInvalidFileNameChars();
-        if (searchPattern.Any(o => (o != '?') & (o != '*') && invalidPathChars.Contains(o))) {
+        if (searchPattern.Any(o => (o != '?') | (o != '*') && invalidPathChars.Contains(o))) {
             throw new ArgumentException("Invalid search pattern.");
         }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.FullName; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.LastWriteTime; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.LastWriteTime_WhenNotFound

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:61:13
     private static Regex ToRegex(string searchPattern) {
         var invalidPathChars = Path.GetInvalidFileNameChars();
         if (searchPattern.Any(o => (o != '?') & (o != '*') && invalidPathChars.Contains(o))) {
-            throw new ArgumentException("Invalid search pattern.");
+            ;
         }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemBase.Enumerate_InvalidSearchPattern_ThrowsArgumentException

[Killed] Conditional (false) mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:64:28
             throw new ArgumentException("Invalid search pattern.");
         }
 
-        var regexPattern = searchPattern == "*.*"
-            ? $"[^{Path.DirectorySeparatorChar}{Path.AltDirectorySeparatorChar}]*"
-            : Regex.Escape(searchPattern).Replace("\\*", ".*").Replace("\\?", ".");
+        var regexPattern = (false?$"[^{Path.DirectorySeparatorChar}{Path.AltDirectorySeparatorChar}]*"
+:Regex.Escape(searchPattern).Replace("\\*", ".*").Replace("\\?", "."));
 
         return new Regex("^" + regexPattern + "$", RegexOptions.IgnoreCase);
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemBase.Enumerate_WildcardPattern_MatchesAllFiles; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesDirectory.EnumerateDirectories

[Killed] Equality mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:64:28
             throw new ArgumentException("Invalid search pattern.");
         }
 
-        var regexPattern = searchPattern == "*.*"
+        var regexPattern = searchPattern != "*.*"
             ? $"[^{Path.DirectorySeparatorChar}{Path.AltDirectorySeparatorChar}]*"
             : Regex.Escape(searchPattern).Replace("\\*", ".*").Replace("\\?", ".");
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesDirectory.EnumerateDirectories

[Killed] String mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:68:47
             ? $"[^{Path.DirectorySeparatorChar}{Path.AltDirectorySeparatorChar}]*"
             : Regex.Escape(searchPattern).Replace("\\*", ".*").Replace("\\?", ".");
 
-        return new Regex("^" + regexPattern + "$", RegexOptions.IgnoreCase);
+        return new Regex("^" + regexPattern + "", RegexOptions.IgnoreCase);
     }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemBase.Enumerate_SpecificWildcardPatterns_MatchesCorrectly

[Killed] Equality mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:83:34
         // _Items.Keys = [@"C:\Test", @"C:\Test\Dir1", @"C:\Test\Dir2", @"C:\Test\File1.txt", @"C:\Test\Dir3", @"C:\Test\Dir3\SubDir", @"C:\Test\Dir3\File2.txt" ]
 
         // filter out 'self'
-        query = query.Where(o => o.Key.Length > path.Length);
+        query = query.Where(o => o.Key.Length < path.Length);
 
         // _Items.Keys = [ @"C:\Test\Dir1", @"C:\Test\Dir2", @"C:\Test\File1.txt", @"C:\Test\Dir3", @"C:\Test\Dir3\SubDir", @"C:\Test\Dir3\File2.txt" ]
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.FullName; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.LastWriteTime; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.LastWriteTime_WhenNotFound

[Killed] Equality mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:83:34
         // _Items.Keys = [@"C:\Test", @"C:\Test\Dir1", @"C:\Test\Dir2", @"C:\Test\File1.txt", @"C:\Test\Dir3", @"C:\Test\Dir3\SubDir", @"C:\Test\Dir3\File2.txt" ]
 
         // filter out 'self'
-        query = query.Where(o => o.Key.Length > path.Length);
+        query = query.Where(o => o.Key.Length >= path.Length);
 
         // _Items.Keys = [ @"C:\Test\Dir1", @"C:\Test\Dir2", @"C:\Test\File1.txt", @"C:\Test\Dir3", @"C:\Test\Dir3\SubDir", @"C:\Test\Dir3\File2.txt" ]
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesDirectory.EnumerateDirectories; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesDirectoryInfo.EnumerateFiles; MemoryFileSystem2.Tests.TestsMemoryFileSystemBase.Enumerate_TopDirectoryOnly_MatchesPattern

[Killed] Equality mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:86:13
         query = query.Where(o => o.Key.Length > path.Length);
 
         // _Items.Keys = [ @"C:\Test\Dir1", @"C:\Test\Dir2", @"C:\Test\File1.txt", @"C:\Test\Dir3", @"C:\Test\Dir3\SubDir", @"C:\Test\Dir3\File2.txt" ]
-        if (searchOption == SearchOption.TopDirectoryOnly) {
+        if (searchOption != SearchOption.TopDirectoryOnly) {
             // filter out nested entries
             query = query.Where(o => {
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemBase.Enumerate_TopDirectoryOnly_MatchesPattern; MemoryFileSystem2.Tests.TestsMemoryFileSystemBase.Enumerate_AllDirectories_MatchesPattern

[Killed] Arithmetic mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:90:109
             // filter out nested entries
             query = query.Where(o => {
                 // o.Key one of = [ @"C:\Test\Dir1", @"C:\Test\Dir2", @"C:\Test\File1.txt", @"C:\Test\Dir3", @"C:\Test\Dir3\SubDir", @"C:\Test\Dir3\File2.txt" ]
-                var index = o.Key.IndexOfAny([Path.DirectorySeparatorChar, Path.AltDirectorySeparatorChar], path.Length + 1);
+                var index = o.Key.IndexOfAny([Path.DirectorySeparatorChar, Path.AltDirectorySeparatorChar], path.Length - 1);
                 if (index == -1) {
                     // o.Key one of [ @"C:\Test\Dir1", @"C:\Test\Dir2", @"C:\Test\File1.txt", @"C:\Test\Dir3" ]
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemBase.Enumerate_TopDirectoryOnly_MatchesPattern; MemoryFileSystem2.Tests.TestsMemoryFileSystemBase.Enumerate_SpecificWildcardPatterns_MatchesCorrectly; MemoryFileSystem2.Tests.TestsMemoryFileSystemBase.Enumerate_WildcardPattern_MatchesAllFiles

[Killed] Equality mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:91:21
             query = query.Where(o => {
                 // o.Key one of = [ @"C:\Test\Dir1", @"C:\Test\Dir2", @"C:\Test\File1.txt", @"C:\Test\Dir3", @"C:\Test\Dir3\SubDir", @"C:\Test\Dir3\File2.txt" ]
                 var index = o.Key.IndexOfAny([Path.DirectorySeparatorChar, Path.AltDirectorySeparatorChar], path.Length + 1);
-                if (index == -1) {
+                if (index != -1) {
                     // o.Key one of [ @"C:\Test\Dir1", @"C:\Test\Dir2", @"C:\Test\File1.txt", @"C:\Test\Dir3" ]
                     return true;
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemBase.Enumerate_TopDirectoryOnly_MatchesPattern

[Killed] UnaryMinusExpression to UnaryPlusExpression mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:91:30
             query = query.Where(o => {
                 // o.Key one of = [ @"C:\Test\Dir1", @"C:\Test\Dir2", @"C:\Test\File1.txt", @"C:\Test\Dir3", @"C:\Test\Dir3\SubDir", @"C:\Test\Dir3\File2.txt" ]
                 var index = o.Key.IndexOfAny([Path.DirectorySeparatorChar, Path.AltDirectorySeparatorChar], path.Length + 1);
-                if (index == -1) {
+                if (index == +1) {
                     // o.Key one of [ @"C:\Test\Dir1", @"C:\Test\Dir2", @"C:\Test\File1.txt", @"C:\Test\Dir3" ]
                     return true;
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesDirectoryInfo.EnumerateFiles; MemoryFileSystem2.Tests.TestsMemoryFileSystemBase.Enumerate_TopDirectoryOnly_MatchesPattern; MemoryFileSystem2.Tests.TestsMemoryFileSystemBase.Enumerate_SpecificWildcardPatterns_MatchesCorrectly

[Killed] Boolean mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:93:28
                 var index = o.Key.IndexOfAny([Path.DirectorySeparatorChar, Path.AltDirectorySeparatorChar], path.Length + 1);
                 if (index == -1) {
                     // o.Key one of [ @"C:\Test\Dir1", @"C:\Test\Dir2", @"C:\Test\File1.txt", @"C:\Test\Dir3" ]
-                    return true;
+                    return false;
                 }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.FullName; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.LastWriteTime; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.LastWriteTime_WhenNotFound

[Killed] Boolean mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:97:24
                 }
 
                 // o.Key one of [ @"C:\Test\Dir3\SubDir", @"C:\Test\Dir3\File2.txt" ]
-                return false;
+                return true;
             });
         }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemBase.Enumerate_TopDirectoryOnly_MatchesPattern

[Killed] Linq method mutation (OrderBy() to OrderByDescending())
Manager/src/MemoryFileSystem2/MemoryFileSystem.cs:106:16
         // filter out files that do not match pattern
         query = query.Where(o => regex.IsMatch(Path.GetFileName(o.Key)));
 
-        return query.Select(o => o.Value).OrderBy(o => o!.Path);
+        return query.Select(o => o.Value).OrderByDescending(o => o!.Path);
     }
 }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemBase.Enumerate_AllDirectories_MatchesPattern; MemoryFileSystem2.Tests.TestsMemoryFileSystemBase.Enumerate_WildcardPattern_MatchesAllFiles; MemoryFileSystem2.Tests.TestsMemoryFileSystemBase.Enumerate_CaseInsensitivePathAndPattern_MatchesCorrectly
