[Survived] CoalesceAssignmentExpression to SimpleAssignmentExpression mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.Directory.cs:24:22
 
     EnumerateDirectories IDirectory.EnumerateDirectories {
         [DebuggerStepThrough]
-        get { return _EnumerateDirectories ??= CreateEnumerateDirectories(); }
+        get { return _EnumerateDirectories = CreateEnumerateDirectories(); }
     }
 

[Survived] CoalesceAssignmentExpression to SimpleAssignmentExpression mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.Directory.cs:29:22
 
     GetCurrentDirectory IDirectory.GetCurrentDirectory {
         [DebuggerStepThrough]
-        get { return _GetCurrentDirectory ??= CreateGetCurrentDirectory(); }
+        get { return _GetCurrentDirectory = CreateGetCurrentDirectory(); }
     }
 

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.Directory.cs:34:9
 
     private EnumerateDirectories CreateEnumerateDirectories() {
         var mock = Substitute.For<EnumerateDirectories>();
-        mock.Invoke(Arg.Any<string>()).Returns(o => Enumerate(o.Arg<string>(), "*.*").Where(p => p.IsDirectory).Select(p => p.Path));
+        ;
         return mock;
     }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesDirectory.EnumerateDirectories

[Killed] String mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.Directory.cs:34:80
 
     private EnumerateDirectories CreateEnumerateDirectories() {
         var mock = Substitute.For<EnumerateDirectories>();
-        mock.Invoke(Arg.Any<string>()).Returns(o => Enumerate(o.Arg<string>(), "*.*").Where(p => p.IsDirectory).Select(p => p.Path));
+        mock.Invoke(Arg.Any<string>()).Returns(o => Enumerate(o.Arg<string>(), "").Where(p => p.IsDirectory).Select(p => p.Path));
         return mock;
     }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesDirectory.EnumerateDirectories

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.Directory.cs:40:9
 
     private GetCurrentDirectory CreateGetCurrentDirectory() {
         var mock = Substitute.For<GetCurrentDirectory>();
-        mock.Invoke().Returns(_ => this is MemoryFs memoryFs
-            ? memoryFs.CurrentDirectory
-            : throw new InvalidOperationException($"Only {typeof(MemoryFs)} supports concept of '{nameof(MemoryFs.CurrentDirectory)}'."));
+        ;
         return mock;
     }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesDirectory.GetCurrentDirectory_ThrowsForNonMemoryFs; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesDirectory.GetCurrentDirectory_ReturnsMemoryFsCurrentDirectory
