[Killed] Block removal mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.DirectoryInfo.cs:11:13
 {
     public DirectoryInfoFactory DirectoryInfo {
         [DebuggerStepThrough]
-        get { return path => new MemoryDirectoryInfo(this, path).Mock(); }
+        get {}
     }
 }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.FullName; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.LastWriteTime; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.LastWriteTime_WhenNotFound
