[Survived] CoalesceAssignmentExpression to SimpleAssignmentExpression mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:36:16
 
     Exists IFile.Exists {
         [DebuggerStepThrough]
-        get => _Exists ??= CreateExists();
+        get => _Exists = CreateExists();
     }
 

[Survived] CoalesceAssignmentExpression to SimpleAssignmentExpression mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:41:22
 
     ReadAllText IFile.ReadAllText {
         [DebuggerStepThrough]
-        get { return _ReadAllText ??= CreateReadAllText(); }
+        get { return _ReadAllText = CreateReadAllText(); }
     }
 

[Survived] CoalesceAssignmentExpression to SimpleAssignmentExpression mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:46:22
 
     GetLastWriteTime IFile.GetLastWriteTime {
         [DebuggerStepThrough]
-        get { return _GetLastWriteTime ??= CreateGetLastWriteTime(); }
+        get { return _GetLastWriteTime = CreateGetLastWriteTime(); }
     }
 

[Survived] CoalesceAssignmentExpression to SimpleAssignmentExpression mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:51:22
 
     Delete IFile.Delete {
         [DebuggerStepThrough]
-        get { return _Delete ??= CreateDelete(); }
+        get { return _Delete = CreateDelete(); }
     }
 

[Survived] CoalesceAssignmentExpression to SimpleAssignmentExpression mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:56:22
 
     Move IFile.Move {
         [DebuggerStepThrough]
-        get { return _Move ??= CreateMove(); }
+        get { return _Move = CreateMove(); }
     }
 

[Survived] CoalesceAssignmentExpression to SimpleAssignmentExpression mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:61:22
 
     Create IFile.Create {
         [DebuggerStepThrough]
-        get { return _Create ??= CreateCreate(); }
+        get { return _Create = CreateCreate(); }
     }
 

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:66:9
 
     private Exists CreateExists() {
         var mock = Substitute.For<Exists>();
-        mock.Invoke(Arg.Any<string>())
-            .Returns([DebuggerStepThrough](o) => Items.TryGetValue(NormalizePath(o.Arg<string>()), out var entry) && entry is { IsDirectory: false });
+        ;
         return mock;
     }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Exists

[Killed] Boolean mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:67:142
     private Exists CreateExists() {
         var mock = Substitute.For<Exists>();
         mock.Invoke(Arg.Any<string>())
-            .Returns([DebuggerStepThrough](o) => Items.TryGetValue(NormalizePath(o.Arg<string>()), out var entry) && entry is { IsDirectory: false });
+            .Returns([DebuggerStepThrough](o) => Items.TryGetValue(NormalizePath(o.Arg<string>()), out var entry) && entry is { IsDirectory: true });
         return mock;
     }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Exists; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Exists

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:73:9
 
     private ReadAllText CreateReadAllText() {
         var mock = Substitute.For<ReadAllText>();
-        mock.Invoke(Arg.Any<string>()).Returns(o => {
-            var path = NormalizePath(o.Arg<string>());
-            if (!Items.TryGetValue(path, out var entry) || entry is not { IsDirectory: false }) {
-                throw new FileNotFoundException($"File not found: {path}");
-            }
-
-            if (entry.ReadException != null) {
-                throw entry.ReadException;
-            }
-
-            return Encoding.UTF8.GetString(entry.ExistingContent);
-        });
+        ;
         return mock;
     }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_WhenValid; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_ThrowsWhenNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_ThrowsWhenNotFoundOrDirectory

[Killed] Negate expression
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:75:17
         var mock = Substitute.For<ReadAllText>();
         mock.Invoke(Arg.Any<string>()).Returns(o => {
             var path = NormalizePath(o.Arg<string>());
-            if (!Items.TryGetValue(path, out var entry) || entry is not { IsDirectory: false }) {
+            if (!(!Items.TryGetValue(path, out var entry) || entry is not { IsDirectory: false })) {
                 throw new FileNotFoundException($"File not found: {path}");
             }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_WhenValid; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_ThrowsWhenNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_ThrowsWhenNotFoundOrDirectory

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:75:17
         var mock = Substitute.For<ReadAllText>();
         mock.Invoke(Arg.Any<string>()).Returns(o => {
             var path = NormalizePath(o.Arg<string>());
-            if (!Items.TryGetValue(path, out var entry) || entry is not { IsDirectory: false }) {
+            if (Items.TryGetValue(path, out var entry) || entry is not { IsDirectory: false }) {
                 throw new FileNotFoundException($"File not found: {path}");
             }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_WhenValid; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_ThrowsWhenException

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:76:17
         mock.Invoke(Arg.Any<string>()).Returns(o => {
             var path = NormalizePath(o.Arg<string>());
             if (!Items.TryGetValue(path, out var entry) || entry is not { IsDirectory: false }) {
-                throw new FileNotFoundException($"File not found: {path}");
+                ;
             }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_ThrowsWhenNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_ThrowsWhenNotFoundOrDirectory

[Killed] Equality mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:79:17
                 throw new FileNotFoundException($"File not found: {path}");
             }
 
-            if (entry.ReadException != null) {
+            if (entry.ReadException == null) {
                 throw entry.ReadException;
             }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_WhenValid; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_ThrowsWhenException

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:80:17
             }
 
             if (entry.ReadException != null) {
-                throw entry.ReadException;
+                ;
             }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_ThrowsWhenException

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:90:9
 
     private GetLastWriteTime CreateGetLastWriteTime() {
         var mock = Substitute.For<GetLastWriteTime>();
-        mock.Invoke(Arg.Any<string>()).Returns(o => {
-            var path = NormalizePath(o.Arg<string>());
-            if (Items.TryGetValue(path, out var entry) && entry is { IsDirectory: false }) {
-                return entry.LastWriteTime;
-            }
-
-            throw new FileNotFoundException($"File not found: {path}");
-        });
+        ;
 
         return mock;
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.GetLastWriteTime_ThrowsWhenNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.GetLastWriteTime_ThrowsWhenNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.GetLastWriteTime_WhenValid

[Killed] Logical mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:92:17
         var mock = Substitute.For<GetLastWriteTime>();
         mock.Invoke(Arg.Any<string>()).Returns(o => {
             var path = NormalizePath(o.Arg<string>());
-            if (Items.TryGetValue(path, out var entry) && entry is { IsDirectory: false }) {
+            if (Items.TryGetValue(path, out var entry) || entry is { IsDirectory: false }) {
                 return entry.LastWriteTime;
             }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.GetLastWriteTime_ThrowsWhenNotFoundOrDirectory

[Killed] Negate expression
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:92:17
         var mock = Substitute.For<GetLastWriteTime>();
         mock.Invoke(Arg.Any<string>()).Returns(o => {
             var path = NormalizePath(o.Arg<string>());
-            if (Items.TryGetValue(path, out var entry) && entry is { IsDirectory: false }) {
+            if (!(Items.TryGetValue(path, out var entry) && entry is { IsDirectory: false })) {
                 return entry.LastWriteTime;
             }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.GetLastWriteTime_ThrowsWhenNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.GetLastWriteTime_ThrowsWhenNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.GetLastWriteTime_WhenValid

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:96:13
                 return entry.LastWriteTime;
             }
 
-            throw new FileNotFoundException($"File not found: {path}");
+            ;
         });
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.GetLastWriteTime_ThrowsWhenNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.GetLastWriteTime_ThrowsWhenNotFoundOrDirectory

[Killed] String mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:96:45
                 return entry.LastWriteTime;
             }
 
-            throw new FileNotFoundException($"File not found: {path}");
+            throw new FileNotFoundException($"");
         });
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.GetLastWriteTime_ThrowsWhenNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.GetLastWriteTime_ThrowsWhenNotFoundOrDirectory

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:104:9
 
     private Delete CreateDelete() {
         var mock = Substitute.For<Delete>();
-        mock.When(o => o.Invoke(Arg.Any<string>()))
-            .Do(o => {
-                var path = NormalizePath(o.Arg<string>());
-                if (!Items.TryGetValue(path, out var entry)) {
-                    return;
-                }
-
-                if (entry.IsDirectory) {
-                    throw new InvalidOperationException($"Entry at {path} is directory.");
-                }
-
-                entry.CheckLock();
-
-                Items.TryRemove(path, out _);
-            });
+        ;
 
         return mock;
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Delete_ThrowsWhenDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Delete_ThrowsWhenLocked; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Delete_WhenValid

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:107:21
         mock.When(o => o.Invoke(Arg.Any<string>()))
             .Do(o => {
                 var path = NormalizePath(o.Arg<string>());
-                if (!Items.TryGetValue(path, out var entry)) {
+                if (Items.TryGetValue(path, out var entry)) {
                     return;
                 }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Delete_ThrowsWhenDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Delete_ThrowsWhenLocked; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Delete_DoNothingWhenNotFound

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:108:21
             .Do(o => {
                 var path = NormalizePath(o.Arg<string>());
                 if (!Items.TryGetValue(path, out var entry)) {
-                    return;
+                    ;
                 }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Delete_DoNothingWhenNotFound

[Killed] Negate expression
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:111:21
                     return;
                 }
 
-                if (entry.IsDirectory) {
+                if (!(entry.IsDirectory)) {
                     throw new InvalidOperationException($"Entry at {path} is directory.");
                 }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Delete_ThrowsWhenDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Delete_ThrowsWhenLocked; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Delete_WhenValid

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:112:21
                 }
 
                 if (entry.IsDirectory) {
-                    throw new InvalidOperationException($"Entry at {path} is directory.");
+                    ;
                 }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Delete_ThrowsWhenDirectory

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:115:17
                     throw new InvalidOperationException($"Entry at {path} is directory.");
                 }
 
-                entry.CheckLock();
+                ;
 
                 Items.TryRemove(path, out _);
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Delete_ThrowsWhenLocked

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:127:9
 
     private Move CreateMove() {
         var mock = Substitute.For<Move>();
-        mock.When(o => o.Invoke(Arg.Any<string>(), Arg.Any<string>()))
-            .Do(o => {
-                var sourceFileName = NormalizePath(o.ArgAt<string>(0));
-                var destFileName   = NormalizePath(o.ArgAt<string>(1));
-
-                lock (_MoveLock) {
-                    if (!Items.TryGetValue(sourceFileName, out var sourceFile) || sourceFile is not { IsDirectory: false }) {
-                        throw new FileNotFoundException($"Source file not found: '{sourceFileName}'.");
-                    }
-
-                    if (Items.ContainsKey(destFileName)) {
-                        throw new InvalidOperationException($"Destination path already exists: '{destFileName}'.");
-                    }
-
-                    sourceFile.CheckLock();
-
-                    var removed = Items.TryRemove(sourceFileName, out _);
-                    // Stryker disable once statement, string
-                    Debug.Assert(removed, $"Failed to remove source file '{sourceFileName}'.");
-
-                    var added = Items.TryAdd(destFileName, sourceFile with { Path = destFileName });
-                    // Stryker disable once statement, string
-                    Debug.Assert(added, $"Failed to add destination file '{destFileName}'.");
-                }
-            });
+        ;
         return mock;
     }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.MoveTo; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenSourceLocked; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenDestinationExists

[Killed] Negate expression
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:133:25
                 var destFileName   = NormalizePath(o.ArgAt<string>(1));
 
                 lock (_MoveLock) {
-                    if (!Items.TryGetValue(sourceFileName, out var sourceFile) || sourceFile is not { IsDirectory: false }) {
+                    if (!(!Items.TryGetValue(sourceFileName, out var sourceFile) || sourceFile is not { IsDirectory: false })) {
                         throw new FileNotFoundException($"Source file not found: '{sourceFileName}'.");
                     }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.MoveTo; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenSourceLocked; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenDestinationExists

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:133:25
                 var destFileName   = NormalizePath(o.ArgAt<string>(1));
 
                 lock (_MoveLock) {
-                    if (!Items.TryGetValue(sourceFileName, out var sourceFile) || sourceFile is not { IsDirectory: false }) {
+                    if (Items.TryGetValue(sourceFileName, out var sourceFile) || sourceFile is not { IsDirectory: false }) {
                         throw new FileNotFoundException($"Source file not found: '{sourceFileName}'.");
                     }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.MoveTo; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenSourceLocked; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenDestinationExists

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:134:25
 
                 lock (_MoveLock) {
                     if (!Items.TryGetValue(sourceFileName, out var sourceFile) || sourceFile is not { IsDirectory: false }) {
-                        throw new FileNotFoundException($"Source file not found: '{sourceFileName}'.");
+                        ;
                     }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenSourceNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenSourceNotFoundOrDirectory

[Killed] String mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:134:57
 
                 lock (_MoveLock) {
                     if (!Items.TryGetValue(sourceFileName, out var sourceFile) || sourceFile is not { IsDirectory: false }) {
-                        throw new FileNotFoundException($"Source file not found: '{sourceFileName}'.");
+                        throw new FileNotFoundException($"");
                     }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenSourceNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenSourceNotFoundOrDirectory

[Killed] Negate expression
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:137:25
                         throw new FileNotFoundException($"Source file not found: '{sourceFileName}'.");
                     }
 
-                    if (Items.ContainsKey(destFileName)) {
+                    if (!(Items.ContainsKey(destFileName))) {
                         throw new InvalidOperationException($"Destination path already exists: '{destFileName}'.");
                     }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.MoveTo; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenSourceLocked; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenDestinationExists

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:138:25
                     }
 
                     if (Items.ContainsKey(destFileName)) {
-                        throw new InvalidOperationException($"Destination path already exists: '{destFileName}'.");
+                        ;
                     }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenDestinationExists

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:141:21
                         throw new InvalidOperationException($"Destination path already exists: '{destFileName}'.");
                     }
 
-                    sourceFile.CheckLock();
+                    ;
 
                     var removed = Items.TryRemove(sourceFileName, out _);
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenSourceLocked

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:159:9
 
     private Create CreateCreate() {
         var mock = Substitute.For<Create>();
-        mock.Invoke(Arg.Any<string>()).Returns(o => {
-            var path = NormalizePath(o.Arg<string>());
-
-            lock (_CreateLock) {
-                Add(path, Array.Empty<byte>());
-
-                var data = new List<byte>();
-                return new MemoryFileStream((buffer, offset, count) => data.AddRange(buffer.Skip(offset).Take(count)), () => { Items[path] = Items[path]! with { Content = data.ToArray() }; });
-            }
-        });
+        ;
 
         return mock;
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Create_WhenSucceed; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Create_WhenAddThrows

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:163:17
             var path = NormalizePath(o.Arg<string>());
 
             lock (_CreateLock) {
-                Add(path, Array.Empty<byte>());
+                ;
 
                 var data = new List<byte>();
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Create_WhenSucceed; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Create_WhenAddThrows

[Killed] Block removal mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:166:126
                 Add(path, Array.Empty<byte>());
 
                 var data = new List<byte>();
-                return new MemoryFileStream((buffer, offset, count) => data.AddRange(buffer.Skip(offset).Take(count)), () => { Items[path] = Items[path]! with { Content = data.ToArray() }; });
+                return new MemoryFileStream((buffer, offset, count) => data.AddRange(buffer.Skip(offset).Take(count)), () => {});
             }
         });
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Create_WhenSucceed

[Killed] Linq method mutation (Skip() to Take())
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.File.cs:166:86
                 Add(path, Array.Empty<byte>());
 
                 var data = new List<byte>();
-                return new MemoryFileStream((buffer, offset, count) => data.AddRange(buffer.Skip(offset).Take(count)), () => { Items[path] = Items[path]! with { Content = data.ToArray() }; });
+                return new MemoryFileStream((buffer, offset, count) => data.AddRange(buffer.Take(offset).Take(count)), () => { Items[path] = Items[path]! with { Content = data.ToArray() }; });
             }
         });
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Create_WhenSucceed
