[Survived] CoalesceAssignmentExpression to SimpleAssignmentExpression mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.ZipFile.cs:26:22
 
     ExtractToDirectory IZipFile.ExtractToDirectory {
         [DebuggerStepThrough]
-        get { return _ExtractToDirectory ??= CreateExtractToDirectory(); }
+        get { return _ExtractToDirectory = CreateExtractToDirectory(); }
     }
 

[Survived] CoalesceAssignmentExpression to SimpleAssignmentExpression mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.ZipFile.cs:31:22
 
     OpenRead IZipFile.OpenRead {
         [DebuggerStepThrough]
-        get { return _OpenRead ??= CreateOpenRead(); }
+        get { return _OpenRead = CreateOpenRead(); }
     }
 

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.ZipFile.cs:36:9
 
     private ExtractToDirectory CreateExtractToDirectory() {
         var mock = Substitute.For<ExtractToDirectory>();
-        mock.When(o => o.Invoke(Arg.Any<string>(), Arg.Any<string>())).Do(o => {
-            var normalizedSource = NormalizePath(o.ArgAt<string>(0));
-            var normalizedDest   = NormalizePath(o.ArgAt<string>(1));
-
-            if (!Items.TryGetValue(normalizedSource, out var zipEntry) || zipEntry.IsDirectory) {
-                throw new FileNotFoundException($"Zip file '{normalizedSource}' not found.");
-            }
-
-            // Deserialize zip contents
-            try {
-                var entries = new MemoryZip(zipEntry.ExistingContent);
-                foreach (var entry in entries.OrderBy(p => p.Path.Length)) {
-                    Add(entry with { Path = Path.Combine(normalizedDest, entry.Path) });
-                }
-            } catch (JsonException ex) {
-                throw new InvalidDataException($"Failed to deserialize zip contents for '{normalizedSource}'.", ex);
-            }
-        });
+        ;
         return mock;
     }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotZip

[Killed] Negate expression
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.ZipFile.cs:40:17
             var normalizedSource = NormalizePath(o.ArgAt<string>(0));
             var normalizedDest   = NormalizePath(o.ArgAt<string>(1));
 
-            if (!Items.TryGetValue(normalizedSource, out var zipEntry) || zipEntry.IsDirectory) {
+            if (!(!Items.TryGetValue(normalizedSource, out var zipEntry) || zipEntry.IsDirectory)) {
                 throw new FileNotFoundException($"Zip file '{normalizedSource}' not found.");
             }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotZip

[Killed] Logical mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.ZipFile.cs:40:17
             var normalizedSource = NormalizePath(o.ArgAt<string>(0));
             var normalizedDest   = NormalizePath(o.ArgAt<string>(1));
 
-            if (!Items.TryGetValue(normalizedSource, out var zipEntry) || zipEntry.IsDirectory) {
+            if (!Items.TryGetValue(normalizedSource, out var zipEntry) && zipEntry.IsDirectory) {
                 throw new FileNotFoundException($"Zip file '{normalizedSource}' not found.");
             }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotFoundOrDirectory

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.ZipFile.cs:41:17
             var normalizedDest   = NormalizePath(o.ArgAt<string>(1));
 
             if (!Items.TryGetValue(normalizedSource, out var zipEntry) || zipEntry.IsDirectory) {
-                throw new FileNotFoundException($"Zip file '{normalizedSource}' not found.");
+                ;
             }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotFoundOrDirectory

[Killed] Linq method mutation (OrderBy() to OrderByDescending())
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.ZipFile.cs:47:39
             // Deserialize zip contents
             try {
                 var entries = new MemoryZip(zipEntry.ExistingContent);
-                foreach (var entry in entries.OrderBy(p => p.Path.Length)) {
+                foreach (var entry in entries.OrderByDescending(p => p.Path.Length)) {
                     Add(entry with { Path = Path.Combine(normalizedDest, entry.Path) });
                 }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractNestedZipFile_CreatesCorrectEntries

[Killed] Block removal mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.ZipFile.cs:47:76
             // Deserialize zip contents
             try {
                 var entries = new MemoryZip(zipEntry.ExistingContent);
-                foreach (var entry in entries.OrderBy(p => p.Path.Length)) {
-                    Add(entry with { Path = Path.Combine(normalizedDest, entry.Path) });
-                }
+                foreach (var entry in entries.OrderBy(p => p.Path.Length)) {}
             } catch (JsonException ex) {
                 throw new InvalidDataException($"Failed to deserialize zip contents for '{normalizedSource}'.", ex);
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractNestedZipFile_CreatesCorrectEntries

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.ZipFile.cs:51:17
                     Add(entry with { Path = Path.Combine(normalizedDest, entry.Path) });
                 }
             } catch (JsonException ex) {
-                throw new InvalidDataException($"Failed to deserialize zip contents for '{normalizedSource}'.", ex);
+                ;
             }
         });
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotZip

[Killed] String mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.ZipFile.cs:51:48
                     Add(entry with { Path = Path.Combine(normalizedDest, entry.Path) });
                 }
             } catch (JsonException ex) {
-                throw new InvalidDataException($"Failed to deserialize zip contents for '{normalizedSource}'.", ex);
+                throw new InvalidDataException($"", ex);
             }
         });
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotZip

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.ZipFile.cs:59:9
 
     private OpenRead CreateOpenRead() {
         var mock = Substitute.For<OpenRead>();
-        mock.Invoke(Arg.Any<string>()).Returns(o => {
-            var normalizedPath = NormalizePath(o.Arg<string>());
-            if (!Items.TryGetValue(normalizedPath, out var zipEntry) || zipEntry.IsDirectory) {
-                throw new FileNotFoundException($"Zip file '{normalizedPath}' not found.");
-            }
-
-            return new MemoryZipArchive(new MemoryZip(zipEntry.ExistingContent)).Mock();
-        });
+        ;
         return mock;
     }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ReturnsCorrectZipArchive; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ThrowWhenSourceNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ThrowWhenSourceNotFoundOrDirectory

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.ZipFile.cs:61:17
         var mock = Substitute.For<OpenRead>();
         mock.Invoke(Arg.Any<string>()).Returns(o => {
             var normalizedPath = NormalizePath(o.Arg<string>());
-            if (!Items.TryGetValue(normalizedPath, out var zipEntry) || zipEntry.IsDirectory) {
+            if (Items.TryGetValue(normalizedPath, out var zipEntry) || zipEntry.IsDirectory) {
                 throw new FileNotFoundException($"Zip file '{normalizedPath}' not found.");
             }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ReturnsCorrectZipArchive; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ThrowWhenSourceNotFoundOrDirectory

[Killed] Negate expression
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.ZipFile.cs:61:17
         var mock = Substitute.For<OpenRead>();
         mock.Invoke(Arg.Any<string>()).Returns(o => {
             var normalizedPath = NormalizePath(o.Arg<string>());
-            if (!Items.TryGetValue(normalizedPath, out var zipEntry) || zipEntry.IsDirectory) {
+            if (!(!Items.TryGetValue(normalizedPath, out var zipEntry) || zipEntry.IsDirectory)) {
                 throw new FileNotFoundException($"Zip file '{normalizedPath}' not found.");
             }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ReturnsCorrectZipArchive; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ThrowWhenSourceNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ThrowWhenSourceNotFoundOrDirectory

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.ZipFile.cs:62:17
         mock.Invoke(Arg.Any<string>()).Returns(o => {
             var normalizedPath = NormalizePath(o.Arg<string>());
             if (!Items.TryGetValue(normalizedPath, out var zipEntry) || zipEntry.IsDirectory) {
-                throw new FileNotFoundException($"Zip file '{normalizedPath}' not found.");
+                ;
             }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ThrowWhenSourceNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ThrowWhenSourceNotFoundOrDirectory

[Killed] String mutation
Manager/src/MemoryFileSystem2/MemoryFileSystem.Delegates.ZipFile.cs:62:49
         mock.Invoke(Arg.Any<string>()).Returns(o => {
             var normalizedPath = NormalizePath(o.Arg<string>());
             if (!Items.TryGetValue(normalizedPath, out var zipEntry) || zipEntry.IsDirectory) {
-                throw new FileNotFoundException($"Zip file '{normalizedPath}' not found.");
+                throw new FileNotFoundException($"");
             }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ThrowWhenSourceNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ThrowWhenSourceNotFoundOrDirectory
