[Killed] Null coalescing mutation (remove left)
Manager/src/MemoryFileSystem2/MemoryFs.cs:9:28
 public sealed class MemoryFs  :MemoryFileSystem
 {
     public MemoryFs(string? currentDirectory = null) {
-        CurrentDirectory = currentDirectory ?? "C:\\";
+        CurrentDirectory = "C:\\";
     }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFs.Constructor_SetCurrentDirectoryAddsAlParents; MemoryFileSystem2.Tests.TestsMemoryFs.NormalizePath_RelativePath_FromCurrent

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFs.cs:18:13
         get => _CurrentDirectory;
         set {
             var normalized = NormalizePath(value);
-            VerifyParents(normalized);
+            ;
             _CurrentDirectory = normalized;
         }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFs.Constructor_SetCurrentDirectoryAddsAlParents

[Killed] Negate expression
Manager/src/MemoryFileSystem2/MemoryFs.cs:25:13
 
     public override string NormalizePath(string path)
     {
-        if (string.IsNullOrEmpty(path)) {
+        if (!(string.IsNullOrEmpty(path))) {
             throw new ArgumentException("Path cannot be null or empty.");
         }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ReturnsCorrectZipArchive; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotFoundOrDirectory

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryFs.cs:26:13
     public override string NormalizePath(string path)
     {
         if (string.IsNullOrEmpty(path)) {
-            throw new ArgumentException("Path cannot be null or empty.");
+            ;
         }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFs.NormalizePath_ThrowWhenEmpty; MemoryFileSystem2.Tests.TestsMemoryFs.NormalizePath_ThrowWhenEmpty

[Killed] String mutation
Manager/src/MemoryFileSystem2/MemoryFs.cs:26:41
     public override string NormalizePath(string path)
     {
         if (string.IsNullOrEmpty(path)) {
-            throw new ArgumentException("Path cannot be null or empty.");
+            throw new ArgumentException("");
         }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFs.NormalizePath_ThrowWhenEmpty; MemoryFileSystem2.Tests.TestsMemoryFs.NormalizePath_ThrowWhenEmpty

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Manager/src/MemoryFileSystem2/MemoryFs.cs:30:13
         }
 
         // Resolve relative paths against _currentDirectory
-        if (!Path.IsPathRooted(path)) {
+        if (Path.IsPathRooted(path)) {
             path = Path.Combine(CurrentDirectory, path);
         }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ReturnsCorrectZipArchive; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotFoundOrDirectory; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotFoundOrDirectory

[Killed] Block removal mutation
Manager/src/MemoryFileSystem2/MemoryFs.cs:30:39
         }
 
         // Resolve relative paths against _currentDirectory
-        if (!Path.IsPathRooted(path)) {
-            path = Path.Combine(CurrentDirectory, path);
-        }
+        if (!Path.IsPathRooted(path)) {}
 
         path = Path.GetFullPath(path);
killedBy: MemoryFileSystem2.Tests.TestsMemoryFs.NormalizePath_RelativePath_FromCurrent

[Killed] Equality mutation
Manager/src/MemoryFileSystem2/MemoryFs.cs:35:13
         }
 
         path = Path.GetFullPath(path);
-        if (path.Length > 3) { // Trim trailing slash for non-root paths
+        if (path.Length < 3) { // Trim trailing slash for non-root paths
             path = path.TrimEnd('\\');
         }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFs.NormalizePath_TrimTrailingSlash

[Killed] Block removal mutation
Manager/src/MemoryFileSystem2/MemoryFs.cs:35:30
         }
 
         path = Path.GetFullPath(path);
-        if (path.Length > 3) { // Trim trailing slash for non-root paths
-            path = path.TrimEnd('\\');
-        }
+        if (path.Length > 3) {}
 
         return path;
killedBy: MemoryFileSystem2.Tests.TestsMemoryFs.NormalizePath_TrimTrailingSlash
