[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryZip.cs:18:13
         var entries = GetEntries(bytes);
 
         foreach (var entry in entries) {
-            Items.TryAdd(entry.Path, entry);
+            ;
         }
     }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ReturnsCorrectZipArchive; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractNestedZipFile_CreatesCorrectEntries; MemoryFileSystem2.Tests.TestsMemoryZip.Constructor_DeserializeEntriesFromByteArray

[Killed] Negate expression
Manager/src/MemoryFileSystem2/MemoryZip.cs:23:13
     }
 
     public override string NormalizePath(string path) {
-        if (string.IsNullOrEmpty(path)) {
+        if (!(string.IsNullOrEmpty(path))) {
             throw new ArgumentException("Path cannot be null or empty.");
         }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ReturnsCorrectZipArchive; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractNestedZipFile_CreatesCorrectEntries; MemoryFileSystem2.Tests.TestsMemoryZip.NormalizePath_ThrowWhenEmpty

[Killed] Negate expression
Manager/src/MemoryFileSystem2/MemoryZip.cs:27:13
             throw new ArgumentException("Path cannot be null or empty.");
         }
 
-        if (path.Contains(':')) {
+        if (!(path.Contains(':'))) {
             throw new ArgumentException("Zip file do not support absolute paths.");
         }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ReturnsCorrectZipArchive; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractNestedZipFile_CreatesCorrectEntries; MemoryFileSystem2.Tests.TestsMemoryZip.Constructor_DeserializeEntriesFromByteArray

[Killed] Statement mutation
Manager/src/MemoryFileSystem2/MemoryZip.cs:28:13
         }
 
         if (path.Contains(':')) {
-            throw new ArgumentException("Zip file do not support absolute paths.");
+            ;
         }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryZip.NormalizePath_ThrowWhenAbsolute

[Killed] String mutation
Manager/src/MemoryFileSystem2/MemoryZip.cs:28:41
         }
 
         if (path.Contains(':')) {
-            throw new ArgumentException("Zip file do not support absolute paths.");
+            throw new ArgumentException("");
         }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryZip.NormalizePath_ThrowWhenAbsolute

[Killed] Negate expression
Manager/src/MemoryFileSystem2/MemoryZip.cs:32:13
         }
 
         path = path.Replace('\\', '/');
-        if (path.StartsWith("/")) {
+        if (!(path.StartsWith("/"))) {
             path = path.Substring(1); // Remove leading "/"
         }
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ReturnsCorrectZipArchive; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractNestedZipFile_CreatesCorrectEntries; MemoryFileSystem2.Tests.TestsMemoryZip.Constructor_DeserializeEntriesFromByteArray

[Killed] Block removal mutation
Manager/src/MemoryFileSystem2/MemoryZip.cs:32:35
         }
 
         path = path.Replace('\\', '/');
-        if (path.StartsWith("/")) {
-            path = path.Substring(1); // Remove leading "/"
-        }
+        if (path.StartsWith("/")) {}
 
         return path;
killedBy: MemoryFileSystem2.Tests.TestsMemoryZip.NormalizePath_WhenValidPath

[Killed] Conditional (true) mutation
Manager/src/MemoryFileSystem2/MemoryZip.cs:41:16
 
     protected override string? GetParentPath(string path) {
         var index = path.LastIndexOf('/');
-        return index == -1 ? null : path.Substring(0, index);
+        return (true?null :path.Substring(0, index));
     }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryZip.Constructor_DeserializeEntriesFromByteArray

[Killed] Equality mutation
Manager/src/MemoryFileSystem2/MemoryZip.cs:41:16
 
     protected override string? GetParentPath(string path) {
         var index = path.LastIndexOf('/');
-        return index == -1 ? null : path.Substring(0, index);
+        return index != -1 ? null : path.Substring(0, index);
     }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryZip.Constructor_DeserializeEntriesFromByteArray
