[Killed] Boolean mutation
src/MemoryFileSystem2/Types/MemoryEntry.cs:17:28
     public static readonly DateTime DefaultLastWriteTime = new(2000, 1, 1);
 
     public MemoryEntry(string folderPath, DateTime? lastWriteTime = null)
-        : this(folderPath, true, lastWriteTime ?? DefaultLastWriteTime, null, null, false) {
+        : this(folderPath, false, lastWriteTime ?? DefaultLastWriteTime, null, null, false) {
     }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesDirectory.EnumerateDirectories; MemoryFileSystem2.Tests.TestsMemoryFileSystemAdd.AddRange_AddsINCorrectOrder

[Killed] Boolean mutation
src/MemoryFileSystem2/Types/MemoryEntry.cs:21:87
     }
 
     public MemoryEntry(string filePath, byte[] content, DateTime? lastWriteTime = null)
-        : this(filePath, false, lastWriteTime ?? DefaultLastWriteTime, content, null, false) {
+        : this(filePath, false, lastWriteTime ?? DefaultLastWriteTime, content, null, true) {
     }
 
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFileInfo.MoveTo; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenValid

[Killed] Conditional (true) mutation
src/MemoryFileSystem2/Types/MemoryEntry.cs:29:38
     }
 
     [JsonIgnore]
-    public byte[] ExistingContent => IsDirectory || Content == null
-        ? throw new InvalidDataException($"Entry at '{Path}' is directory or its content is missing.")
-        : Content;
+    public byte[] ExistingContent => (true?throw new InvalidDataException($"Entry at '{Path}' is directory or its content is missing.")
+:Content);
 
     public void CheckLock() {
killedBy: MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ReturnsCorrectZipArchive; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotZip; MemoryFileSystem2.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractNestedZipFile_CreatesCorrectEntries

[Survived] Statement mutation
src/MemoryFileSystem2/Types/MemoryEntry.cs:44:9
     private string DebuggerDisplay => $"[{(IsDirectory ? "D" : "F")}] {Path}";
 
     private bool PrintMembers(StringBuilder builder) {
-        builder.Append($"Path = {Path}");
+        ;
         builder.Append($"IsDirectory = {IsDirectory}");
         builder.Append($"LastWriteTime = {LastWriteTime}");

[Survived] Statement mutation
src/MemoryFileSystem2/Types/MemoryEntry.cs:45:9
 
     private bool PrintMembers(StringBuilder builder) {
         builder.Append($"Path = {Path}");
-        builder.Append($"IsDirectory = {IsDirectory}");
+        ;
         builder.Append($"LastWriteTime = {LastWriteTime}");
         builder.Append($"Content = {Content}");

[Survived] String mutation
src/MemoryFileSystem2/Types/MemoryEntry.cs:45:24
 
     private bool PrintMembers(StringBuilder builder) {
         builder.Append($"Path = {Path}");
-        builder.Append($"IsDirectory = {IsDirectory}");
+        builder.Append($"");
         builder.Append($"LastWriteTime = {LastWriteTime}");
         builder.Append($"Content = {Content}");

[Survived] Statement mutation
src/MemoryFileSystem2/Types/MemoryEntry.cs:46:9
     private bool PrintMembers(StringBuilder builder) {
         builder.Append($"Path = {Path}");
         builder.Append($"IsDirectory = {IsDirectory}");
-        builder.Append($"LastWriteTime = {LastWriteTime}");
+        ;
         builder.Append($"Content = {Content}");
         builder.Append($"ReadException = {ReadException}");

[Survived] String mutation
src/MemoryFileSystem2/Types/MemoryEntry.cs:46:24
     private bool PrintMembers(StringBuilder builder) {
         builder.Append($"Path = {Path}");
         builder.Append($"IsDirectory = {IsDirectory}");
-        builder.Append($"LastWriteTime = {LastWriteTime}");
+        builder.Append($"");
         builder.Append($"Content = {Content}");
         builder.Append($"ReadException = {ReadException}");

[Survived] Statement mutation
src/MemoryFileSystem2/Types/MemoryEntry.cs:47:9
         builder.Append($"Path = {Path}");
         builder.Append($"IsDirectory = {IsDirectory}");
         builder.Append($"LastWriteTime = {LastWriteTime}");
-        builder.Append($"Content = {Content}");
+        ;
         builder.Append($"ReadException = {ReadException}");
         builder.Append($"Locked = {Locked}");

[Survived] Statement mutation
src/MemoryFileSystem2/Types/MemoryEntry.cs:48:9
         builder.Append($"IsDirectory = {IsDirectory}");
         builder.Append($"LastWriteTime = {LastWriteTime}");
         builder.Append($"Content = {Content}");
-        builder.Append($"ReadException = {ReadException}");
+        ;
         builder.Append($"Locked = {Locked}");
         return true;

[Survived] String mutation
src/MemoryFileSystem2/Types/MemoryEntry.cs:48:24
         builder.Append($"IsDirectory = {IsDirectory}");
         builder.Append($"LastWriteTime = {LastWriteTime}");
         builder.Append($"Content = {Content}");
-        builder.Append($"ReadException = {ReadException}");
+        builder.Append($"");
         builder.Append($"Locked = {Locked}");
         return true;

[Survived] Statement mutation
src/MemoryFileSystem2/Types/MemoryEntry.cs:49:9
         builder.Append($"LastWriteTime = {LastWriteTime}");
         builder.Append($"Content = {Content}");
         builder.Append($"ReadException = {ReadException}");
-        builder.Append($"Locked = {Locked}");
+        ;
         return true;
     }

[Survived] Boolean mutation
src/MemoryFileSystem2/Types/MemoryEntry.cs:50:16
         builder.Append($"Content = {Content}");
         builder.Append($"ReadException = {ReadException}");
         builder.Append($"Locked = {Locked}");
-        return true;
+        return false;
     }
 }
