[Killed] Null coalescing mutation (remove left)
src/Railroader.ModManager/Extensions/LoggerExtensions.cs:8:45
 public static class LoggerExtensions
 {
     public static ILogger ForSourceContext(this ILogger? logger, string? scope = null) =>
-        logger?.ForContext("SourceContext", scope ?? "Railroader.ModManager")!;
+        logger?.ForContext("SourceContext", "Railroader.ModManager")!;
 }
 
killedBy: Railroader.ModManager.Tests.Extensions.TestLoggerExtensions.ForSourceContext; Railroader.ModManager.Tests.TestsMod.CreateLogger; Railroader.ModManager.Tests.TestsMod.CreateLogger
