[Killed] Equality mutation
src/Railroader.ModManager/Features/AssemblyCompiler.cs:58:13
     /// </returns>
     [EditorBrowsable(EditorBrowsableState.Never)]
     public static bool Compile(InvokeCompiler compilerInvoker, ILogger logger, string outputPath, ICollection<string> sourceFiles, ICollection<string> referenceAssemblies) {
-        if (sourceFiles.Count == 0) {
+        if (sourceFiles.Count != 0) {
             logger.Error("No source files provided for assembly compilation at {outputPath}.", outputPath);
             return false;
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Statement mutation
src/Railroader.ModManager/Features/AssemblyCompiler.cs:59:13
     [EditorBrowsable(EditorBrowsableState.Never)]
     public static bool Compile(InvokeCompiler compilerInvoker, ILogger logger, string outputPath, ICollection<string> sourceFiles, ICollection<string> referenceAssemblies) {
         if (sourceFiles.Count == 0) {
-            logger.Error("No source files provided for assembly compilation at {outputPath}.", outputPath);
+            ;
             return false;
         }
killedBy: Railroader.ModManager.Tests.Features.TestAssemblyCompiler.CompileAssemblyWhenNoSourcesProvided

[Killed] Boolean mutation
src/Railroader.ModManager/Features/AssemblyCompiler.cs:60:20
     public static bool Compile(InvokeCompiler compilerInvoker, ILogger logger, string outputPath, ICollection<string> sourceFiles, ICollection<string> referenceAssemblies) {
         if (sourceFiles.Count == 0) {
             logger.Error("No source files provided for assembly compilation at {outputPath}.", outputPath);
-            return false;
+            return true;
         }
 
killedBy: Railroader.ModManager.Tests.Features.TestAssemblyCompiler.CompileAssemblyWhenNoSourcesProvided

[Killed] Statement mutation
src/Railroader.ModManager/Features/AssemblyCompiler.cs:64:9
         }
 
         logger.Information("Compiling assembly {outputPath} ...", outputPath);
-        logger.Debug("References:\n{references}", string.Join("\n", referenceAssemblies));
+        ;
         logger.Debug("Sources:\n{sources}", string.Join("\n", sourceFiles));
 
killedBy: Railroader.ModManager.Tests.Features.TestAssemblyCompiler.CompileAssemblyWhenSuccessful; Railroader.ModManager.Tests.Features.TestAssemblyCompiler.CompileAssemblyWhenFailed; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] String mutation
src/Railroader.ModManager/Features/AssemblyCompiler.cs:64:22
         }
 
         logger.Information("Compiling assembly {outputPath} ...", outputPath);
-        logger.Debug("References:\n{references}", string.Join("\n", referenceAssemblies));
+        logger.Debug("", string.Join("\n", referenceAssemblies));
         logger.Debug("Sources:\n{sources}", string.Join("\n", sourceFiles));
 
killedBy: Railroader.ModManager.Tests.Features.TestAssemblyCompiler.CompileAssemblyWhenSuccessful; Railroader.ModManager.Tests.Features.TestAssemblyCompiler.CompileAssemblyWhenFailed; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Statement mutation
src/Railroader.ModManager/Features/AssemblyCompiler.cs:65:9
 
         logger.Information("Compiling assembly {outputPath} ...", outputPath);
         logger.Debug("References:\n{references}", string.Join("\n", referenceAssemblies));
-        logger.Debug("Sources:\n{sources}", string.Join("\n", sourceFiles));
+        ;
 
         var args = CompilerArguments(outputPath, sourceFiles, referenceAssemblies);
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher1

[Killed] String mutation
src/Railroader.ModManager/Features/AssemblyCompiler.cs:65:22
 
         logger.Information("Compiling assembly {outputPath} ...", outputPath);
         logger.Debug("References:\n{references}", string.Join("\n", referenceAssemblies));
-        logger.Debug("Sources:\n{sources}", string.Join("\n", sourceFiles));
+        logger.Debug("", string.Join("\n", sourceFiles));
 
         var args = CompilerArguments(outputPath, sourceFiles, referenceAssemblies);
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Features/AssemblyCompiler.cs:76:13
         }
 
         var messages = sb.ToString();
-        if (!string.IsNullOrEmpty(messages)) {
+        if (string.IsNullOrEmpty(messages)) {
             logger.Write(result ? LogEventLevel.Debug : LogEventLevel.Information, "Compilation messages:\r\n{messages}", messages);
         }
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher2

[Killed] String mutation
src/Railroader.ModManager/Features/AssemblyCompiler.cs:76:14
         }
 
         var messages = sb.ToString();
-        if (!string.IsNullOrEmpty(messages)) {
+        if (!(messages!="")) {
             logger.Write(result ? LogEventLevel.Debug : LogEventLevel.Information, "Compilation messages:\r\n{messages}", messages);
         }
killedBy: Railroader.ModManager.Tests.Features.TestAssemblyCompiler.CompileAssemblyWhenSuccessful; Railroader.ModManager.Tests.Features.TestAssemblyCompiler.CompileAssemblyWhenFailed; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Negate expression
src/Railroader.ModManager/Features/AssemblyCompiler.cs:80:13
             logger.Write(result ? LogEventLevel.Debug : LogEventLevel.Information, "Compilation messages:\r\n{messages}", messages);
         }
 
-        if (result) {
+        if (!(result)) {
             logger.Information("Assembly {outputPath} compiled successfully", outputPath);
             return true;
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.Factory; Railroader.ModManager.Tests.Features.TestAssemblyCompiler.CompileAssemblyWhenSuccessful; Railroader.ModManager.Tests.Features.TestAssemblyCompiler.CompileAssemblyWhenFailed

[Killed] String mutation
src/Railroader.ModManager/Features/AssemblyCompiler.cs:106:9
         $"-out:{assemblyPath}",
         $"-reference:{string.Join(",", references)}",
         "-target:library",
-        "-warn:4"
+        ""
     ];
 }
killedBy: Railroader.ModManager.Tests.Features.TestAssemblyCompiler.CompileAssemblyWhenSuccessful; Railroader.ModManager.Tests.Features.TestAssemblyCompiler.CompileAssemblyWhenFailed
