[Killed] Statement mutation
src/Railroader.ModManager/Features/Bootstrapper.cs:41:9
     }
 
     public static void Execute(ModExtractionAction extractMods, LoadDefinitionsDelegate loadDefinitions, IHarmony factory, Action createManagerBehaviour) {
-        extractMods();
+        ;
         ModDefinitions = loadDefinitions();
 
killedBy: Railroader.ModManager.Tests.Features.TestsBootstrapper.Execute_Calls_ExtractMods

[Killed] String mutation
src/Railroader.ModManager/Features/Bootstrapper.cs:83:28
             return;
         }
 
-        logger.Information("Validating mods ...");
+        logger.Information("");
         modDefinitions = modDefinitionValidator(modDefinitions);
 
killedBy: Railroader.ModManager.Tests.Features.TestsBootstrapper.LoadMods_When_Validation_Fails_Should_Log_Error_And_Cancel

[Killed] Block removal mutation
src/Railroader.ModManager/Features/Bootstrapper.cs:97:47
             var definition = modDefinitions[i]!;
             var result     = codeCompiler(definition);
             if (result == CompileModResult.Success) {
-                if (!codePatcher(definition)) {
-                    result = CompileModResult.Error;
-                }
+                if (!codePatcher(definition)) {}
             }
 
killedBy: Railroader.ModManager.Tests.Features.TestsBootstrapper.LoadMods_Should_TryPatch_Each_Valid_Mod

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Features/Bootstrapper.cs:97:21
             var definition = modDefinitions[i]!;
             var result     = codeCompiler(definition);
             if (result == CompileModResult.Success) {
-                if (!codePatcher(definition)) {
+                if (codePatcher(definition)) {
                     result = CompileModResult.Error;
                 }
killedBy: Railroader.ModManager.Tests.Features.TestsBootstrapper.LoadMods_Calls_TryInstantiatePlugins; Railroader.ModManager.Tests.Features.TestsBootstrapper.LoadMods_Calls_PluginFactory; Railroader.ModManager.Tests.Features.TestsBootstrapper.LoadMods_Should_TryPatch_Each_Valid_Mod

[Killed] Equality mutation
src/Railroader.ModManager/Features/Bootstrapper.cs:110:32
 
             mods[i] = new(logger, definition) {
                 AssemblyPath = assemblyPath,
-                IsValid      = result != CompileModResult.Error
+                IsValid      = result == CompileModResult.Error
             };
         }
killedBy: Railroader.ModManager.Tests.Features.TestsBootstrapper.LoadMods_Calls_PluginFactory
