[Killed] Block removal mutation
src/Railroader.ModManager/Features/CodeCompiler.cs:132:34
         var csFiles = directoryInfo(definition.BasePath)
                       .EnumerateFiles("*.cs", SearchOption.AllDirectories)
                       .ToArray();
-        if (csFiles.Length == 0) {
-            return CompileModResult.None;
-        }
+        if (csFiles.Length == 0) {}
 
         var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + DllExtension);
killedBy: Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_WhenNoSources

[Killed] Negate expression
src/Railroader.ModManager/Features/CodeCompiler.cs:137:13
         }
 
         var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + DllExtension);
-        if (exists(assemblyPath)) {
+        if (!(exists(assemblyPath))) {
             var newestFileTime = csFiles.Max(f => f.LastWriteTime);
             if (getLastWriteTime(assemblyPath) >= newestFileTime) {
killedBy: Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Failed; Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Successful; Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Successful

[Killed] Linq method mutation (Max() to Min())
src/Railroader.ModManager/Features/CodeCompiler.cs:138:34
 
         var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + DllExtension);
         if (exists(assemblyPath)) {
-            var newestFileTime = csFiles.Max(f => f.LastWriteTime);
+            var newestFileTime = csFiles.Min(f => f.LastWriteTime);
             if (getLastWriteTime(assemblyPath) >= newestFileTime) {
                 logger.Information("Using existing mod {ModId} DLL at {Path}", definition.Identifier, assemblyPath);
killedBy: Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Failed; Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Successful; Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Successful

[Killed] Equality mutation
src/Railroader.ModManager/Features/CodeCompiler.cs:139:17
         var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + DllExtension);
         if (exists(assemblyPath)) {
             var newestFileTime = csFiles.Max(f => f.LastWriteTime);
-            if (getLastWriteTime(assemblyPath) >= newestFileTime) {
+            if (getLastWriteTime(assemblyPath) > newestFileTime) {
                 logger.Information("Using existing mod {ModId} DLL at {Path}", definition.Identifier, assemblyPath);
                 return CompileModResult.Skipped;
killedBy: Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_AssemblyUpToDate

[Killed] Equality mutation
src/Railroader.ModManager/Features/CodeCompiler.cs:139:17
         var assemblyPath = Path.Combine(definition.BasePath, definition.Identifier + DllExtension);
         if (exists(assemblyPath)) {
             var newestFileTime = csFiles.Max(f => f.LastWriteTime);
-            if (getLastWriteTime(assemblyPath) >= newestFileTime) {
+            if (getLastWriteTime(assemblyPath) < newestFileTime) {
                 logger.Information("Using existing mod {ModId} DLL at {Path}", definition.Identifier, assemblyPath);
                 return CompileModResult.Skipped;
killedBy: Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Failed; Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Successful; Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Successful

[Killed] Statement mutation
src/Railroader.ModManager/Features/CodeCompiler.cs:140:17
         if (exists(assemblyPath)) {
             var newestFileTime = csFiles.Max(f => f.LastWriteTime);
             if (getLastWriteTime(assemblyPath) >= newestFileTime) {
-                logger.Information("Using existing mod {ModId} DLL at {Path}", definition.Identifier, assemblyPath);
+                ;
                 return CompileModResult.Skipped;
             }
killedBy: Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_AssemblyUpToDate; Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_AssemblyUpToDate

[Killed] String mutation
src/Railroader.ModManager/Features/CodeCompiler.cs:157:69
 
         if (definition.Requires?.Count > 0) {
             logger.Information("Adding references to {Mods} ...", definition.Requires.Keys);
-            var modsPath      = Path.Combine(getCurrentDirectory(), "Mods");
+            var modsPath      = Path.Combine(getCurrentDirectory(), "");
             var modReferences = definition.Requires.Keys.Select(o => Path.Combine(modsPath, o, o + DllExtension));
             references = references.Concat(modReferences).ToArray();
killedBy: Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_WithValidModReferences

[Killed] Linq method mutation (Concat() to Except())
src/Railroader.ModManager/Features/CodeCompiler.cs:159:26
             logger.Information("Adding references to {Mods} ...", definition.Requires.Keys);
             var modsPath      = Path.Combine(getCurrentDirectory(), "Mods");
             var modReferences = definition.Requires.Keys.Select(o => Path.Combine(modsPath, o, o + DllExtension));
-            references = references.Concat(modReferences).ToArray();
+            references = references.Except(modReferences).ToArray();
         }
 
killedBy: Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_WithValidModReferences

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Features/CodeCompiler.cs:162:13
             references = references.Concat(modReferences).ToArray();
         }
 
-        if (!compileAssembly(assemblyPath, sources, references.ToArray())) {
+        if (compileAssembly(assemblyPath, sources, references.ToArray())) {
             logger.Error("Compilation failed for mod {ModId} ...", definition.Identifier);
             return CompileModResult.Error;
killedBy: Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Failed; Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Successful; Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Successful

[Killed] Statement mutation
src/Railroader.ModManager/Features/CodeCompiler.cs:163:13
         }
 
         if (!compileAssembly(assemblyPath, sources, references.ToArray())) {
-            logger.Error("Compilation failed for mod {ModId} ...", definition.Identifier);
+            ;
             return CompileModResult.Error;
         }
killedBy: Railroader.ModManager.Tests.Features.TestsCodeCompiler.CompileMod_Compilation_Failed
