[Killed] Equality mutation
src/Railroader.ModManager/Features/CodePatcher.cs:70:13
         GetCurrentDirectory getCurrentDirectory, EnumerateDirectories enumerateDirectories, Delete delete, Move move,
         ModDefinition definition, TypePatcherInfo[] pluginPatchers
     ) {
-        if (pluginPatchers.Length == 0) {
+        if (pluginPatchers.Length != 0) {
             return true;
         }
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher1; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher2; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_AssemblyLoadFail

[Killed] Boolean mutation
src/Railroader.ModManager/Features/CodePatcher.cs:71:20
         ModDefinition definition, TypePatcherInfo[] pluginPatchers
     ) {
         if (pluginPatchers.Length == 0) {
-            return true;
+            return false;
         }
 
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.NoPatches_DoNothing

[Killed] Boolean mutation
src/Railroader.ModManager/Features/CodePatcher.cs:79:53
         bool                success;
         var                 assemblyPath          = Path.Combine(definition.BasePath, definition.Identifier + ".dll");
         var                 tempFilePath          = Path.ChangeExtension(assemblyPath, ".patched.dll");
-        var                 shouldReplaceOriginal = false;
+        var                 shouldReplaceOriginal = true;
         AssemblyDefinition? assemblyDefinition    = null;
         try {
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_AssemblyLoadFail

[Killed] Statement mutation
src/Railroader.ModManager/Features/CodePatcher.cs:87:17
             var readParameters = new ReaderParameters { AssemblyResolver = resolver };
             assemblyDefinition = readAssemblyDefinition(assemblyPath, readParameters);
             if (assemblyDefinition == null) {
-                logger.Error("Failed to load definition for assembly {AssemblyPath} for mod {ModId}", assemblyPath, definition.Identifier);
+                ;
                 success = false;
             } else {
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_AssemblyLoadFail

[Killed] Boolean mutation
src/Railroader.ModManager/Features/CodePatcher.cs:88:27
             assemblyDefinition = readAssemblyDefinition(assemblyPath, readParameters);
             if (assemblyDefinition == null) {
                 logger.Error("Failed to load definition for assembly {AssemblyPath} for mod {ModId}", assemblyPath, definition.Identifier);
-                success = false;
+                success = true;
             } else {
                 (shouldReplaceOriginal, success) = TryPatchAssemblyDefinition(logger, definition, pluginPatchers, assemblyDefinition);
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_AssemblyLoadFail

[Killed] Negate expression
src/Railroader.ModManager/Features/CodePatcher.cs:92:21
             } else {
                 (shouldReplaceOriginal, success) = TryPatchAssemblyDefinition(logger, definition, pluginPatchers, assemblyDefinition);
 
-                if (shouldReplaceOriginal) {
+                if (!(shouldReplaceOriginal)) {
                     writeAssemblyDefinition(assemblyDefinition, tempFilePath);
                     logger.Debug("Wrote patched assembly to temporary file {TempPath} for mod {ModId}", tempFilePath, definition.Identifier);
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher1; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher2; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_ExtraInterface

[Killed] Statement mutation
src/Railroader.ModManager/Features/CodePatcher.cs:93:21
                 (shouldReplaceOriginal, success) = TryPatchAssemblyDefinition(logger, definition, pluginPatchers, assemblyDefinition);
 
                 if (shouldReplaceOriginal) {
-                    writeAssemblyDefinition(assemblyDefinition, tempFilePath);
+                    ;
                     logger.Debug("Wrote patched assembly to temporary file {TempPath} for mod {ModId}", tempFilePath, definition.Identifier);
                 } else {
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_ReturnValidInstances

[Killed] Statement mutation
src/Railroader.ModManager/Features/CodePatcher.cs:94:21
 
                 if (shouldReplaceOriginal) {
                     writeAssemblyDefinition(assemblyDefinition, tempFilePath);
-                    logger.Debug("Wrote patched assembly to temporary file {TempPath} for mod {ModId}", tempFilePath, definition.Identifier);
+                    ;
                 } else {
                     logger.Information("No patches were applied to assembly {AssemblyPath} for mod {ModId}", assemblyPath, definition.Identifier);
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_ReturnValidInstances

[Killed] Statement mutation
src/Railroader.ModManager/Features/CodePatcher.cs:96:21
                     writeAssemblyDefinition(assemblyDefinition, tempFilePath);
                     logger.Debug("Wrote patched assembly to temporary file {TempPath} for mod {ModId}", tempFilePath, definition.Identifier);
                 } else {
-                    logger.Information("No patches were applied to assembly {AssemblyPath} for mod {ModId}", assemblyPath, definition.Identifier);
+                    ;
                 }
             }
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher1; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher2; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_ExtraInterface

[Killed] Statement mutation
src/Railroader.ModManager/Features/CodePatcher.cs:105:17
 
         if (shouldReplaceOriginal) {
             try {
-                delete(assemblyPath);
+                ;
                 move(tempFilePath, assemblyPath);
             } catch (Exception exc) {
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_ReturnValidInstances

[NoCoverage] Statement mutation
src/Railroader.ModManager/Features/CodePatcher.cs:108:17
                 delete(assemblyPath);
                 move(tempFilePath, assemblyPath);
             } catch (Exception exc) {
-                logger.Error(exc, "Failed to replace original assembly for mod {ModId}", definition.Identifier);
+                ;
                 success = false;
             }

[NoCoverage] String mutation
src/Railroader.ModManager/Features/CodePatcher.cs:108:35
                 delete(assemblyPath);
                 move(tempFilePath, assemblyPath);
             } catch (Exception exc) {
-                logger.Error(exc, "Failed to replace original assembly for mod {ModId}", definition.Identifier);
+                logger.Error(exc, "", definition.Identifier);
                 success = false;
             }

[NoCoverage] Boolean mutation
src/Railroader.ModManager/Features/CodePatcher.cs:109:27
                 move(tempFilePath, assemblyPath);
             } catch (Exception exc) {
                 logger.Error(exc, "Failed to replace original assembly for mod {ModId}", definition.Identifier);
-                success = false;
+                success = true;
             }
         }

[Killed] Statement mutation
src/Railroader.ModManager/Features/CodePatcher.cs:114:13
         }
 
         if (!success) {
-            logger.Error("Failed to apply patches to assembly {AssemblyPath} for mod {ModId}", assemblyPath, definition.Identifier);
+            ;
         } else {
             logger.Information("Patching complete for mod {ModId}", definition.Identifier);
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher1; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher2; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_AssemblyLoadFail

[Killed] Statement mutation
src/Railroader.ModManager/Features/CodePatcher.cs:116:13
         if (!success) {
             logger.Error("Failed to apply patches to assembly {AssemblyPath} for mod {ModId}", assemblyPath, definition.Identifier);
         } else {
-            logger.Information("Patching complete for mod {ModId}", definition.Identifier);
+            ;
         }
 
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_ExtraInterface; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_ReturnValidInstances

[Killed] Statement mutation
src/Railroader.ModManager/Features/CodePatcher.cs:132:9
     private static DefaultAssemblyResolver CreateAssemblyResolver(GetCurrentDirectory getCurrentDirectory, EnumerateDirectories enumerateDirectories, ModDefinition definition, string assemblyPath) {
         var resolver = new DefaultAssemblyResolver();
 
-        resolver.AddSearchDirectory(Path.Combine(getCurrentDirectory(), "Railroader_Data", "Managed"));
+        ;
 
         if (!(definition.Requires?.Count > 0)) {
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher1; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher2; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_ExtraInterface

[Killed] Equality mutation
src/Railroader.ModManager/Features/CodePatcher.cs:134:15
 
         resolver.AddSearchDirectory(Path.Combine(getCurrentDirectory(), "Railroader_Data", "Managed"));
 
-        if (!(definition.Requires?.Count > 0)) {
+        if (!(definition.Requires?.Count >= 0)) {
             return resolver;
         }
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher1; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher2; Railroader.ModManager.Tests.Features.TestsCodePatcher.ApplyPatches_EmptyRequires_DoesNotScanModsDirectory

[Killed] Equality mutation
src/Railroader.ModManager/Features/CodePatcher.cs:134:15
 
         resolver.AddSearchDirectory(Path.Combine(getCurrentDirectory(), "Railroader_Data", "Managed"));
 
-        if (!(definition.Requires?.Count > 0)) {
+        if (!(definition.Requires?.Count < 0)) {
             return resolver;
         }
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher1; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher2; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_ExtraInterface

[Killed] Equality mutation
src/Railroader.ModManager/Features/CodePatcher.cs:140:35
 
         var thisModDir = Path.GetDirectoryName(assemblyPath);
         var modDirs = enumerateDirectories(Path.Combine(getCurrentDirectory(), "Mods"))
-                      .Where(o => o != thisModDir)
+                      .Where(o => o == thisModDir)
                       .Where(o => definition.Requires.ContainsKey(Path.GetFileName(o)));
         foreach (var modDir in modDirs) {
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher1; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher2; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_ExtraInterface

[Killed] Boolean mutation
src/Railroader.ModManager/Features/CodePatcher.cs:157:24
     ///     and whether the operation succeeded without errors.
     /// </returns>
-        var hasPatch = false;
+        var hasPatch = true;
         var hasError = false;
         foreach (var type in assemblyDefinition.MainModule.Types) {
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_ExtraInterface; Railroader.ModManager.Tests.Features.TestsCodePatcher.ApplyPatches_EmptyRequires_DoesNotScanModsDirectory

[Killed] Boolean mutation
src/Railroader.ModManager/Features/CodePatcher.cs:165:32
                 var patchers   = pluginPatchers.Where(pair => interfaces.Contains(pair.MarkerType.FullName)).Select(o => o.Factory());
 
                 foreach (var patcher in patchers) {
-                    hasPatch = true;
+                    hasPatch = false;
                     patcher!(assemblyDefinition, type);
                 }
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher1; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_ReturnValidInstances

[Killed] Statement mutation
src/Railroader.ModManager/Features/CodePatcher.cs:166:21
 
                 foreach (var patcher in patchers) {
                     hasPatch = true;
-                    patcher!(assemblyDefinition, type);
+                    ;
                 }
             } catch (Exception ex) {
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher1; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher2

[Killed] Statement mutation
src/Railroader.ModManager/Features/CodePatcher.cs:169:17
                     patcher!(assemblyDefinition, type);
                 }
             } catch (Exception ex) {
-                logger.Error(ex, "Failed to patch type {TypeName} for mod {ModId}", type.FullName, definition.Identifier);
+                ;
                 hasError = true;
             }
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher1; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher2

[Killed] Boolean mutation
src/Railroader.ModManager/Features/CodePatcher.cs:170:28
                 }
             } catch (Exception ex) {
                 logger.Error(ex, "Failed to patch type {TypeName} for mod {ModId}", type.FullName, definition.Identifier);
-                hasError = true;
+                hasError = false;
             }
         }
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher1; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher2

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Features/CodePatcher.cs:174:40
             }
         }
 
-        return (hasPatch && !hasError, !hasError);
+        return (hasPatch && !hasError, hasError);
     }
 }
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher1; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher2; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_ExtraInterface

[Killed] Logical mutation
src/Railroader.ModManager/Features/CodePatcher.cs:174:17
             }
         }
 
-        return (hasPatch && !hasError, !hasError);
+        return (hasPatch || !hasError, !hasError);
     }
 }
killedBy: Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher1; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_HandleThrowingPatcher2; Railroader.ModManager.Tests.Features.TestsCodePatcher.CompileMod_Compilation_WithPatches_ExtraInterface
