[Killed] String mutation
Railroader.ModManager/Features/CodePatchers/HarmonyPluginPatcher.cs:27:60
     [EditorBrowsable(EditorBrowsableState.Never)]
     public static TypePatcherDelegate Factory(ILogger logger) {
         var method = MethodPatcher.Factory<IHarmonyPlugin>(logger, typeof(HarmonyPluginPatcher), typeof(PluginBase<>),
-                                                           "OnIsEnabledChanged");
+                                                           "");
         return (assemblyDefinition, typeDefinition) => method(assemblyDefinition, typeDefinition);
     }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.Factory

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Railroader.ModManager/Features/CodePatchers/HarmonyPluginPatcher.cs:42:47
         var context = (ModdingContext)plugin.ModdingContext;
 
         var state = _States.GetOrAdd(plugin,
-                                     _ => new(!plugin.IsEnabled, context.HarmonyFactory(plugin.Mod.Definition.Identifier)))!;
+                                     _ => new(plugin.IsEnabled, context.HarmonyFactory(plugin.Mod.Definition.Identifier)))!;
 
         if (state.IsEnabled == plugin.IsEnabled) {
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.UnpatchAllWhenDisabled; Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.IgnoreRepeatCalls; Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.PatchAllWhenEnabled

[Killed] Equality mutation
Railroader.ModManager/Features/CodePatchers/HarmonyPluginPatcher.cs:44:13
         var state = _States.GetOrAdd(plugin,
                                      _ => new(!plugin.IsEnabled, context.HarmonyFactory(plugin.Mod.Definition.Identifier)))!;
 
-        if (state.IsEnabled == plugin.IsEnabled) {
+        if (state.IsEnabled != plugin.IsEnabled) {
             return;
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.UnpatchAllWhenDisabled; Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.IgnoreRepeatCalls; Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.PatchAllWhenEnabled

[Killed] String mutation
Railroader.ModManager/Features/CodePatchers/HarmonyPluginPatcher.cs:54:40
             context.Logger.Information("Applying Harmony patch for mod {ModId}", plugin.Mod.Definition.Identifier);
             state.Harmony.PatchAll(plugin.GetType().Assembly);
         } else {
-            context.Logger.Information("Removing Harmony patch for mod {ModId}", plugin.Mod.Definition.Identifier);
+            context.Logger.Information("", plugin.Mod.Definition.Identifier);
             state.Harmony.UnpatchAll(plugin.Mod.Definition.Identifier);
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.UnpatchAllWhenDisabled
