[Killed] Bitwise mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:39:78
         string targetMethod,
         string? injectorMethod = null
     ) {
-        var injected = patcherType.GetMethod(injectorMethod ?? targetMethod, BindingFlags.Public | BindingFlags.Static);
+        var injected = patcherType.GetMethod(injectorMethod ?? targetMethod, BindingFlags.Public & BindingFlags.Static);
 
         var errors = ValidateInjector<TMarker>(injected).ToList();
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Null coalescing mutation (remove left)
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:39:46
         string targetMethod,
         string? injectorMethod = null
     ) {
-        var injected = patcherType.GetMethod(injectorMethod ?? targetMethod, BindingFlags.Public | BindingFlags.Static);
+        var injected = patcherType.GetMethod(targetMethod, BindingFlags.Public | BindingFlags.Static);
 
         var errors = ValidateInjector<TMarker>(injected).ToList();
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Negate expression
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:42:13
         var injected = patcherType.GetMethod(injectorMethod ?? targetMethod, BindingFlags.Public | BindingFlags.Static);
 
         var errors = ValidateInjector<TMarker>(injected).ToList();
-        if (injected == null || errors.Count > 0) {
+        if (!(injected == null || errors.Count > 0)) {
             throw new ValidationException("Failed to resolve injected method. See errors for details.", errors);
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Equality mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:42:13
         var injected = patcherType.GetMethod(injectorMethod ?? targetMethod, BindingFlags.Public | BindingFlags.Static);
 
         var errors = ValidateInjector<TMarker>(injected).ToList();
-        if (injected == null || errors.Count > 0) {
+        if (injected != null || errors.Count > 0) {
             throw new ValidationException("Failed to resolve injected method. See errors for details.", errors);
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Statement mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:43:13
 
         var errors = ValidateInjector<TMarker>(injected).ToList();
         if (injected == null || errors.Count > 0) {
-            throw new ValidationException("Failed to resolve injected method. See errors for details.", errors);
+            ;
         }
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod

[Killed] Equality mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:51:13
     }
 
     private static IEnumerable<string> ValidateInjector<TMarker>(MethodInfo? method) {
-        if (method == null) {
+        if (method != null) {
             yield return "Injected method must be public and static.";
             yield break;
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Statement mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:52:13
 
     private static IEnumerable<string> ValidateInjector<TMarker>(MethodInfo? method) {
         if (method == null) {
-            yield return "Injected method must be public and static.";
+            ;
             yield break;
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod

[Killed] String mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:52:26
 
     private static IEnumerable<string> ValidateInjector<TMarker>(MethodInfo? method) {
         if (method == null) {
-            yield return "Injected method must be public and static.";
+            yield return "";
             yield break;
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod

[Killed] Statement mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:53:13
     private static IEnumerable<string> ValidateInjector<TMarker>(MethodInfo? method) {
         if (method == null) {
             yield return "Injected method must be public and static.";
-            yield break;
+            ;
         }
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod

[Killed] Equality mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:56:13
             yield break;
         }
 
-        if (method.ReturnType != typeof(void)) {
+        if (method.ReturnType == typeof(void)) {
             yield return "Injected method must bave void return type.";
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.Factory; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Statement mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:57:13
         }
 
         if (method.ReturnType != typeof(void)) {
-            yield return "Injected method must bave void return type.";
+            ;
         }
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod

[Killed] String mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:57:26
         }
 
         if (method.ReturnType != typeof(void)) {
-            yield return "Injected method must bave void return type.";
+            yield return "";
         }
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:60:13
             yield return "Injected method must bave void return type.";
         }
 
-        if (!method.DeclaringType!.IsPublic) {
+        if (method.DeclaringType!.IsPublic) {
             yield return "Injected method declaring type must be public.";
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.Factory; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Statement mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:61:13
         }
 
         if (!method.DeclaringType!.IsPublic) {
-            yield return "Injected method declaring type must be public.";
+            ;
         }
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorClass

[Killed] Negate expression
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:65:13
         }
 
         var pars = method.GetParameters();
-        if (pars.Length != 1 || !pars[0].ParameterType.IsAssignableFrom(typeof(TMarker))) {
+        if (!(pars.Length != 1 || !pars[0].ParameterType.IsAssignableFrom(typeof(TMarker)))) {
             yield return $"Injected method must have single parameter assignable from {typeof(TMarker)}.";
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.Factory; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:65:33
         }
 
         var pars = method.GetParameters();
-        if (pars.Length != 1 || !pars[0].ParameterType.IsAssignableFrom(typeof(TMarker))) {
+        if (pars.Length != 1 || pars[0].ParameterType.IsAssignableFrom(typeof(TMarker))) {
             yield return $"Injected method must have single parameter assignable from {typeof(TMarker)}.";
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.Factory; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Statement mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:66:13
 
         var pars = method.GetParameters();
         if (pars.Length != 1 || !pars[0].ParameterType.IsAssignableFrom(typeof(TMarker))) {
-            yield return $"Injected method must have single parameter assignable from {typeof(TMarker)}.";
+            ;
         }
     }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ThrowInvalidInjectorMethod

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:71:13
     }
 
     private static bool Execute(this PatcherContext ctx, AssemblyDefinition asm, TypeDefinition type) {
-        if (!ctx.IsApplicable(type)) {
+        if (ctx.IsApplicable(type)) {
             return false;
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Boolean mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:72:20
 
     private static bool Execute(this PatcherContext ctx, AssemblyDefinition asm, TypeDefinition type) {
         if (!ctx.IsApplicable(type)) {
-            return false;
+            return true;
         }
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestsHarmonyPluginPatcher.Factory; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes

[Killed] Equality mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:76:55
         }
 
         var module = asm.MainModule;
-        var method = type.Methods.FirstOrDefault(m => m.Name == ctx.TargetMethod) ?? ctx.CreateOverride(type, module);
+        var method = type.Methods.FirstOrDefault(m => m.Name != ctx.TargetMethod) ?? ctx.CreateOverride(type, module);
 
         if (method == null) {
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Null coalescing mutation (left to right)
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:76:22
         }
 
         var module = asm.MainModule;
-        var method = type.Methods.FirstOrDefault(m => m.Name == ctx.TargetMethod) ?? ctx.CreateOverride(type, module);
+        var method = ctx.CreateOverride(type, module)?? type.Methods.FirstOrDefault(m => m.Name == ctx.TargetMethod);
 
         if (method == null) {
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch

[Killed] Equality mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:78:13
         var module = asm.MainModule;
         var method = type.Methods.FirstOrDefault(m => m.Name == ctx.TargetMethod) ?? ctx.CreateOverride(type, module);
 
-        if (method == null) {
+        if (method != null) {
             return false;
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Negate expression
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:85:13
         var injectedRef = module.ImportReference(ctx.InjectedMethod);
         var il          = method.Body.GetILProcessor();
 
-        if (il.HasCallTo(injectedRef)) {
+        if (!(il.HasCallTo(injectedRef))) {
             ctx.Logger.Information("Skipping patch of {TypeName} as it already contain code for {PluginInterface}",
                                    type.FullName, ctx.MarkerType);
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Statement mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:86:13
         var il          = method.Body.GetILProcessor();
 
         if (il.HasCallTo(injectedRef)) {
-            ctx.Logger.Information("Skipping patch of {TypeName} as it already contain code for {PluginInterface}",
-                                   type.FullName, ctx.MarkerType);
+            ;
             return false;
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch

[Killed] String mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:86:36
         var il          = method.Body.GetILProcessor();
 
         if (il.HasCallTo(injectedRef)) {
-            ctx.Logger.Information("Skipping patch of {TypeName} as it already contain code for {PluginInterface}",
+            ctx.Logger.Information("",
                                    type.FullName, ctx.MarkerType);
             return false;
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch

[Killed] Boolean mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:88:20
         if (il.HasCallTo(injectedRef)) {
             ctx.Logger.Information("Skipping patch of {TypeName} as it already contain code for {PluginInterface}",
                                    type.FullName, ctx.MarkerType);
-            return false;
+            return true;
         }
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch

[Killed] Statement mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:93:9
 
         // inject at the very start
         var first = method.Body.Instructions[0]!;
-        il.InsertBefore(first, il.Create(OpCodes.Ldarg_0));
+        ;
         il.InsertBefore(first, il.Create(OpCodes.Call, injectedRef));
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Statement mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:94:9
         // inject at the very start
         var first = method.Body.Instructions[0]!;
         il.InsertBefore(first, il.Create(OpCodes.Ldarg_0));
-        il.InsertBefore(first, il.Create(OpCodes.Call, injectedRef));
+        ;
 
         ctx.Logger.Information("Successfully patched {TypeName} for {PluginInterface}", type.FullName, ctx.MarkerType);
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Statement mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:96:9
         il.InsertBefore(first, il.Create(OpCodes.Ldarg_0));
         il.InsertBefore(first, il.Create(OpCodes.Call, injectedRef));
 
-        ctx.Logger.Information("Successfully patched {TypeName} for {PluginInterface}", type.FullName, ctx.MarkerType);
+        ;
 
         return true;
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Linq method mutation (Any() to All())
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:103:23
 
     private static bool IsApplicable(this PatcherContext ctx, TypeDefinition type) {
         var derived = ctx.IsDerivedFromBase(type);
-        var marker  = type.Interfaces.Any(i => i.InterfaceType?.FullName == ctx.MarkerType.FullName);
+        var marker  = type.Interfaces.All(i => i.InterfaceType?.FullName == ctx.MarkerType.FullName);
 
         if (!derived || !marker) {
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes

[Killed] Equality mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:103:48
 
     private static bool IsApplicable(this PatcherContext ctx, TypeDefinition type) {
         var derived = ctx.IsDerivedFromBase(type);
-        var marker  = type.Interfaces.Any(i => i.InterfaceType?.FullName == ctx.MarkerType.FullName);
+        var marker  = type.Interfaces.Any(i => i.InterfaceType?.FullName != ctx.MarkerType.FullName);
 
         if (!derived || !marker) {
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:105:25
         var derived = ctx.IsDerivedFromBase(type);
         var marker  = type.Interfaces.Any(i => i.InterfaceType?.FullName == ctx.MarkerType.FullName);
 
-        if (!derived || !marker) {
+        if (!derived || marker) {
             ctx.Logger.Debug(
                 "Skipping patching for type {TypeName}: not derived from {BaseType} or does not implement {MarkerInterface}",
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Logical mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:105:13
         var derived = ctx.IsDerivedFromBase(type);
         var marker  = type.Interfaces.Any(i => i.InterfaceType?.FullName == ctx.MarkerType.FullName);
 
-        if (!derived || !marker) {
+        if (!derived && !marker) {
             ctx.Logger.Debug(
                 "Skipping patching for type {TypeName}: not derived from {BaseType} or does not implement {MarkerInterface}",
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes

[Killed] Statement mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:106:13
         var marker  = type.Interfaces.Any(i => i.InterfaceType?.FullName == ctx.MarkerType.FullName);
 
         if (!derived || !marker) {
-            ctx.Logger.Debug(
-                "Skipping patching for type {TypeName}: not derived from {BaseType} or does not implement {MarkerInterface}",
-                type.FullName, ctx.TargetBaseType, ctx.MarkerType);
+            ;
             return false;
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes

[Killed] Boolean mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:109:20
             ctx.Logger.Debug(
                 "Skipping patching for type {TypeName}: not derived from {BaseType} or does not implement {MarkerInterface}",
                 type.FullName, ctx.TargetBaseType, ctx.MarkerType);
-            return false;
+            return true;
         }
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes

[Killed] Conditional (false) mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:116:49
     }
 
     private static bool IsDerivedFromBase(this PatcherContext ctx, TypeDefinition type) {
-        Func<TypeReference?, string?> getName = ctx.TargetBaseType.IsGenericTypeDefinition
-            ? r => (r as GenericInstanceType)?.ElementType?.FullName
-            : r => r?.FullName;
+        Func<TypeReference?, string?> getName = (false?r => (r as GenericInstanceType)?.ElementType?.FullName
+:r => r?.FullName);
 
         var cur = type;
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded_GenericBase

[Killed] Conditional (true) mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:116:49
     }
 
     private static bool IsDerivedFromBase(this PatcherContext ctx, TypeDefinition type) {
-        Func<TypeReference?, string?> getName = ctx.TargetBaseType.IsGenericTypeDefinition
-            ? r => (r as GenericInstanceType)?.ElementType?.FullName
-            : r => r?.FullName;
+        Func<TypeReference?, string?> getName = (true?r => (r as GenericInstanceType)?.ElementType?.FullName
+:r => r?.FullName);
 
         var cur = type;
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Equality mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:121:16
             : r => r?.FullName;
 
         var cur = type;
-        while (cur != null) {
+        while (cur == null) {
             if (getName(cur.BaseType) == ctx.TargetBaseType.FullName) {
                 return true;
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Equality mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:122:17
 
         var cur = type;
         while (cur != null) {
-            if (getName(cur.BaseType) == ctx.TargetBaseType.FullName) {
+            if (getName(cur.BaseType) != ctx.TargetBaseType.FullName) {
                 return true;
             }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipNotMarkedTypes; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists

[Killed] Boolean mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:123:24
         var cur = type;
         while (cur != null) {
             if (getName(cur.BaseType) == ctx.TargetBaseType.FullName) {
-                return true;
+                return false;
             }
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Statement mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:137:9
         TypeDefinition type,
         ModuleDefinition module
     ) {
-        ctx.Logger.Debug("{MethodName} method not found in {TypeName}, creating override", ctx.TargetMethod,
-                         type.FullName);
+        ;
 
         var baseMethod = ctx.FindVirtualBaseMethod(type.BaseType);
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] String mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:137:26
         TypeDefinition type,
         ModuleDefinition module
     ) {
-        ctx.Logger.Debug("{MethodName} method not found in {TypeName}, creating override", ctx.TargetMethod,
+        ctx.Logger.Debug("", ctx.TargetMethod,
                          type.FullName);
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Equality mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:141:13
                          type.FullName);
 
         var baseMethod = ctx.FindVirtualBaseMethod(type.BaseType);
-        if (baseMethod == null) {
+        if (baseMethod != null) {
             ctx.Logger.Error("Virtual method '{MethodName}' not found in {TypeName} hierarchy!", ctx.TargetMethod,
                              type.FullName);
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Statement mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:142:13
 
         var baseMethod = ctx.FindVirtualBaseMethod(type.BaseType);
         if (baseMethod == null) {
-            ctx.Logger.Error("Virtual method '{MethodName}' not found in {TypeName} hierarchy!", ctx.TargetMethod,
-                             type.FullName);
+            ;
             return null;
         }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists

[Killed] String mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:142:30
 
         var baseMethod = ctx.FindVirtualBaseMethod(type.BaseType);
         if (baseMethod == null) {
-            ctx.Logger.Error("Virtual method '{MethodName}' not found in {TypeName} hierarchy!", ctx.TargetMethod,
+            ctx.Logger.Error("", ctx.TargetMethod,
                              type.FullName);
             return null;
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.ErrorIfTargetMethodNotExists

[Killed] BitwiseNotExpression to un-BitwiseNotExpression mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:148:46
         }
 
         var baseRef = module.ImportReference(baseMethod);
-        var attrs = (baseMethod.Attributes & ~(MethodAttributes.Final | MethodAttributes.NewSlot)) |
+        var attrs = (baseMethod.Attributes & (MethodAttributes.Final | MethodAttributes.NewSlot)) |
                     MethodAttributes.HideBySig;
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded
