[Killed] Bitwise mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:148:22
         }
 
         var baseRef = module.ImportReference(baseMethod);
-        var attrs = (baseMethod.Attributes & ~(MethodAttributes.Final | MethodAttributes.NewSlot)) |
+        var attrs = (baseMethod.Attributes | ~(MethodAttributes.Final | MethodAttributes.NewSlot)) |
                     MethodAttributes.HideBySig;
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Statement mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:154:13
         var method = new MethodDefinition(ctx.TargetMethod, attrs, module.ImportReference(baseMethod.ReturnType));
 
         foreach (var p in baseMethod.Parameters) {
-            method.Parameters.Add(
-                new(p.Name, p.Attributes, module.ImportReference(p.ParameterType)));
+            ;
         }
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Statement mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:159:9
         }
 
         var il = method.Body.GetILProcessor();
-        il.Emit(OpCodes.Ldarg_0);
+        ;
 
         for (var i = 0; i < baseMethod.Parameters.Count; i++) {
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Equality mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:161:25
         var il = method.Body.GetILProcessor();
         il.Emit(OpCodes.Ldarg_0);
 
-        for (var i = 0; i < baseMethod.Parameters.Count; i++) {
+        for (var i = 0; i <= baseMethod.Parameters.Count; i++) {
             var ilCode = i switch {
                 0 => il.Create(OpCodes.Ldarg_1),
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:161:58
         var il = method.Body.GetILProcessor();
         il.Emit(OpCodes.Ldarg_0);
 
-        for (var i = 0; i < baseMethod.Parameters.Count; i++) {
+        for (var i = 0; i < baseMethod.Parameters.Count; i--) {
             var ilCode = i switch {
                 0 => il.Create(OpCodes.Ldarg_1),
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Statement mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:171:9
             il.Append(ilCode);
         }
 
-        il.Emit(OpCodes.Call, baseRef);
+        ;
         il.Emit(OpCodes.Ret);
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Statement mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:172:9
         }
 
         il.Emit(OpCodes.Call, baseRef);
-        il.Emit(OpCodes.Ret);
+        ;
 
         type.Methods.Add(method);
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Statement mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:174:9
         il.Emit(OpCodes.Call, baseRef);
         il.Emit(OpCodes.Ret);
 
-        type.Methods.Add(method);
+        ;
         ctx.Logger.Debug("Created {MethodName} override with base call in {TypeName}", ctx.TargetMethod, type.FullName);
         return method;
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Statement mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:175:9
         il.Emit(OpCodes.Ret);
 
         type.Methods.Add(method);
-        ctx.Logger.Debug("Created {MethodName} override with base call in {TypeName}", ctx.TargetMethod, type.FullName);
+        ;
         return method;
     }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] String mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:175:26
         il.Emit(OpCodes.Ret);
 
         type.Methods.Add(method);
-        ctx.Logger.Debug("Created {MethodName} override with base call in {TypeName}", ctx.TargetMethod, type.FullName);
+        ctx.Logger.Debug("", ctx.TargetMethod, type.FullName);
         return method;
     }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Equality mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:181:16
 
     private static MethodDefinition? FindVirtualBaseMethod(this PatcherContext ctx, TypeReference? baseRef) {
         var cur = baseRef?.Resolve();
-        while (cur != null) {
+        while (cur == null) {
             var m = cur.Methods.FirstOrDefault(m => m.Name == ctx.TargetMethod && m.IsVirtual);
             if (m != null) {
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Equality mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:182:53
     private static MethodDefinition? FindVirtualBaseMethod(this PatcherContext ctx, TypeReference? baseRef) {
         var cur = baseRef?.Resolve();
         while (cur != null) {
-            var m = cur.Methods.FirstOrDefault(m => m.Name == ctx.TargetMethod && m.IsVirtual);
+            var m = cur.Methods.FirstOrDefault(m => m.Name != ctx.TargetMethod && m.IsVirtual);
             if (m != null) {
                 return m;
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Logical mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:182:53
     private static MethodDefinition? FindVirtualBaseMethod(this PatcherContext ctx, TypeReference? baseRef) {
         var cur = baseRef?.Resolve();
         while (cur != null) {
-            var m = cur.Methods.FirstOrDefault(m => m.Name == ctx.TargetMethod && m.IsVirtual);
+            var m = cur.Methods.FirstOrDefault(m => m.Name == ctx.TargetMethod || m.IsVirtual);
             if (m != null) {
                 return m;
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Equality mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:183:17
         var cur = baseRef?.Resolve();
         while (cur != null) {
             var m = cur.Methods.FirstOrDefault(m => m.Name == ctx.TargetMethod && m.IsVirtual);
-            if (m != null) {
+            if (m == null) {
                 return m;
             }
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Block removal mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:183:28
         var cur = baseRef?.Resolve();
         while (cur != null) {
             var m = cur.Methods.FirstOrDefault(m => m.Name == ctx.TargetMethod && m.IsVirtual);
-            if (m != null) {
-                return m;
-            }
+            if (m != null) {}
 
             cur = cur.BaseType?.Resolve();
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded

[Killed] Linq method mutation (Any() to All())
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:195:9
 
 
     private static bool HasCallTo(this ILProcessor il, MethodReference target) =>
-        il.Body!.Instructions.Any(i =>
+        il.Body!.Instructions.All(i =>
                                       i.OpCode == OpCodes.Call && i.Operand is MethodReference mr && mr.FullName == target.FullName);
 
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch

[Killed] Equality mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:196:39
 
     private static bool HasCallTo(this ILProcessor il, MethodReference target) =>
         il.Body!.Instructions.Any(i =>
-                                      i.OpCode == OpCodes.Call && i.Operand is MethodReference mr && mr.FullName == target.FullName);
+                                      i.OpCode != OpCodes.Call && i.Operand is MethodReference mr && mr.FullName == target.FullName);
 
     private sealed record PatcherContext(
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.SkipDuplicatePatch

[Killed] Equality mutation
Railroader.ModManager/Features/CodePatchers/MethodPatcher.cs:196:102
 
     private static bool HasCallTo(this ILProcessor il, MethodReference target) =>
         il.Body!.Instructions.Any(i =>
-                                      i.OpCode == OpCodes.Call && i.Operand is MethodReference mr && mr.FullName == target.FullName);
+                                      i.OpCode == OpCodes.Call && i.Operand is MethodReference mr && mr.FullName != target.FullName);
 
     private sealed record PatcherContext(
killedBy: Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded; Railroader.ModManager.Tests.Features.CodePatchers.TestMethodPatcher.CreateOverrideIfNeeded
