[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Features/ModDefinitionLoader.cs:67:13
         var modDefinitions = new Dictionary<string, ModDefinition>(StringComparer.OrdinalIgnoreCase);
 
         var baseDirectory = Path.Combine(getCurrentDirectory(), "Mods");
-        if (!directoryExists(baseDirectory)) {
+        if (directoryExists(baseDirectory)) {
             logger.Warning("Mods directory not found at {baseDirectory}", baseDirectory);
             return [];
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.ReturnsEmptyArrayWhenModSDirectoryNotFound; Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.DetectAnyErrorWhenLoadingDefinitionJson; Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.DuplicateIdentifier_SkipsSecondAndLogsError

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModDefinitionLoader.cs:68:13
 
         var baseDirectory = Path.Combine(getCurrentDirectory(), "Mods");
         if (!directoryExists(baseDirectory)) {
-            logger.Warning("Mods directory not found at {baseDirectory}", baseDirectory);
+            ;
             return [];
         }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.ReturnsEmptyArrayWhenModSDirectoryNotFound

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Features/ModDefinitionLoader.cs:74:17
 
         foreach (var modDir in enumerateDirectories(baseDirectory)) {
             var definitionPath = Path.Combine(modDir, "Definition.json");
-            if (!fileExists(definitionPath)) {
+            if (fileExists(definitionPath)) {
                 logger.Warning("Not loading directory {directory}: Missing Definition.json.", modDir);
                 continue;
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.DetectAnyErrorWhenLoadingDefinitionJson; Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.DuplicateIdentifier_SkipsSecondAndLogsError; Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.SkipsModWithMissingDefinition_AndLogsWarning

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModDefinitionLoader.cs:75:17
         foreach (var modDir in enumerateDirectories(baseDirectory)) {
             var definitionPath = Path.Combine(modDir, "Definition.json");
             if (!fileExists(definitionPath)) {
-                logger.Warning("Not loading directory {directory}: Missing Definition.json.", modDir);
+                ;
                 continue;
             }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.SkipsModWithMissingDefinition_AndLogsWarning; Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.SkipsModsWithoutDefinition

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModDefinitionLoader.cs:76:17
             var definitionPath = Path.Combine(modDir, "Definition.json");
             if (!fileExists(definitionPath)) {
                 logger.Warning("Not loading directory {directory}: Missing Definition.json.", modDir);
-                continue;
+                ;
             }
 
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.SkipsModWithMissingDefinition_AndLogsWarning; Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.SkipsModsWithoutDefinition

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModDefinitionLoader.cs:79:13
                 continue;
             }
 
-            logger.Information("Loading definition from {directory} ...", modDir);
+            ;
             try {
                 var jObject = JObject.Parse(readAllText(definitionPath));
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.DetectAnyErrorWhenLoadingDefinitionJson; Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.ReturnsCorrectArray; Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.DetectDuplicateMods

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Features/ModDefinitionLoader.cs:83:21
             try {
                 var jObject = JObject.Parse(readAllText(definitionPath));
                 var modDef  = jObject.ToObject<ModDefinition>()!;
-                if (!modDef.IsValid) {
+                if (modDef.IsValid) {
                     logger.Error("Skipping mod at {definitionPath}: Invalid mod definition.", definitionPath);
                     continue;
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.DuplicateIdentifier_SkipsSecondAndLogsError; Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.ReturnsCorrectArray; Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.DetectDuplicateMods

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModDefinitionLoader.cs:84:21
                 var jObject = JObject.Parse(readAllText(definitionPath));
                 var modDef  = jObject.ToObject<ModDefinition>()!;
                 if (!modDef.IsValid) {
-                    logger.Error("Skipping mod at {definitionPath}: Invalid mod definition.", definitionPath);
+                    ;
                     continue;
                 }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.SkipsModsWithInvalidDefinition

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModDefinitionLoader.cs:85:21
                 var modDef  = jObject.ToObject<ModDefinition>()!;
                 if (!modDef.IsValid) {
                     logger.Error("Skipping mod at {definitionPath}: Invalid mod definition.", definitionPath);
-                    continue;
+                    ;
                 }
 
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.SkipsModsWithInvalidDefinition

[Killed] Negate expression
src/Railroader.ModManager/Features/ModDefinitionLoader.cs:88:21
                     continue;
                 }
 
-                if (modDefinitions.TryGetValue(modDef.Identifier, out var existing)) {
+                if (!(modDefinitions.TryGetValue(modDef.Identifier, out var existing))) {
                     logger.Error("Duplicate mod identifier '{identifier}' found in '{newDirectory}'. Already defined in '{existingDirectory}'.",
                                  modDef.Identifier, modDir, existing.BasePath);
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.DuplicateIdentifier_SkipsSecondAndLogsError; Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.ReturnsCorrectArray; Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.DetectDuplicateMods

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModDefinitionLoader.cs:89:21
                 }
 
                 if (modDefinitions.TryGetValue(modDef.Identifier, out var existing)) {
-                    logger.Error("Duplicate mod identifier '{identifier}' found in '{newDirectory}'. Already defined in '{existingDirectory}'.",
-                                 modDef.Identifier, modDir, existing.BasePath);
+                    ;
                     continue;
                 }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.DuplicateIdentifier_SkipsSecondAndLogsError; Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.DetectDuplicateMods

[Killed] String mutation
src/Railroader.ModManager/Features/ModDefinitionLoader.cs:89:34
                 }
 
                 if (modDefinitions.TryGetValue(modDef.Identifier, out var existing)) {
-                    logger.Error("Duplicate mod identifier '{identifier}' found in '{newDirectory}'. Already defined in '{existingDirectory}'.",
+                    logger.Error("",
                                  modDef.Identifier, modDir, existing.BasePath);
                     continue;
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.DuplicateIdentifier_SkipsSecondAndLogsError; Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.DetectDuplicateMods

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModDefinitionLoader.cs:91:21
                 if (modDefinitions.TryGetValue(modDef.Identifier, out var existing)) {
                     logger.Error("Duplicate mod identifier '{identifier}' found in '{newDirectory}'. Already defined in '{existingDirectory}'.",
                                  modDef.Identifier, modDir, existing.BasePath);
-                    continue;
+                    ;
                 }
 
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.DetectDuplicateMods

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModDefinitionLoader.cs:95:17
                 }
 
                 modDef.BasePath = modDir;
-                modDefinitions.Add(modDef.Identifier, modDef);
+                ;
             } catch (Exception exc) {
                 logger.Error("Failed to parse definition JSON: {exception}", exc);
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.DuplicateIdentifier_SkipsSecondAndLogsError; Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.ReturnsCorrectArray; Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.DetectDuplicateMods

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModDefinitionLoader.cs:97:17
                 modDef.BasePath = modDir;
                 modDefinitions.Add(modDef.Identifier, modDef);
             } catch (Exception exc) {
-                logger.Error("Failed to parse definition JSON: {exception}", exc);
+                ;
             }
         }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.DetectAnyErrorWhenLoadingDefinitionJson; Railroader.ModManager.Tests.Features.TestsModDefinitionLoader.DetectInvalidDefinitionJson
