[Killed] Conditional (false) mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:44:9
     ///     otherwise, an empty array.
     /// </returns>
     public static IReadOnlyList<ModDefinition> ValidateAndSort(ILogger logger, IReadOnlyList<ModDefinition> modDefinitions) =>
-        ValidateDependencies(logger, modDefinitions)
-            ? SortByDependencies(logger, modDefinitions)
-            : [];
+        (false?SortByDependencies(logger, modDefinitions)
+:[]);
 
     /// <summary>
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] Conditional (true) mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:44:9
     ///     otherwise, an empty array.
     /// </returns>
     public static IReadOnlyList<ModDefinition> ValidateAndSort(ILogger logger, IReadOnlyList<ModDefinition> modDefinitions) =>
-        ValidateDependencies(logger, modDefinitions)
-            ? SortByDependencies(logger, modDefinitions)
-            : [];
+        (true?SortByDependencies(logger, modDefinitions)
+:[]);
 
     /// <summary>
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] Boolean mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:58:24
     private static bool ValidateDependencies(ILogger logger, IReadOnlyList<ModDefinition> modDefinitions) {
         var modMap = modDefinitions.ToDictionary(mod => mod.Identifier, mod => mod, StringComparer.OrdinalIgnoreCase);
 
-        var hasError = false;
+        var hasError = true;
 
         foreach (var mod in modDefinitions) {
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] OrAssignmentExpression to ExclusiveOrAssignmentExpression mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:64:21
             // Verify Requirements
             if (mod.Requires != null) {
                 foreach (var (requiredId, fluentVersion) in mod.Requires) {
-                    hasError |= CheckRequirement(logger, mod, modMap, requiredId, fluentVersion);
+                    hasError ^= CheckRequirement(logger, mod, modMap, requiredId, fluentVersion);
                 }
             }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.MultipleErrors

[Killed] OrAssignmentExpression to AndAssignmentExpression mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:64:21
             // Verify Requirements
             if (mod.Requires != null) {
                 foreach (var (requiredId, fluentVersion) in mod.Requires) {
-                    hasError |= CheckRequirement(logger, mod, modMap, requiredId, fluentVersion);
+                    hasError &= CheckRequirement(logger, mod, modMap, requiredId, fluentVersion);
                 }
             }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] OrAssignmentExpression to ExclusiveOrAssignmentExpression mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:71:21
             // Verify Conflicts
             if (mod.ConflictsWith != null) {
                 foreach (var (conflictId, fluentVersion) in mod.ConflictsWith) {
-                    hasError |= CheckConflict(logger, mod, modMap, conflictId, fluentVersion);
+                    hasError ^= CheckConflict(logger, mod, modMap, conflictId, fluentVersion);
                 }
             }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.TwoConflicts_OriginalAccumulates_MutantWouldReset

[Killed] OrAssignmentExpression to AndAssignmentExpression mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:71:21
             // Verify Conflicts
             if (mod.ConflictsWith != null) {
                 foreach (var (conflictId, fluentVersion) in mod.ConflictsWith) {
-                    hasError |= CheckConflict(logger, mod, modMap, conflictId, fluentVersion);
+                    hasError &= CheckConflict(logger, mod, modMap, conflictId, fluentVersion);
                 }
             }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.ConflictWithoutVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.TwoConflicts_OriginalAccumulates_MutantWouldReset; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.ConflictDetected

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:76:16
             }
         }
 
-        return !hasError;
+        return hasError;
     }
 
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:89:13
     /// <param name="constraint">Optional version constraint.</param>
     /// <returns><c>true</c> if the requirement fails; otherwise, <c>false</c>.</returns>
     private static bool CheckRequirement(ILogger logger, ModDefinition mod, Dictionary<string, ModDefinition> modMap, string requiredId, FluentVersion? constraint) {
-        if (!modMap.TryGetValue(requiredId, out var requiredMod)) {
+        if (modMap.TryGetValue(requiredId, out var requiredMod)) {
             logger.Error("Mod '{identifier}' requires mod '{requiredId}', but it is not present.", mod.Identifier, requiredId);
             return true;
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:90:13
     /// <returns><c>true</c> if the requirement fails; otherwise, <c>false</c>.</returns>
     private static bool CheckRequirement(ILogger logger, ModDefinition mod, Dictionary<string, ModDefinition> modMap, string requiredId, FluentVersion? constraint) {
         if (!modMap.TryGetValue(requiredId, out var requiredMod)) {
-            logger.Error("Mod '{identifier}' requires mod '{requiredId}', but it is not present.", mod.Identifier, requiredId);
+            ;
             return true;
         }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.MissingRequirement; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.MissingDependencyInSort; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.MultipleErrors

[Killed] Boolean mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:91:20
     private static bool CheckRequirement(ILogger logger, ModDefinition mod, Dictionary<string, ModDefinition> modMap, string requiredId, FluentVersion? constraint) {
         if (!modMap.TryGetValue(requiredId, out var requiredMod)) {
             logger.Error("Mod '{identifier}' requires mod '{requiredId}', but it is not present.", mod.Identifier, requiredId);
-            return true;
+            return false;
         }
 
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.MissingRequirement; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.MissingDependencyInSort

[Killed] Logical mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:94:13
             return true;
         }
 
-        if (constraint == null || Satisfies(requiredMod.Version, constraint)) {
+        if (constraint == null && Satisfies(requiredMod.Version, constraint)) {
             return false;
         }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] Negate expression
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:94:13
             return true;
         }
 
-        if (constraint == null || Satisfies(requiredMod.Version, constraint)) {
+        if (!(constraint == null || Satisfies(requiredMod.Version, constraint))) {
             return false;
         }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] Boolean mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:95:20
         }
 
         if (constraint == null || Satisfies(requiredMod.Version, constraint)) {
-            return false;
+            return true;
         }
 
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:98:9
             return false;
         }
 
-        logger.Error(
-            "Mod '{identifier}' requires mod '{requiredId}' with version constraint '{fluentVersion}', but found version '{version}'.",
-            mod.Identifier, requiredId, constraint, requiredMod.Version
-        );
+        ;
         return true;
     }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] String mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:99:13
         }
 
         logger.Error(
-            "Mod '{identifier}' requires mod '{requiredId}' with version constraint '{fluentVersion}', but found version '{version}'.",
+            "",
             mod.Identifier, requiredId, constraint, requiredMod.Version
         );
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] Boolean mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:102:16
             "Mod '{identifier}' requires mod '{requiredId}' with version constraint '{fluentVersion}', but found version '{version}'.",
             mod.Identifier, requiredId, constraint, requiredMod.Version
         );
-        return true;
+        return false;
     }
 
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:115:13
     /// <param name="constraint">Optional version constraint.</param>
     /// <returns><c>true</c> if a conflict exists; otherwise, <c>false</c>.</returns>
     private static bool CheckConflict(ILogger logger, ModDefinition mod, Dictionary<string, ModDefinition> modMap, string conflictId, FluentVersion? constraint) {
-        if (!modMap.TryGetValue(conflictId, out var conflictingMod)) {
+        if (modMap.TryGetValue(conflictId, out var conflictingMod)) {
             return false;
         }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.ConflictWithNotInstalledMod; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.ConflictWithoutVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.TwoConflicts_OriginalAccumulates_MutantWouldReset

[Killed] Boolean mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:116:20
     /// <returns><c>true</c> if a conflict exists; otherwise, <c>false</c>.</returns>
     private static bool CheckConflict(ILogger logger, ModDefinition mod, Dictionary<string, ModDefinition> modMap, string conflictId, FluentVersion? constraint) {
         if (!modMap.TryGetValue(conflictId, out var conflictingMod)) {
-            return false;
+            return true;
         }
 
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.ConflictWithNotInstalledMod

[Killed] Negate expression
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:119:13
             return false;
         }
 
-        if (constraint != null && !Satisfies(conflictingMod.Version, constraint)) {
+        if (!(constraint != null && !Satisfies(conflictingMod.Version, constraint))) {
             return false;
         }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.ConflictWithInstalledModWithValidVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.ConflictWithoutVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.TwoConflicts_OriginalAccumulates_MutantWouldReset

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:119:35
             return false;
         }
 
-        if (constraint != null && !Satisfies(conflictingMod.Version, constraint)) {
+        if (constraint != null && Satisfies(conflictingMod.Version, constraint)) {
             return false;
         }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.ConflictWithInstalledModWithValidVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.MultipleErrors; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.ConflictDetected

[Killed] Boolean mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:120:20
         }
 
         if (constraint != null && !Satisfies(conflictingMod.Version, constraint)) {
-            return false;
+            return true;
         }
 
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.ConflictWithInstalledModWithValidVersion

[Killed] Equality mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:123:13
             return false;
         }
 
-        if (constraint != null) {
+        if (constraint == null) {
             logger.Error(
                 "Mod '{identifier}' conflicts with mod '{conflictId}' (version: '{version}', constraint: '{fluentVersion}').",
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.ConflictWithoutVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.TwoConflicts_OriginalAccumulates_MutantWouldReset; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.MultipleErrors

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:124:13
         }
 
         if (constraint != null) {
-            logger.Error(
-                "Mod '{identifier}' conflicts with mod '{conflictId}' (version: '{version}', constraint: '{fluentVersion}').",
-                mod.Identifier, conflictId, conflictingMod.Version, constraint
-            );
+            ;
         } else {
             logger.Error(
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.MultipleErrors; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.ConflictDetected

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:129:13
                 mod.Identifier, conflictId, conflictingMod.Version, constraint
             );
         } else {
-            logger.Error(
-                "Mod '{identifier}' conflicts with mod '{conflictId}' (version: '{version}').",
-                mod.Identifier, conflictId, conflictingMod.Version
-            );
+            ;
         }
 
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.ConflictWithoutVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.TwoConflicts_OriginalAccumulates_MutantWouldReset

[Killed] Boolean mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:162:24
         var visited     = new HashSet<string>(StringComparer.OrdinalIgnoreCase);
         var invalidMods = new HashSet<string>(StringComparer.OrdinalIgnoreCase);
 
-        var hasCycle = false;
+        var hasCycle = true;
         foreach (var mod in modDefinitions) {
             if (!visited.Contains(mod.Identifier)) {
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] Logical mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:165:28
         var hasCycle = false;
         foreach (var mod in modDefinitions) {
             if (!visited.Contains(mod.Identifier)) {
-                hasCycle = !Visit(mod, new()) || hasCycle;
+                hasCycle = !Visit(mod, new()) && hasCycle;
             }
         }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.CycleCausingMissingDependency

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:165:28
         var hasCycle = false;
         foreach (var mod in modDefinitions) {
             if (!visited.Contains(mod.Identifier)) {
-                hasCycle = !Visit(mod, new()) || hasCycle;
+                hasCycle = Visit(mod, new()) || hasCycle;
             }
         }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] Conditional (true) mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:169:16
             }
         }
 
-        return hasCycle ? [] : sorted.ToArray();
+        return (true?[] :sorted.ToArray());
 
         bool Visit(ModDefinition mod, Stack<string> path) {
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion

[Killed] Conditional (false) mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:169:16
             }
         }
 
-        return hasCycle ? [] : sorted.ToArray();
+        return (false?[] :sorted.ToArray());
 
         bool Visit(ModDefinition mod, Stack<string> path) {
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.CycleCausingMissingDependency

[Killed] Linq method mutation (Reverse() to AsEnumerable())
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:174:98
         bool Visit(ModDefinition mod, Stack<string> path) {
             if (path.Contains(mod.Identifier)) {
                 path.Push(mod.Identifier);
-                logger.Error("Cyclic dependency detected: {dependencyLoop}", string.Join(" -> ", path.Reverse()));
+                logger.Error("Cyclic dependency detected: {dependencyLoop}", string.Join(" -> ", path.AsEnumerable()));
                 return false;
             }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.CyclicDependency; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.CycleCausingMissingDependency

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:174:17
         bool Visit(ModDefinition mod, Stack<string> path) {
             if (path.Contains(mod.Identifier)) {
                 path.Push(mod.Identifier);
-                logger.Error("Cyclic dependency detected: {dependencyLoop}", string.Join(" -> ", path.Reverse()));
+                ;
                 return false;
             }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.TwoSeparateCycles_OriginalDetectsBoth_MutantMissesSecond; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.CyclicDependency; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.CycleCausingMissingDependency

[Killed] Boolean mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:175:24
             if (path.Contains(mod.Identifier)) {
                 path.Push(mod.Identifier);
                 logger.Error("Cyclic dependency detected: {dependencyLoop}", string.Join(" -> ", path.Reverse()));
-                return false;
+                return true;
             }
 
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.TwoSeparateCycles_OriginalDetectsBoth_MutantMissesSecond; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.CyclicDependency; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.CycleCausingMissingDependency

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:188:25
             if (mod.Requires != null) {
                 foreach (var requiredId in mod.Requires.Keys) {
                     if (invalidMods.Contains(requiredId)) {
-                        logger.Error(
-                            "Mod '{identifier}' cannot resolve mod '{requiredId}' because mod is part of a cyclic dependency.",
-                            mod.Identifier, requiredId
-                        );
+                        ;
                     } else if (!Visit(modMap[requiredId]!, path)) {
                         isValid = false;
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.CycleCausingMissingDependency

[Killed] String mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:189:29
                 foreach (var requiredId in mod.Requires.Keys) {
                     if (invalidMods.Contains(requiredId)) {
                         logger.Error(
-                            "Mod '{identifier}' cannot resolve mod '{requiredId}' because mod is part of a cyclic dependency.",
+                            "",
                             mod.Identifier, requiredId
                         );
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.CycleCausingMissingDependency

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Railroader.ModManager/Features/ModDefinitionValidator.cs:192:32
                             "Mod '{identifier}' cannot resolve mod '{requiredId}' because mod is part of a cyclic dependency.",
                             mod.Identifier, requiredId
                         );
-                    } else if (!Visit(modMap[requiredId]!, path)) {
+                    } else if (Visit(modMap[requiredId]!, path)) {
                         isValid = false;
                     }
killedBy: Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion; Railroader.ModManager.Tests.Features.TestsModDefinitionValidator.RequiredVersion
