[Killed] String mutation
src/Railroader.ModManager/Features/ModExtractor.cs:53:73
     [EditorBrowsable(EditorBrowsableState.Never)]
         var modsDirectory = Path.Combine(getCurrentDirectory(), "Mods");
-        var zipFiles      = directoryInfo(modsDirectory).EnumerateFiles("*.zip");
+        var zipFiles      = directoryInfo(modsDirectory).EnumerateFiles("");
 
         foreach (var zipFile in zipFiles) {
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_InvalidZip; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_NestedZip_SkipsRootAndExtractsCorrectly; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_WhenZipMoveFails

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModExtractor.cs:57:17
 
         foreach (var zipFile in zipFiles) {
             try {
-                TryExtractOne(logger, openRead, directoryExists, extractToDirectory, zipFile, modsDirectory, fileExists);
+                ;
             } catch (Exception exc) {
                 logger.Error(exc, "Failed to unzip archive {ZipPath}.", zipFile.FullName);
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_InvalidZip; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_NestedZip_SkipsRootAndExtractsCorrectly; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_WhenZipMoveFails

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModExtractor.cs:59:17
             try {
                 TryExtractOne(logger, openRead, directoryExists, extractToDirectory, zipFile, modsDirectory, fileExists);
             } catch (Exception exc) {
-                logger.Error(exc, "Failed to unzip archive {ZipPath}.", zipFile.FullName);
+                ;
             }
         }
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_InvalidZip; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_WhenFailsToOpenZip

[Killed] String mutation
src/Railroader.ModManager/Features/ModExtractor.cs:59:35
             try {
                 TryExtractOne(logger, openRead, directoryExists, extractToDirectory, zipFile, modsDirectory, fileExists);
             } catch (Exception exc) {
-                logger.Error(exc, "Failed to unzip archive {ZipPath}.", zipFile.FullName);
+                logger.Error(exc, "", zipFile.FullName);
             }
         }
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_InvalidZip; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_WhenFailsToOpenZip

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModExtractor.cs:93:9
     ///     On success, the archive is moved to a <c>.bak</c> backup.
     /// </remarks>
-        logger.Information("Processing mod archive {ZipPath} for extraction.", zipFile.FullName);
+        ;
 
         using var archive = openRead(zipFile.FullName)!;
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_InvalidZip; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_WhenZipMoveFails; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_MissingRequiredFields_SkipsZipAndLogsError

[Killed] String mutation
src/Railroader.ModManager/Features/ModExtractor.cs:93:28
     ///     On success, the archive is moved to a <c>.bak</c> backup.
     /// </remarks>
-        logger.Information("Processing mod archive {ZipPath} for extraction.", zipFile.FullName);
+        logger.Information("", zipFile.FullName);
 
         using var archive = openRead(zipFile.FullName)!;
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_InvalidZip; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_WhenZipMoveFails

[Killed] String mutation
src/Railroader.ModManager/Features/ModExtractor.cs:97:48
 
         using var archive = openRead(zipFile.FullName)!;
 
-        var definitionEntry = archive.GetEntry("Definition.json");
+        var definitionEntry = archive.GetEntry("");
         if (definitionEntry == null) {
             logger.Error("Skipping archive {ZipPath}: Missing 'Definition.json'.", zipFile.FullName);
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_NestedZip_SkipsRootAndExtractsCorrectly; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_WhenZipMoveFails; Railroader.ModManager.Tests.Features.TestsModExtractor.BackupNameCollision_UsesIncrementalSuffix

[Killed] Equality mutation
src/Railroader.ModManager/Features/ModExtractor.cs:98:13
         using var archive = openRead(zipFile.FullName)!;
 
         var definitionEntry = archive.GetEntry("Definition.json");
-        if (definitionEntry == null) {
+        if (definitionEntry != null) {
             logger.Error("Skipping archive {ZipPath}: Missing 'Definition.json'.", zipFile.FullName);
             return;
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_NestedZip_SkipsRootAndExtractsCorrectly; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_WhenZipMoveFails; Railroader.ModManager.Tests.Features.TestsModExtractor.BackupNameCollision_UsesIncrementalSuffix

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModExtractor.cs:99:13
 
         var definitionEntry = archive.GetEntry("Definition.json");
         if (definitionEntry == null) {
-            logger.Error("Skipping archive {ZipPath}: Missing 'Definition.json'.", zipFile.FullName);
+            ;
             return;
         }
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_MissingDefinitionJson_SkipsZipAndLogsError

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModExtractor.cs:100:13
         var definitionEntry = archive.GetEntry("Definition.json");
         if (definitionEntry == null) {
             logger.Error("Skipping archive {ZipPath}: Missing 'Definition.json'.", zipFile.FullName);
-            return;
+            ;
         }
 
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_MissingDefinitionJson_SkipsZipAndLogsError

[Killed] Equality mutation
src/Railroader.ModManager/Features/ModExtractor.cs:110:13
         }
 
         var modDefinition = TryDeserialize(logger, json, zipFile.FullName);
-        if (modDefinition?.IsValid != true) {
+        if (modDefinition?.IsValid == true) {
             logger.Error("Skipping archive {ZipPath}: Invalid mod definition.", zipFile.FullName);
             return;
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_NestedZip_SkipsRootAndExtractsCorrectly; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_WhenZipMoveFails; Railroader.ModManager.Tests.Features.TestsModExtractor.BackupNameCollision_UsesIncrementalSuffix

[Killed] Boolean mutation
src/Railroader.ModManager/Features/ModExtractor.cs:110:39
         }
 
         var modDefinition = TryDeserialize(logger, json, zipFile.FullName);
-        if (modDefinition?.IsValid != true) {
+        if (modDefinition?.IsValid != false) {
             logger.Error("Skipping archive {ZipPath}: Invalid mod definition.", zipFile.FullName);
             return;
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_NestedZip_SkipsRootAndExtractsCorrectly; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_WhenZipMoveFails; Railroader.ModManager.Tests.Features.TestsModExtractor.BackupNameCollision_UsesIncrementalSuffix

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModExtractor.cs:111:13
 
         var modDefinition = TryDeserialize(logger, json, zipFile.FullName);
         if (modDefinition?.IsValid != true) {
-            logger.Error("Skipping archive {ZipPath}: Invalid mod definition.", zipFile.FullName);
+            ;
             return;
         }
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_MissingRequiredFields_SkipsZipAndLogsError

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModExtractor.cs:112:13
         var modDefinition = TryDeserialize(logger, json, zipFile.FullName);
         if (modDefinition?.IsValid != true) {
             logger.Error("Skipping archive {ZipPath}: Invalid mod definition.", zipFile.FullName);
-            return;
+            ;
         }
 
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_MissingRequiredFields_SkipsZipAndLogsError

[Killed] Negate expression
src/Railroader.ModManager/Features/ModExtractor.cs:117:13
 
         var extractPath = Path.Combine(modsDirectory, modDefinition.Identifier);
 
-        if (directoryExists(extractPath)) {
+        if (!(directoryExists(extractPath))) {
             logger.Warning("Extraction path {ExtractPath} already exists – skipping mod {ModId}.", extractPath, modDefinition.Identifier);
             MoveToBackup(zipFile, logger, ".dup", fileExists);
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_NestedZip_SkipsRootAndExtractsCorrectly; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_WhenZipMoveFails; Railroader.ModManager.Tests.Features.TestsModExtractor.BackupNameCollision_UsesIncrementalSuffix

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModExtractor.cs:118:13
         var extractPath = Path.Combine(modsDirectory, modDefinition.Identifier);
 
         if (directoryExists(extractPath)) {
-            logger.Warning("Extraction path {ExtractPath} already exists – skipping mod {ModId}.", extractPath, modDefinition.Identifier);
+            ;
             MoveToBackup(zipFile, logger, ".dup", fileExists);
             return;
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_ValidZipWithDefinition_SkipIfDestinationFolderExits

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModExtractor.cs:119:13
 
         if (directoryExists(extractPath)) {
             logger.Warning("Extraction path {ExtractPath} already exists – skipping mod {ModId}.", extractPath, modDefinition.Identifier);
-            MoveToBackup(zipFile, logger, ".dup", fileExists);
+            ;
             return;
         }
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_ValidZipWithDefinition_SkipIfDestinationFolderExits

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModExtractor.cs:120:13
         if (directoryExists(extractPath)) {
             logger.Warning("Extraction path {ExtractPath} already exists – skipping mod {ModId}.", extractPath, modDefinition.Identifier);
             MoveToBackup(zipFile, logger, ".dup", fileExists);
-            return;
+            ;
         }
 
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_ValidZipWithDefinition_SkipIfDestinationFolderExits

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModExtractor.cs:123:9
             return;
         }
 
-        extractToDirectory(zipFile.FullName, extractPath);
+        ;
 
         logger.Information("Successfully extracted mod {ModId} from {ZipPath} to {ExtractPath}.", modDefinition.Identifier, zipFile.FullName, extractPath);
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_NestedZip_SkipsRootAndExtractsCorrectly; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_WhenZipMoveFails; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_MoveZipToBackup

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModExtractor.cs:125:9
 
         extractToDirectory(zipFile.FullName, extractPath);
 
-        logger.Information("Successfully extracted mod {ModId} from {ZipPath} to {ExtractPath}.", modDefinition.Identifier, zipFile.FullName, extractPath);
+        ;
 
         MoveToBackup(zipFile, logger, ".bak", fileExists);
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_WhenZipMoveFails; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_MoveZipToBackup; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_ValidZipWithDefinition_ExtractsToCorrectFolder

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModExtractor.cs:127:9
 
         logger.Information("Successfully extracted mod {ModId} from {ZipPath} to {ExtractPath}.", modDefinition.Identifier, zipFile.FullName, extractPath);
 
-        MoveToBackup(zipFile, logger, ".bak", fileExists);
+        ;
     }
 
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_NestedZip_SkipsRootAndExtractsCorrectly; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_WhenZipMoveFails; Railroader.ModManager.Tests.Features.TestsModExtractor.BackupNameCollision_UsesIncrementalSuffix

[Killed] String mutation
src/Railroader.ModManager/Features/ModExtractor.cs:127:39
 
         logger.Information("Successfully extracted mod {ModId} from {ZipPath} to {ExtractPath}.", modDefinition.Identifier, zipFile.FullName, extractPath);
 
-        MoveToBackup(zipFile, logger, ".bak", fileExists);
+        MoveToBackup(zipFile, logger, "", fileExists);
     }
 
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_NestedZip_SkipsRootAndExtractsCorrectly; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_WhenZipMoveFails; Railroader.ModManager.Tests.Features.TestsModExtractor.BackupNameCollision_UsesIncrementalSuffix

[Killed] Block removal mutation
src/Railroader.ModManager/Features/ModExtractor.cs:138:13
     /// <param name="zipPath">The path of the ZIP file, used for logging context.</param>
     /// <returns>The deserialized <see cref="ModDefinition" />, or <c>null</c> if parsing fails.</returns>
     private static ModDefinition? TryDeserialize(IMemoryLogger logger, string json, string zipPath) {
-        try {
-            return JsonConvert.DeserializeObject<ModDefinition>(json);
-        } catch (JsonException ex) {
+        try {} catch (JsonException ex) {
             logger.Error(ex, "Skipping archive {ZipPath}: Failed to parse Definition.json.", zipPath);
             return null;
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_NestedZip_SkipsRootAndExtractsCorrectly; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_WhenZipMoveFails; Railroader.ModManager.Tests.Features.TestsModExtractor.BackupNameCollision_UsesIncrementalSuffix

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModExtractor.cs:141:13
         try {
             return JsonConvert.DeserializeObject<ModDefinition>(json);
         } catch (JsonException ex) {
-            logger.Error(ex, "Skipping archive {ZipPath}: Failed to parse Definition.json.", zipPath);
+            ;
             return null;
         }
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_InvalidDefinitionJson_SkipsZipAndLogsError

[Killed] String mutation
src/Railroader.ModManager/Features/ModExtractor.cs:141:30
         try {
             return JsonConvert.DeserializeObject<ModDefinition>(json);
         } catch (JsonException ex) {
-            logger.Error(ex, "Skipping archive {ZipPath}: Failed to parse Definition.json.", zipPath);
+            logger.Error(ex, "", zipPath);
             return null;
         }
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_InvalidDefinitionJson_SkipsZipAndLogsError

[Timeout] Negate expression
src/Railroader.ModManager/Features/ModExtractor.cs:164:16
         var backupPath = basePath;
 
         var i = 1;
-        while (fileExists(backupPath)) {
+        while (!(fileExists(backupPath))) {
             backupPath = $"{basePath}{i++}";
         }

[Killed] PostIncrementExpression to PostDecrementExpression mutation
src/Railroader.ModManager/Features/ModExtractor.cs:165:39
 
         var i = 1;
         while (fileExists(backupPath)) {
-            backupPath = $"{basePath}{i++}";
+            backupPath = $"{basePath}{i--}";
         }
 
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.BackupNameCollision_UsesIncrementalSuffix

[Killed] String mutation
src/Railroader.ModManager/Features/ModExtractor.cs:165:26
 
         var i = 1;
         while (fileExists(backupPath)) {
-            backupPath = $"{basePath}{i++}";
+            backupPath = $"";
         }
 
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_WhenZipMoveFails; Railroader.ModManager.Tests.Features.TestsModExtractor.BackupNameCollision_UsesIncrementalSuffix; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_MoveZipToBackup

[Killed] Statement mutation
src/Railroader.ModManager/Features/ModExtractor.cs:168:9
             backupPath = $"{basePath}{i++}";
         }
 
-        zipFile.MoveTo(backupPath);
+        ;
     }
 }
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_NestedZip_SkipsRootAndExtractsCorrectly; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_WhenZipMoveFails; Railroader.ModManager.Tests.Features.TestsModExtractor.BackupNameCollision_UsesIncrementalSuffix
