[Killed] String mutation
src/Railroader.ModManager/Features/PluginManager.cs:69:84
     ///     A sequence of instantiated <see cref="IPlugin" /> objects. Empty if assembly fails to load.
     /// </returns>
     private static IEnumerable<IPlugin> InstantiatePlugins(IModdingContext moddingContext, ILogger logger, LoadFrom loadFrom, Mod mod) {
-        var assemblyPath = mod.AssemblyPath ?? throw new InvalidOperationException("Mod contract violation: AssemblyPath is null.");
+        var assemblyPath = mod.AssemblyPath ?? throw new InvalidOperationException("");
 
         var assembly = loadFrom(assemblyPath);
killedBy: Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_WhenAssemblyNull

[Killed] Equality mutation
src/Railroader.ModManager/Features/PluginManager.cs:72:13
         var assemblyPath = mod.AssemblyPath ?? throw new InvalidOperationException("Mod contract violation: AssemblyPath is null.");
 
         var assembly = loadFrom(assemblyPath);
-        if (assembly == null) {
+        if (assembly != null) {
             logger.Warning("Failed to load assembly from path: {AssemblyPath} for mod {ModId}",
                            assemblyPath, mod.Definition.Identifier);
killedBy: Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_IgnorePluginsWithInvalidConstructor; Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_IgnorePluginsWithInvalidConstructor; Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_ReturnValidInstances

[Killed] Statement mutation
src/Railroader.ModManager/Features/PluginManager.cs:73:13
 
         var assembly = loadFrom(assemblyPath);
         if (assembly == null) {
-            logger.Warning("Failed to load assembly from path: {AssemblyPath} for mod {ModId}",
-                           assemblyPath, mod.Definition.Identifier);
+            ;
             yield break;
         }
killedBy: Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_WhenAssemblyFailsToLoad

[Killed] Statement mutation
src/Railroader.ModManager/Features/PluginManager.cs:75:13
         if (assembly == null) {
             logger.Warning("Failed to load assembly from path: {AssemblyPath} for mod {ModId}",
                            assemblyPath, mod.Definition.Identifier);
-            yield break;
+            ;
         }
 
killedBy: Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_WhenAssemblyFailsToLoad

[Killed] Negate expression
src/Railroader.ModManager/Features/PluginManager.cs:81:17
         var pluginBaseType = typeof(PluginBase<>);
         var types          = assembly.GetTypes();
         foreach (var type in types) {
-            if (type.IsAbstract) {
+            if (!(type.IsAbstract)) {
                 continue;
             }
killedBy: Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_IgnorePluginsWithInvalidConstructor; Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_IgnorePluginsWithInvalidConstructor; Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_IgnoreAbstractClasses

[Killed] Negate expression
src/Railroader.ModManager/Features/PluginManager.cs:87:21
 
             if (type.BaseType is not { IsGenericType: true } baseType ||
                 baseType.GetGenericTypeDefinition() != pluginBaseType) {
-                if (typeof(IPlugin).IsAssignableFrom(type)) {
+                if (!(typeof(IPlugin).IsAssignableFrom(type))) {
                     logger.Warning(
                         "Type {Type} implements IPlugin but does not inherit from PluginBase<> in mod {ModId}",
killedBy: Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_IgnoreClassesNotDerivedFromPluginBase_AndWarnIfIPluginBaseIsImplemented

[Killed] Statement mutation
src/Railroader.ModManager/Features/PluginManager.cs:88:21
             if (type.BaseType is not { IsGenericType: true } baseType ||
                 baseType.GetGenericTypeDefinition() != pluginBaseType) {
                 if (typeof(IPlugin).IsAssignableFrom(type)) {
-                    logger.Warning(
-                        "Type {Type} implements IPlugin but does not inherit from PluginBase<> in mod {ModId}",
-                        type.FullName, mod.Definition.Identifier);
+                    ;
                 }
 
killedBy: Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_IgnoreClassesNotDerivedFromPluginBase_AndWarnIfIPluginBaseIsImplemented

[Killed] Bitwise mutation
src/Railroader.ModManager/Features/PluginManager.cs:96:44
                 continue;
             }
 
-            var ctor = type.GetConstructor(BindingFlags.Public | BindingFlags.NonPublic | BindingFlags.Instance, null!, [typeof(IModdingContext), typeof(IMod)], null!);
+            var ctor = type.GetConstructor(BindingFlags.Public | BindingFlags.NonPublic & BindingFlags.Instance, null!, [typeof(IModdingContext), typeof(IMod)], null!);
             if (ctor == null) {
                 logger.Warning(
killedBy: Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_ReturnValidInstances

[Killed] Bitwise mutation
src/Railroader.ModManager/Features/PluginManager.cs:96:44
                 continue;
             }
 
-            var ctor = type.GetConstructor(BindingFlags.Public | BindingFlags.NonPublic | BindingFlags.Instance, null!, [typeof(IModdingContext), typeof(IMod)], null!);
+            var ctor = type.GetConstructor(BindingFlags.Public & BindingFlags.NonPublic | BindingFlags.Instance, null!, [typeof(IModdingContext), typeof(IMod)], null!);
             if (ctor == null) {
                 logger.Warning(
killedBy: Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_ReturnValidInstances

[Killed] Equality mutation
src/Railroader.ModManager/Features/PluginManager.cs:97:17
             }
 
             var ctor = type.GetConstructor(BindingFlags.Public | BindingFlags.NonPublic | BindingFlags.Instance, null!, [typeof(IModdingContext), typeof(IMod)], null!);
-            if (ctor == null) {
+            if (ctor != null) {
                 logger.Warning(
                     "Cannot find constructor (IModdingContext, IMod) on plugin {Plugin} in mod {ModId}",
killedBy: Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_IgnorePluginsWithInvalidConstructor; Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_IgnorePluginsWithInvalidConstructor; Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_ReturnValidInstances

[Killed] Statement mutation
src/Railroader.ModManager/Features/PluginManager.cs:98:17
 
             var ctor = type.GetConstructor(BindingFlags.Public | BindingFlags.NonPublic | BindingFlags.Instance, null!, [typeof(IModdingContext), typeof(IMod)], null!);
             if (ctor == null) {
-                logger.Warning(
-                    "Cannot find constructor (IModdingContext, IMod) on plugin {Plugin} in mod {ModId}",
-                    type.FullName, mod.Definition.Identifier);
+                ;
                 continue;
             }
killedBy: Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_IgnorePluginsWithInvalidConstructor; Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_IgnorePluginsWithInvalidConstructor

[Killed] Statement mutation
src/Railroader.ModManager/Features/PluginManager.cs:101:17
                 logger.Warning(
                     "Cannot find constructor (IModdingContext, IMod) on plugin {Plugin} in mod {ModId}",
                     type.FullName, mod.Definition.Identifier);
-                continue;
+                ;
             }
 
killedBy: Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_IgnorePluginsWithInvalidConstructor; Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_IgnorePluginsWithInvalidConstructor

[Killed] Statement mutation
src/Railroader.ModManager/Features/PluginManager.cs:104:13
                 continue;
             }
 
-            yield return (IPlugin)ctor.Invoke([moddingContext, mod])!;
+            ;
         }
     }
killedBy: Railroader.ModManager.Tests.Features.TestsPluginManager.CreatePlugins_ReturnValidInstances
