[Killed] Statement mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:19:9
         Dictionary<string, FluentVersion?>? value,
         JsonSerializer serializer
     ) {
-        writer.WriteStartObject();
+        ;
         foreach (var pair in value!.OrderBy(o => o.Key)) {
             writer.WritePropertyName(pair.Key);
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.WriteJson

[Killed] Block removal mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:38:49
         bool hasExistingValue,
         JsonSerializer serializer
     ) {
-        if (reader.TokenType == JsonToken.Null) {
-            return new Dictionary<string, FluentVersion?>();
-        }
+        if (reader.TokenType == JsonToken.Null) {}
 
         var jObject = JObject.Load(reader);
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadNullDictionary

[Killed] Equality mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:38:13
         bool hasExistingValue,
         JsonSerializer serializer
     ) {
-        if (reader.TokenType == JsonToken.Null) {
+        if (reader.TokenType != JsonToken.Null) {
             return new Dictionary<string, FluentVersion?>();
         }
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidType; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] Statement mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:53:17
             }
 
             if (property.Value.Type != JTokenType.String) {
-                throw new JsonSerializationException(
-                    $"Invalid version constraint for mod '{identifier}' in {objectType}. Expected a string.");
+                ;
             }
 
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidType

[Killed] Conditional (true) mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:72:20
 
 
         var (op, skip) = constraint[0] switch {
-            '>' => constraint.Length > 1 && constraint[1] == '='
-                ? (VersionOperator.GreaterOrEqual, 2)
-                : (VersionOperator.GreaterThan, 1),
+            '>' => (true?(VersionOperator.GreaterOrEqual, 2)
+:(VersionOperator.GreaterThan, 1)),
             '<' => constraint.Length > 1 && constraint[1] == '='
                 ? (VersionOperator.LessOrEqual, 2)
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidJson

[Killed] Equality mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:72:20
 
 
         var (op, skip) = constraint[0] switch {
-            '>' => constraint.Length > 1 && constraint[1] == '='
+            '>' => constraint.Length >= 1 && constraint[1] == '='
                 ? (VersionOperator.GreaterOrEqual, 2)
                 : (VersionOperator.GreaterThan, 1),
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidJson

[Killed] Conditional (true) mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:75:20
             '>' => constraint.Length > 1 && constraint[1] == '='
                 ? (VersionOperator.GreaterOrEqual, 2)
                 : (VersionOperator.GreaterThan, 1),
-            '<' => constraint.Length > 1 && constraint[1] == '='
-                ? (VersionOperator.LessOrEqual, 2)
-                : (VersionOperator.LessThan, 1),
+            '<' => (true?(VersionOperator.LessOrEqual, 2)
+:(VersionOperator.LessThan, 1)),
             '='                                                                => (VersionOperator.Equal, 1),
             '0' or '1' or '2' or '3' or '4' or '5' or '6' or '7' or '8' or '9' => (VersionOperator.GreaterOrEqual, 0),
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidJson

[Killed] Conditional (false) mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:75:20
             '>' => constraint.Length > 1 && constraint[1] == '='
                 ? (VersionOperator.GreaterOrEqual, 2)
                 : (VersionOperator.GreaterThan, 1),
-            '<' => constraint.Length > 1 && constraint[1] == '='
-                ? (VersionOperator.LessOrEqual, 2)
-                : (VersionOperator.LessThan, 1),
+            '<' => (false?(VersionOperator.LessOrEqual, 2)
+:(VersionOperator.LessThan, 1)),
             '='                                                                => (VersionOperator.Equal, 1),
             '0' or '1' or '2' or '3' or '4' or '5' or '6' or '7' or '8' or '9' => (VersionOperator.GreaterOrEqual, 0),
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] Logical mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:79:13
                 ? (VersionOperator.LessOrEqual, 2)
                 : (VersionOperator.LessThan, 1),
             '='                                                                => (VersionOperator.Equal, 1),
-            '0' or '1' or '2' or '3' or '4' or '5' or '6' or '7' or '8' or '9' => (VersionOperator.GreaterOrEqual, 0),
+            '0' or '1' and '2' or '3' or '4' or '5' or '6' or '7' or '8' or '9' => (VersionOperator.GreaterOrEqual, 0),
             _                                                                  => (VersionOperator.Equal, -1)
         };
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] Logical mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:79:13
                 ? (VersionOperator.LessOrEqual, 2)
                 : (VersionOperator.LessThan, 1),
             '='                                                                => (VersionOperator.Equal, 1),
-            '0' or '1' or '2' or '3' or '4' or '5' or '6' or '7' or '8' or '9' => (VersionOperator.GreaterOrEqual, 0),
+            '0' or '1' or '2' or '3' or '4' or '5' or '6' or '7' and '8' or '9' => (VersionOperator.GreaterOrEqual, 0),
             _                                                                  => (VersionOperator.Equal, -1)
         };
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadValidJson

[Killed] UnaryMinusExpression to UnaryPlusExpression mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:80:107
                 : (VersionOperator.LessThan, 1),
             '='                                                                => (VersionOperator.Equal, 1),
             '0' or '1' or '2' or '3' or '4' or '5' or '6' or '7' or '8' or '9' => (VersionOperator.GreaterOrEqual, 0),
-            _                                                                  => (VersionOperator.Equal, -1)
+            _                                                                  => (VersionOperator.Equal, +1)
         };
 
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidJson

[Killed] Statement mutation
src/Railroader.ModManager/JsonConverters/ModReferenceJsonConverter.cs:91:9
         }
 
 
-        throw new JsonSerializationException(
-            $"Invalid version constraint '{constraint}' for mod '{identifier}'. Expected a valid System.Version or an operator (=, >, >=, <, <=) followed by a version.");
+        ;
     }
 }
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidJson; Railroader.ModManager.Tests.JsonConverters.TestsModReferenceJsonConverter.ReadInvalidJson
