[Killed] Equality mutation
src/Railroader.ModManager/JsonConverters/VersionJsonConverter.cs:24:13
         bool hasExistingValue,
         JsonSerializer serializer
     ) {
-        if (reader.TokenType == JsonToken.String) {
+        if (reader.TokenType != JsonToken.String) {
             var value = Convert.ToString(reader.Value!);
 
killedBy: Railroader.ModManager.Tests.JsonConverters.TestsVersionJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsVersionJsonConverter.ReadValidJson; Railroader.ModManager.Tests.JsonConverters.TestsVersionJsonConverter.ReadValidJson
