[Killed] Equality mutation
Manager/src/Railroader.ModManager/Mod.cs:24:17
     public bool IsEnabled {
         get => _IsEnabled;
         internal set {
-            if (_IsEnabled == value) {
+            if (_IsEnabled != value) {
                 return;
             }
killedBy: Railroader.ModManager.Tests.TestsMod.IsEnabledChangePropagateToPlugins

[Killed] Conditional (true) mutation
Manager/src/Railroader.ModManager/Mod.cs:53:33
 
     /// <inheritdoc />
     public ILogger CreateLogger(string? scope = null) =>
-        logger.ForSourceContext(scope == null ? Definition.Identifier : $"{Definition.Identifier}.{scope}");
+        logger.ForSourceContext((true?Definition.Identifier :$"{Definition.Identifier}.{scope}"));
 }
 
killedBy: Railroader.ModManager.Tests.TestsMod.CreateLogger

[Killed] Conditional (false) mutation
Manager/src/Railroader.ModManager/Mod.cs:53:33
 
     /// <inheritdoc />
     public ILogger CreateLogger(string? scope = null) =>
-        logger.ForSourceContext(scope == null ? Definition.Identifier : $"{Definition.Identifier}.{scope}");
+        logger.ForSourceContext((false?Definition.Identifier :$"{Definition.Identifier}.{scope}"));
 }
 
killedBy: Railroader.ModManager.Tests.TestsMod.CreateLogger
