[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Manager/src/Railroader.ModManager/ModDefinition.cs:50:65
 
     /// <summary> Gets a value indicating whether this mod definition is valid. </summary>
     [JsonIgnore]
-    public bool IsValid => !string.IsNullOrEmpty(Identifier) && !string.IsNullOrEmpty(Name) &&
+    public bool IsValid => !string.IsNullOrEmpty(Identifier) && string.IsNullOrEmpty(Name) &&
                            _IdentifierPattern.IsMatch(Identifier);
     
killedBy: Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_NestedZip_SkipsRootAndExtractsCorrectly; Railroader.ModManager.Tests.Features.TestsModExtractor.ExtractMods_WhenZipMoveFails; Railroader.ModManager.Tests.Features.TestsModExtractor.BackupNameCollision_UsesIncrementalSuffix

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Manager/src/Railroader.ModManager/ModDefinition.cs:50:28
 
     /// <summary> Gets a value indicating whether this mod definition is valid. </summary>
     [JsonIgnore]
-    public bool IsValid => !string.IsNullOrEmpty(Identifier) && !string.IsNullOrEmpty(Name) &&
+    public bool IsValid => string.IsNullOrEmpty(Identifier) && !string.IsNullOrEmpty(Name) &&
                            _IdentifierPattern.IsMatch(Identifier);
     
killedBy: Railroader.ModManager.Tests.TestsModDefinition.LoadFromValidJsonCorrectly; Railroader.ModManager.Tests.TestsModDefinition.LoadFrom_Identifier; Railroader.ModManager.Tests.TestsModDefinition.LoadFromInvalidJson_MissingId
