[Killed] Logical mutation
src/MemoryFileSystem/Internal/MemoryFileInfo.cs:14:17
 {
     public DateTime LastWriteTime {
         get {
-            if (fileSystem.Items.TryGetValue(FullName, out var entry) && entry is { IsDirectory: false }) {
+            if (fileSystem.Items.TryGetValue(FullName, out var entry) || entry is { IsDirectory: false }) {
                 return entry.LastWriteTime;
             }
killedBy: MemoryFileSystem.Tests.Internal.TestsMemoryFileInfo.LastWriteTime_ThrowsWhenNotFoundOrDirectory

[Killed] Equality mutation
src/MemoryFileSystem/Internal/MemoryFileInfo.cs:14:74
 {
     public DateTime LastWriteTime {
         get {
-            if (fileSystem.Items.TryGetValue(FullName, out var entry) && entry is { IsDirectory: false }) {
+            if (fileSystem.Items.TryGetValue(FullName, out var entry) && entry is not { IsDirectory: false }) {
                 return entry.LastWriteTime;
             }
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFileInfo.LastWriteTime; MemoryFileSystem.Tests.Internal.TestsMemoryFileInfo.LastWriteTime_ThrowsWhenNotFoundOrDirectory; MemoryFileSystem.Tests.Internal.TestsMemoryFileInfo.LastWriteTime_ForFile

[Killed] Statement mutation
src/MemoryFileSystem/Internal/MemoryFileInfo.cs:18:13
                 return entry.LastWriteTime;
             }
 
-            throw new FileNotFoundException($"File not found: '{FullName}'.");
+            ;
         }
     }
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFileInfo.LastWriteTime_WhenNotFound; MemoryFileSystem.Tests.Internal.TestsMemoryFileInfo.LastWriteTime_ThrowsWhenNotFoundOrDirectory; MemoryFileSystem.Tests.Internal.TestsMemoryFileInfo.LastWriteTime_ThrowsWhenNotFoundOrDirectory

[Killed] String mutation
src/MemoryFileSystem/Internal/MemoryFileInfo.cs:18:45
                 return entry.LastWriteTime;
             }
 
-            throw new FileNotFoundException($"File not found: '{FullName}'.");
+            throw new FileNotFoundException($"");
         }
     }
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFileInfo.LastWriteTime_WhenNotFound; MemoryFileSystem.Tests.Internal.TestsMemoryFileInfo.LastWriteTime_ThrowsWhenNotFoundOrDirectory; MemoryFileSystem.Tests.Internal.TestsMemoryFileInfo.LastWriteTime_ThrowsWhenNotFoundOrDirectory
