[Killed] Statement mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.cs:39:9
 public abstract partial class MemoryFileSystem : IMemoryFileSystem
 {
     protected MemoryFileSystem() {
-        Init_Directory();
+        ;
         Init_File();
         Init_ZipFile();
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesDirectory.GetCurrentDirectory_ThrowsForNonMemoryFs; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesDirectory.Exists; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesDirectory.Exists

[Killed] Statement mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.cs:40:9
 {
     protected MemoryFileSystem() {
         Init_Directory();
-        Init_File();
+        ;
         Init_ZipFile();
     }
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFileInfo.MoveTo; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.Exists; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.Exists

[Killed] Statement mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.cs:41:9
     protected MemoryFileSystem() {
         Init_Directory();
         Init_File();
-        Init_ZipFile();
+        ;
     }
 
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ThrowWhenSourceNotFoundOrDirectory; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ThrowWhenSourceNotFoundOrDirectory; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotFoundOrDirectory

[Killed] Negate expression
Manager/src/MemoryFileSystem/MemoryFileSystem.cs:90:13
 
     private static Regex ToRegex(string searchPattern) {
         var invalidPathChars = Path.GetInvalidFileNameChars();
-        if (searchPattern.Any(o => (o != '?') & (o != '*') && invalidPathChars.Contains(o))) {
+        if (!(searchPattern.Any(o => (o != '?') & (o != '*') && invalidPathChars.Contains(o)))) {
             throw new ArgumentException("Invalid search pattern.");
         }
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFileInfo.LastWriteTime; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFileInfo.FullName; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFileInfo.MoveTo

[Killed] Conditional (true) mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.cs:94:28
             throw new ArgumentException("Invalid search pattern.");
         }
 
-        var regexPattern = searchPattern == "*.*"
-            ? $"[^{Path.DirectorySeparatorChar}{Path.AltDirectorySeparatorChar}]*"
-            : Regex.Escape(searchPattern).Replace("\\*", ".*").Replace("\\?", ".");
+        var regexPattern = (true?$"[^{Path.DirectorySeparatorChar}{Path.AltDirectorySeparatorChar}]*"
+:Regex.Escape(searchPattern).Replace("\\*", ".*").Replace("\\?", "."));
 
         return new Regex("^" + regexPattern + "$", RegexOptions.IgnoreCase);
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemBase.Enumerate_NoMatchingFiles_ReturnsEmpty; MemoryFileSystem.Tests.TestsMemoryFileSystemBase.Enumerate_SpecificWildcardPatterns_MatchesCorrectly; MemoryFileSystem.Tests.TestsMemoryFileSystemBase.Enumerate_TopDirectoryOnly_MatchesPattern

[Killed] Boolean mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.cs:104:77
     public IEnumerable<MemoryEntry> Enumerate(string path, string searchPattern, SearchOption searchOption = SearchOption.TopDirectoryOnly) {
         path = NormalizePath(path);
 
-        if (!Items.TryGetValue(path, out var entry) || entry.IsDirectory != true) {
+        if (!Items.TryGetValue(path, out var entry) || entry.IsDirectory != false) {
             throw new DirectoryNotFoundException($"Directory not found: '{path}'.");
         }
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemBase.Enumerate_WildcardPattern_MatchesAllFiles; MemoryFileSystem.Tests.TestsMemoryFileSystemBase.Enumerate_NoMatchingFiles_ReturnsEmpty; MemoryFileSystem.Tests.TestsMemoryFileSystemBase.Enumerate_InvalidSearchPattern_ThrowsArgumentException

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.cs:104:13
     public IEnumerable<MemoryEntry> Enumerate(string path, string searchPattern, SearchOption searchOption = SearchOption.TopDirectoryOnly) {
         path = NormalizePath(path);
 
-        if (!Items.TryGetValue(path, out var entry) || entry.IsDirectory != true) {
+        if (Items.TryGetValue(path, out var entry) || entry.IsDirectory != true) {
             throw new DirectoryNotFoundException($"Directory not found: '{path}'.");
         }
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemBase.Enumerate_WildcardPattern_MatchesAllFiles; MemoryFileSystem.Tests.TestsMemoryFileSystemBase.Enumerate_NoMatchingFiles_ReturnsEmpty; MemoryFileSystem.Tests.TestsMemoryFileSystemBase.Enumerate_InvalidSearchPattern_ThrowsArgumentException

[Killed] Statement mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.cs:105:13
         path = NormalizePath(path);
 
         if (!Items.TryGetValue(path, out var entry) || entry.IsDirectory != true) {
-            throw new DirectoryNotFoundException($"Directory not found: '{path}'.");
+            ;
         }
 
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemBase.Enumerate_WhenDirectoryNotExists

[Killed] String mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.cs:105:50
         path = NormalizePath(path);
 
         if (!Items.TryGetValue(path, out var entry) || entry.IsDirectory != true) {
-            throw new DirectoryNotFoundException($"Directory not found: '{path}'.");
+            throw new DirectoryNotFoundException($"");
         }
 
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemBase.Enumerate_WhenDirectoryNotExists
