[Killed] Block removal mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.Delegates.Directory.cs:23:35
     [MemberNotNull(nameof(_DirectoryExists))]
     [MemberNotNull(nameof(_EnumerateDirectories))]
     [MemberNotNull(nameof(_GetCurrentDirectory))]
-    private void Init_Directory() {
-        _DirectoryExists      = CreateDirectoryExists();
-        _EnumerateDirectories = CreateEnumerateDirectories();
-        _GetCurrentDirectory  = CreateGetCurrentDirectory();
-    }
+    private void Init_Directory() {}
 
     private DirectoryExists      _DirectoryExists;
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesDirectory.GetCurrentDirectory_ThrowsForNonMemoryFs; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesDirectory.Exists; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesDirectory.Exists

[Killed] Statement mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.Delegates.Directory.cs:41:9
 
     private DirectoryExists CreateDirectoryExists() {
         var mock = Substitute.For<DirectoryExists>();
-        mock.Invoke(Arg.Any<string>())
-            .Returns([DebuggerStepThrough](o) => Items.TryGetValue(NormalizePath(o.Arg<string>()), out var entry) && entry is { IsDirectory: true });
+        ;
         return mock;
     }
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesDirectory.Exists

[Killed] Boolean mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.Delegates.Directory.cs:42:142
     private DirectoryExists CreateDirectoryExists() {
         var mock = Substitute.For<DirectoryExists>();
         mock.Invoke(Arg.Any<string>())
-            .Returns([DebuggerStepThrough](o) => Items.TryGetValue(NormalizePath(o.Arg<string>()), out var entry) && entry is { IsDirectory: true });
+            .Returns([DebuggerStepThrough](o) => Items.TryGetValue(NormalizePath(o.Arg<string>()), out var entry) && entry is { IsDirectory: false });
         return mock;
     }
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesDirectory.Exists; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesDirectory.Exists
