[Killed] Block removal mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.Delegates.File.cs:33:30
     [MemberNotNull(nameof(_Delete))]
     [MemberNotNull(nameof(_Move))]
     [MemberNotNull(nameof(_Create))]
-    private void Init_File() {
-        _FileExists = CreateExists();
-        _ReadAllText = CreateReadAllText();
-        _GetLastWriteTime = CreateGetLastWriteTime();
-        _Delete = CreateDelete();
-        _Move = CreateMove();
-        _Create = CreateCreate();
-    }
+    private void Init_File() {}
 
     private FileExists           _FileExists;
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.Exists; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.Exists; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.Exists

[Killed] Statement mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.Delegates.File.cs:58:9
 
     private FileExists CreateExists() {
         var mock = Substitute.For<FileExists>();
-        mock.Invoke(Arg.Any<string>())
-            .Returns([DebuggerStepThrough](o) => Items.TryGetValue(NormalizePath(o.Arg<string>()), out var entry) && entry is { IsDirectory: false });
+        ;
         return mock;
     }
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.Exists

[Killed] Statement mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.Delegates.File.cs:65:9
 
     private ReadAllText CreateReadAllText() {
         var mock = Substitute.For<ReadAllText>();
-        mock.Invoke(Arg.Any<string>()).Returns(o => {
-            var path = NormalizePath(o.Arg<string>());
-            if (!Items.TryGetValue(path, out var entry) || entry is not { IsDirectory: false }) {
-                throw new FileNotFoundException($"File not found: {path}");
-            }
-
-            if (entry.ReadException != null) {
-                throw entry.ReadException;
-            }
-
-            return Encoding.UTF8.GetString(entry.Content!);
-        });
+        ;
         return mock;
     }
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_ThrowsWhenException; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_ThrowsWhenNotFoundOrDirectory; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_ThrowsWhenNotFoundOrDirectory

[Killed] Equality mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.Delegates.File.cs:67:60
         var mock = Substitute.For<ReadAllText>();
         mock.Invoke(Arg.Any<string>()).Returns(o => {
             var path = NormalizePath(o.Arg<string>());
-            if (!Items.TryGetValue(path, out var entry) || entry is not { IsDirectory: false }) {
+            if (!Items.TryGetValue(path, out var entry) || entry is { IsDirectory: false }) {
                 throw new FileNotFoundException($"File not found: {path}");
             }
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_ThrowsWhenException; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_ThrowsWhenNotFoundOrDirectory; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_WhenValid

[Killed] Boolean mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.Delegates.File.cs:67:88
         var mock = Substitute.For<ReadAllText>();
         mock.Invoke(Arg.Any<string>()).Returns(o => {
             var path = NormalizePath(o.Arg<string>());
-            if (!Items.TryGetValue(path, out var entry) || entry is not { IsDirectory: false }) {
+            if (!Items.TryGetValue(path, out var entry) || entry is not { IsDirectory: true }) {
                 throw new FileNotFoundException($"File not found: {path}");
             }
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_ThrowsWhenException; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_ThrowsWhenNotFoundOrDirectory; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_WhenValid

[Killed] String mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.Delegates.File.cs:68:49
         mock.Invoke(Arg.Any<string>()).Returns(o => {
             var path = NormalizePath(o.Arg<string>());
             if (!Items.TryGetValue(path, out var entry) || entry is not { IsDirectory: false }) {
-                throw new FileNotFoundException($"File not found: {path}");
+                throw new FileNotFoundException($"");
             }
 
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_ThrowsWhenNotFoundOrDirectory; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_ThrowsWhenNotFoundOrDirectory

[Killed] Equality mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.Delegates.File.cs:84:59
         var mock = Substitute.For<GetLastWriteTime>();
         mock.Invoke(Arg.Any<string>()).Returns(o => {
             var path = NormalizePath(o.Arg<string>());
-            if (Items.TryGetValue(path, out var entry) && entry is { IsDirectory: false }) {
+            if (Items.TryGetValue(path, out var entry) && entry is not { IsDirectory: false }) {
                 return entry.LastWriteTime;
             }
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.GetLastWriteTime_ThrowsWhenNotFoundOrDirectory; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.GetLastWriteTime_WhenValid

[Killed] Block removal mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.Delegates.File.cs:84:92
         var mock = Substitute.For<GetLastWriteTime>();
         mock.Invoke(Arg.Any<string>()).Returns(o => {
             var path = NormalizePath(o.Arg<string>());
-            if (Items.TryGetValue(path, out var entry) && entry is { IsDirectory: false }) {
-                return entry.LastWriteTime;
-            }
+            if (Items.TryGetValue(path, out var entry) && entry is { IsDirectory: false }) {}
 
             throw new FileNotFoundException($"File not found: {path}");
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.GetLastWriteTime_WhenValid

[Killed] Equality mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.Delegates.File.cs:125:83
                 var destFileName   = NormalizePath(o.ArgAt<string>(1));
 
                 lock (_MoveLock) {
-                    if (!Items.TryGetValue(sourceFileName, out var sourceFile) || sourceFile is not { IsDirectory: false }) {
+                    if (!Items.TryGetValue(sourceFileName, out var sourceFile) || sourceFile is { IsDirectory: false }) {
                         throw new FileNotFoundException($"Source file not found: '{sourceFileName}'.");
                     }
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFileInfo.MoveTo; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenSourceLocked; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenValid

[Killed] Logical mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.Delegates.File.cs:125:25
                 var destFileName   = NormalizePath(o.ArgAt<string>(1));
 
                 lock (_MoveLock) {
-                    if (!Items.TryGetValue(sourceFileName, out var sourceFile) || sourceFile is not { IsDirectory: false }) {
+                    if (!Items.TryGetValue(sourceFileName, out var sourceFile) && sourceFile is not { IsDirectory: false }) {
                         throw new FileNotFoundException($"Source file not found: '{sourceFileName}'.");
                     }
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenSourceNotFoundOrDirectory

[Killed] String mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.Delegates.File.cs:130:61
                     }
 
                     if (Items.ContainsKey(destFileName)) {
-                        throw new InvalidOperationException($"Destination path already exists: '{destFileName}'.");
+                        throw new InvalidOperationException($"");
                     }
 
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.Move_WhenDestinationExists
