[Killed] Block removal mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.Delegates.ZipFile.cs:23:33
 
     [MemberNotNull(nameof(_ExtractToDirectory))]
     [MemberNotNull(nameof(_OpenRead))]
-    private void Init_ZipFile() {
-        _ExtractToDirectory = CreateExtractToDirectory();
-        _OpenRead = CreateOpenRead();
-    }
+    private void Init_ZipFile() {}
 
     private ExtractToDirectory _ExtractToDirectory;
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ThrowWhenSourceNotFoundOrDirectory; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ThrowWhenSourceNotFoundOrDirectory; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotFoundOrDirectory

[Killed] Statement mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.Delegates.ZipFile.cs:36:9
 
     private ExtractToDirectory CreateExtractToDirectory() {
         var mock = Substitute.For<ExtractToDirectory>();
-        mock.When(o => o.Invoke(Arg.Any<string>(), Arg.Any<string>())).Do(o => {
-            var normalizedSource = NormalizePath(o.ArgAt<string>(0));
-            var normalizedDest   = NormalizePath(o.ArgAt<string>(1));
-
-            if (!Items.TryGetValue(normalizedSource, out var zipEntry) || zipEntry.IsDirectory) {
-                throw new FileNotFoundException($"Zip file '{normalizedSource}' not found.");
-            }
-
-            // Deserialize zip contents
-            try {
-                var entries = new MemoryZip(zipEntry.Content!);
-                foreach (var entry in entries.OrderBy(p => p.Path.Length)) {
-                    Add(entry with { Path = Path.Combine(normalizedDest, entry.Path) });
-                }
-            } catch (JsonException ex) {
-                throw new InvalidDataException($"Failed to deserialize zip contents for '{normalizedSource}'.", ex);
-            }
-        });
+        ;
         return mock;
     }
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotFoundOrDirectory; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotFoundOrDirectory; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotZip

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.Delegates.ZipFile.cs:40:17
             var normalizedSource = NormalizePath(o.ArgAt<string>(0));
             var normalizedDest   = NormalizePath(o.ArgAt<string>(1));
 
-            if (!Items.TryGetValue(normalizedSource, out var zipEntry) || zipEntry.IsDirectory) {
+            if (Items.TryGetValue(normalizedSource, out var zipEntry) || zipEntry.IsDirectory) {
                 throw new FileNotFoundException($"Zip file '{normalizedSource}' not found.");
             }
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotFoundOrDirectory; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractToDirectory_ThrowWhenSourceNotZip; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractNestedZipFile_CreatesCorrectEntries

[Killed] Linq method mutation (OrderBy() to OrderByDescending())
Manager/src/MemoryFileSystem/MemoryFileSystem.Delegates.ZipFile.cs:47:39
             // Deserialize zip contents
             try {
                 var entries = new MemoryZip(zipEntry.Content!);
-                foreach (var entry in entries.OrderBy(p => p.Path.Length)) {
+                foreach (var entry in entries.OrderByDescending(p => p.Path.Length)) {
                     Add(entry with { Path = Path.Combine(normalizedDest, entry.Path) });
                 }
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractNestedZipFile_CreatesCorrectEntries

[Killed] Block removal mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.Delegates.ZipFile.cs:47:76
             // Deserialize zip contents
             try {
                 var entries = new MemoryZip(zipEntry.Content!);
-                foreach (var entry in entries.OrderBy(p => p.Path.Length)) {
-                    Add(entry with { Path = Path.Combine(normalizedDest, entry.Path) });
-                }
+                foreach (var entry in entries.OrderBy(p => p.Path.Length)) {}
             } catch (JsonException ex) {
                 throw new InvalidDataException($"Failed to deserialize zip contents for '{normalizedSource}'.", ex);
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesZipFile.ExtractNestedZipFile_CreatesCorrectEntries

[Killed] Statement mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.Delegates.ZipFile.cs:59:9
 
     private OpenRead CreateOpenRead() {
         var mock = Substitute.For<OpenRead>();
-        mock.Invoke(Arg.Any<string>()).Returns(o => {
-            var normalizedPath = NormalizePath(o.Arg<string>());
-            if (!Items.TryGetValue(normalizedPath, out var zipEntry) || zipEntry.IsDirectory) {
-                throw new FileNotFoundException($"Zip file '{normalizedPath}' not found.");
-            }
-
-            return new MemoryZipArchive(new MemoryZip(zipEntry.Content!)).Mock();
-        });
+        ;
         return mock;
     }
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ThrowWhenSourceNotFoundOrDirectory; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ThrowWhenSourceNotFoundOrDirectory; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ReturnsCorrectZipArchive

[Killed] Logical mutation
Manager/src/MemoryFileSystem/MemoryFileSystem.Delegates.ZipFile.cs:61:17
         var mock = Substitute.For<OpenRead>();
         mock.Invoke(Arg.Any<string>()).Returns(o => {
             var normalizedPath = NormalizePath(o.Arg<string>());
-            if (!Items.TryGetValue(normalizedPath, out var zipEntry) || zipEntry.IsDirectory) {
+            if (!Items.TryGetValue(normalizedPath, out var zipEntry) && zipEntry.IsDirectory) {
                 throw new FileNotFoundException($"Zip file '{normalizedPath}' not found.");
             }
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ThrowWhenSourceNotFoundOrDirectory; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesZipFile.OpenRead_ThrowWhenSourceNotFoundOrDirectory
