[Killed] Null coalescing mutation (remove left)
Manager/src/MemoryFileSystem/MemoryFs.cs:14:76
 
 public sealed class MemoryFs : MemoryFileSystem, IMemoryFs
 {
-    public MemoryFs(string? currentDirectory = null) => CurrentDirectory = currentDirectory ?? "C:\\";
+    public MemoryFs(string? currentDirectory = null) => CurrentDirectory = "C:\\";
 
     private string _CurrentDirectory = null!;
killedBy: MemoryFileSystem.Tests.TestsMemoryFs.NormalizePath_RelativePath_FromCurrent; MemoryFileSystem.Tests.TestsMemoryFs.Constructor_SetCurrentDirectoryAddsAlParents; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesDirectory.GetCurrentDirectory_ReturnsMemoryFsCurrentDirectory

[Killed] String mutation
Manager/src/MemoryFileSystem/MemoryFs.cs:14:96
 
 public sealed class MemoryFs : MemoryFileSystem, IMemoryFs
 {
-    public MemoryFs(string? currentDirectory = null) => CurrentDirectory = currentDirectory ?? "C:\\";
+    public MemoryFs(string? currentDirectory = null) => CurrentDirectory = currentDirectory ?? "";
 
     private string _CurrentDirectory = null!;
killedBy: MemoryFileSystem.Tests.TestsMemoryFs.NormalizePath_ThrowWhenEmpty; MemoryFileSystem.Tests.TestsMemoryFs.NormalizePath_ThrowWhenEmpty; MemoryFileSystem.Tests.TestsMemoryFs.Constructor_SetDefaultCurrentDirectory

[Killed] String mutation
Manager/src/MemoryFileSystem/MemoryFs.cs:29:13
     }
 
     public override string NormalizePath(string path) {
-        if (string.IsNullOrEmpty(path)) {
+        if ((path!=null)) {
             throw new ArgumentException("Path cannot be null or empty.");
         }
killedBy: MemoryFileSystem.Tests.Internal.TestsMemoryFileInfo.FullName; MemoryFileSystem.Tests.Internal.TestsMemoryFileInfo.LastWriteTime_ThrowsWhenNotFoundOrDirectory; MemoryFileSystem.Tests.Internal.TestsMemoryFileInfo.LastWriteTime_ThrowsWhenNotFoundOrDirectory

[Killed] Negate expression
Manager/src/MemoryFileSystem/MemoryFs.cs:39:13
         }
 
         path = Path.GetFullPath(path);
-        if (path.Length > 3) { // Trim trailing slash for non-root paths
+        if (!(path.Length > 3)) { // Trim trailing slash for non-root paths
             path = path.TrimEnd('\\');
         }
killedBy: MemoryFileSystem.Tests.TestsMemoryFs.NormalizePath_TrimTrailingSlash; MemoryFileSystem.Tests.TestsMemoryFs.NormalizePath_KeepTrailingSlashOnRoot
