[Killed] String mutation
Manager/src/MemoryFileSystem/MemoryZip.cs:28:13
     }
 
     public override string NormalizePath(string path) {
-        if (string.IsNullOrEmpty(path)) {
+        if ((path!="")) {
             throw new ArgumentException("Path cannot be null or empty.");
         }
killedBy: MemoryFileSystem.Tests.TestsMemoryZip.NormalizePath_ThrowWhenEmpty; MemoryFileSystem.Tests.TestsMemoryZip.Constructor_DeserializeEntriesFromByteArray; MemoryFileSystem.Tests.TestsMemoryZip.NormalizePath_ThrowWhenAbsolute

[Killed] UnaryMinusExpression to UnaryPlusExpression mutation
Manager/src/MemoryFileSystem/MemoryZip.cs:46:25
 
     protected override string? GetParentPath(string path) {
         var index = path.LastIndexOf('/');
-        return index == -1 ? null : path.Substring(0, index);
+        return index == +1 ? null : path.Substring(0, index);
     }
 
killedBy: MemoryFileSystem.Tests.Internal.TestsMemoryZipArchive.Entries; MemoryFileSystem.Tests.Internal.TestsMemoryZipArchive.GetEntry_ReturnsCorrectZipArchiveEntry
