[Killed] Null coalescing mutation (remove left)
src/MemoryFileSystem/Types/MemoryEntry.cs:14:34
     public static readonly DateTime DefaultLastWriteTime = new(2000, 1, 1);
 
     public MemoryEntry(string folderPath, DateTime? lastWriteTime = null, bool locked = false)
-        : this(folderPath, true, lastWriteTime ?? DefaultLastWriteTime, null, null, locked) {
+        : this(folderPath, true, DefaultLastWriteTime, null, null, locked) {
     }
 
killedBy: MemoryFileSystem.Tests.Types.TestsMemoryEntry.Folder; MemoryFileSystem.Tests.Types.TestsMemoryEntry.Folder

[Killed] Boolean mutation
src/MemoryFileSystem/Types/MemoryEntry.cs:14:28
     public static readonly DateTime DefaultLastWriteTime = new(2000, 1, 1);
 
     public MemoryEntry(string folderPath, DateTime? lastWriteTime = null, bool locked = false)
-        : this(folderPath, true, lastWriteTime ?? DefaultLastWriteTime, null, null, locked) {
+        : this(folderPath, false, lastWriteTime ?? DefaultLastWriteTime, null, null, locked) {
     }
 
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesDirectoryInfo.EnumerateFiles; MemoryFileSystem.Tests.Types.TestsMemoryEntry.Folder; MemoryFileSystem.Tests.Types.TestsMemoryEntry.Folder

[Killed] Boolean mutation
src/MemoryFileSystem/Types/MemoryEntry.cs:18:26
     }
 
     public MemoryEntry(string filePath, byte[] content, DateTime? lastWriteTime = null, bool locked = false)
-        : this(filePath, false, lastWriteTime ?? DefaultLastWriteTime, content, null, locked) {
+        : this(filePath, true, lastWriteTime ?? DefaultLastWriteTime, content, null, locked) {
     }
 
killedBy: MemoryFileSystem.Tests.Internal.TestsMemoryFileInfo.MoveTo; MemoryFileSystem.Tests.Internal.TestsMemoryFileInfo.LastWriteTime_ForFile; MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.Exists

[Killed] Null coalescing mutation (remove left)
src/MemoryFileSystem/Types/MemoryEntry.cs:18:33
     }
 
     public MemoryEntry(string filePath, byte[] content, DateTime? lastWriteTime = null, bool locked = false)
-        : this(filePath, false, lastWriteTime ?? DefaultLastWriteTime, content, null, locked) {
+        : this(filePath, false, DefaultLastWriteTime, content, null, locked) {
     }
 
killedBy: MemoryFileSystem.Tests.Types.TestsMemoryEntry.BinaryFile; MemoryFileSystem.Tests.Types.TestsMemoryEntry.BinaryFile

[Killed] Boolean mutation
src/MemoryFileSystem/Types/MemoryEntry.cs:22:26
     }
 
     public MemoryEntry(string filePath, Exception exception, DateTime? lastWriteTime = null, bool locked = false)
-        : this(filePath, false, lastWriteTime ?? DefaultLastWriteTime, null, exception, locked) {
+        : this(filePath, true, lastWriteTime ?? DefaultLastWriteTime, null, exception, locked) {
     }
 
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemDelegatesFile.ReadAllText_ThrowsWhenException; MemoryFileSystem.Tests.Types.TestsMemoryEntry.UnreadableFile

[Killed] Null coalescing mutation (remove left)
src/MemoryFileSystem/Types/MemoryEntry.cs:22:33
     }
 
     public MemoryEntry(string filePath, Exception exception, DateTime? lastWriteTime = null, bool locked = false)
-        : this(filePath, false, lastWriteTime ?? DefaultLastWriteTime, null, exception, locked) {
+        : this(filePath, false, DefaultLastWriteTime, null, exception, locked) {
     }
 
killedBy: MemoryFileSystem.Tests.Types.TestsMemoryEntry.UnreadableFile

[Killed] Block removal mutation
src/MemoryFileSystem/Types/MemoryEntry.cs:26:136
     }
 
     [method: JsonConstructor]
-    private MemoryEntry(string Path, bool IsDirectory, DateTime LastWriteTime, byte[]? Content, Exception? ReadException, bool Locked) {
-        this.Path = Path;
-        this.IsDirectory = IsDirectory;
-        this.LastWriteTime = LastWriteTime;
-        this.Content = Content;
-        this.ReadException = ReadException;
-        this.Locked = Locked;
-    }
+    private MemoryEntry(string Path, bool IsDirectory, DateTime LastWriteTime, byte[]? Content, Exception? ReadException, bool Locked) {}
     
     public void CheckLock() {
killedBy: MemoryFileSystem.Tests.TestsMemoryFileSystemBase.UnlockFile; MemoryFileSystem.Tests.TestsMemoryFileSystemBase.Enumerate_WildcardPattern_MatchesAllFiles; MemoryFileSystem.Tests.TestsMemoryFileSystemBase.Enumerate_NoMatchingFiles_ReturnsEmpty
